{
  "id": 5,
  "title": "NOI-HERT",
  "nodes": [
    {
      "id": 1,
      "recap": "intro 5",
      "type": "Story",
      "text": "-------------------------------\n|          CHAPTER 5          |\n-------------------------------\n\n\n$cAll around you is thick darkness. \nYou have no body, no eyes. \nJust an adimensional point, in the void. \nYou 'hear' hollow sounds around, like thunders. \n\nThen, you think you can see sinisters glares. \nThe Chief's sword gets closer and closer, its tip menacingly pointed at your eyes. \nThe shiny edge is ever closer, closer... \n\nYou shout. The darkness reacts, vibrating in response to such a huge amount of anger and pain. \nThen, suddenly, as answering to the farthest echoes of your unaware call, light comes to you. \nA blinding flash hits you, piercing through every particle in your body. \n\nYou are one with the light now. \nYou hear a warm voice whispering, or maybe thinking of whispering:\n\n$G<<Have courage!>>#\n\n$c... Are you not alone?",
      "childid": 6
    },
    {
      "id": 6,
      "recap": "prechoice",
      "type": "Story",
      "text": "The light keeps on tormenting you. You open your eyes, and realize the sun is lighting your face. \nWas it just a dream?#\n\nYou rub your eyes, stand up and exit the cave. \nAs you stretch your body, you look around. Someone has lit a fire. \nYou appreciate its warmth, as you feel the chill early morning air on your skin. \n\nThe absurdity of what you're experiencing comes back haunting you. \nWhat is this place?# Who are these people?# Where is home?#\n\nEverything is too surreal to be true. The Horde... And what about them three?\nThe girl has something peculiar, something that makes her different from the others around. \nThere is a special light in her eyes, and her poise is always elegant, self-confident# and seductive. \nIn her gaze there's something noble, something you sense clearly in the giant as well. \nOnly the dwarf seems to be completely unrelated to everything and everyone else you've seen so far... \n\nBut, somehow, you don't know why but you feel you can trust them. \nMaybe they are savages, but not $Wanimals$C. \n\n\nInterrupting your thoughts, Smiurl appears from behind a boulder, carrying some bundle in his arms.",
      "childid": 2
    },
    {
      "id": 2,
      "recap": "talk,eat,investigate",
      "type": "Choice",
      "text": "Standing close to the fire, you think about what to do next.",
      "choices": [
        {
          "desc": "You are starving. Ask Smiurl about breakfast.",
          "childid": 3
        },
        {
          "desc": "You need to know what's going on... Before something else happens.",
          "childid": 4
        },
        {
          "desc": "Better look around the caravan spoils for something useful.",
          "childid": 5,
          "unhide": 3,
          "isnotrepeatable": true
        },
        {
          "ishidden": true,
          "desc": "You are done here. Better get moving now.",
          "childid": 7
        }
      ]
    },
    {
      "id": 3,
      "recap": "breakfast at Smiurl's",
      "type": "Dialogue",
      "dialogues": [
        {
          "actor": "Smiurl",
          "line": "Oh! Goodmorning Kriss! Slept well? Are you hungry?",
          "comment": "He anticipates you, thoughtfully."
        },
        {
          "actor": "Kriss",
          "line": "Hi Smiurl. I am not entirely certain, but I'm hungry for sure!"
        },
        {
          "actor": "Smiurl",
          "precomment": "He goes next to the fire and starts handling and unpacking the stuff he has carried.",
          "line": "The chariots have been raided... But I managed to find some food. \nHere it is: a jar of water, some brandy, dried meat, some sand-fruit and pears..."
        },
        {
          "actor": "Kriss",
          "line": "Sand-what?"
        },
        {
          "actor": "Smiurl",
          "line": "Sand-fruit!# Don't tell me you don't know what they are!# It's a delicacy. \nThey should be prepared with Pinzerro sap, shouldn't they?\nI guess I'll have to work it out with what I have here..."
        },
        {
          "actor": "Kriss",
          "precomment": "You still have no idea what he's talking about. He hands you one of them to let you see. \nIt looks a bit like a seashell, as big as a walnut.",
          "line": "What kind of stuff is this?",
          "break": true
        },
        {
          "actor": "Smiurl",
          "line": "I can't believe you're asking it! These are Croeggs larvae."
        },
        {
          "actor": "Kriss",
          "line": "Larvae?... You mean... insects??",
          "comment": "You give him back his 'sand-fruit'."
        },
        {
          "actor": "Smiurl",
          "line": "Insects, of course! But not just any insect. An elder Croegg can weigh as much as you. I caught one this big once...",
          "comment": "\nAnd he measures the air indicating something over one meter long."
        },
        {
          "actor": "Smiurl",
          "precomment": "You must have made a disgusted expression, as he adds, after looking suprised seeing your face:",
          "line": "Well, I'll have to eat your serving too!",
          "comment": "And he merrily takes the sand-fruit back.",
          "childid": 2
        }
      ]
    },
    {
      "id": 4,
      "recap": "revelations",
      "type": "Dialogue",
      "dialogues": [
        {
          "actor": "Kriss",
          "line": "Listen, Smiurl...",
          "comment": "You start, looking at him seriously."
        },
        {
          "actor": "Kriss",
          "line": "Could you tell me something...?# I mean...# Where are we exactly?"
        },
        {
          "actor": "Smiurl",
          "precomment": "#He looks at you, puzzled.",
          "line": "Uh? We're still in the canyon, aren't we? What do you mean..."
        },
        {
          "actor": "Theo",
          "line": "I don't think that's what he's asking.",
          "comment": "You hear Theo and Corolla approaching from behind your back."
        },
        {
          "actor": "Corolla",
          "line": "Yep.",
          "comment": "\n\nYou turn around. They stop and stand there staring at you. \nThey seem to expect from you to say something next.",
          "break": true
        },
        {
          "precomment": "$c<<That's it>># $CYou think. #$c<<The 'moment of truth'>>$C Where to start?\nYou start with the very basics. You smile nervously, and say in a quiet voice:",
          "actor": "Kriss",
          "line": "First of all, we are still on Earth, right?"
        },
        {
          "actor": "Smiurl",
          "precomment": "Corolla startles. Even Theo's face darkens, in spite of his usual imperturbability.",
          "line": "No.",
          "comment": "The little guy answers simply, as it was a normal thing for you to say."
        },
        {
          "actor": "Smiurl",
          "line": "This is $WNoi-Hert$Y.",
          "comment": "He looks at you calmly, as he continues preparing breakfast."
        },
        {
          "actor": "Kriss",
          "line": "Huh??# No-what??",
          "comment": "As your disbelief increases."
        },
        {
          "actor": "Corolla",
          "line": "Wait a minute... Kriss, could you tell us in which time are we?"
        },
        {
          "precomment": "Afraid of answering at this point, you almost beg:",
          "actor": "Kriss",
          "line": "Please, tell me this is the 21st century!"
        },
        {
          "precomment": "Corolla bows her head, looking away. Theo shakes his.",
          "actor": "Theo",
          "line": "You'd better sit down, young man.",
          "comment": "\n\nThen, he starts talking again.",
          "childid": 8
        }
      ]
    },
    {
      "id": 8,
      "recap": "Theo tells Noi-Hert's story",
      "type": "Story",
      "text": "$BNoi-Hert was discovered five centuries after the Great Religion War,\nfew decades after interstellar travel was made possible. \n\nIt was the first inhabitable planet discovered by the Earthers ships. \nIt is a little smaller than the Earth, about two-thirds of its volume,\nbut it has a greater nucleus density, so the gravity is about the same. \n\nWith just a little moon, it orbits lonely around a G-type star\nthat everybody called sun but had no real name. \n\nOver time, the Earthers established many colonies on the surface,\nfor commercial, reasearch and overpopulation reasons. \n\nThe best and the worst of the Earth arrived here. \nA lot of brilliant minds, scientists, artists, pursuing new discoveries\nand exploring new horizons, with a whole planet at their disposal. \nBut, also, a lot of low-lives, jailbirds, the most despicable\nfrom every kind of culture and environment, fleeing from the world\nthat rejected, hunted them down relentlessly. \n\nA huge penitentiary complex was also built on the other side of this planet,\nas this side flourished giving way to new, unmatched scientific progress. \nThere was space for everybody, and every commodity and resource\nwas shipped by the Earth on its $WTitans$B, the huge orbital ships. \n\nBut this was one of the reasons of the collapse, too.",
      "childid": 9
    },
    {
      "id": 9,
      "recap": "More story",
      "type": "Story",
      "text": "$BOne day, without notice, after some twenty years of frantic development,\nthe Earthers abandoned the colonies to themselves. \n\nIn time, legends started spreading. \nFunny stories about spirits of this planet emerging from the sea and the land to drive out the human invaders,\nonly sparing those who were born here. At first, very few believed such myths. \nThe wisest ones were convinced there had to be a way more concrete explanation behind all of it. \nA war, maybe some cataclysm, on the Earth... \n\nRegardless of the actual reason, the colonists soon realized there was little they could do,\nin order to limit the damage deriving from the exile imposed on them. \nWithout the Titans, global communications broke down, as well the great commercial routes. \nMachines and Earth technology started to fade as there was no proper supply chain\nto refurbish and repair and improve the existent. \nWithout access to Earth's knowledge, scientists and researchers had to start over, takin a massive leap backwards. \n\nThen, with decades, centuries, the old generations were replaced,\ngiving way to a fragmenting society led by the strongest, most violent elements. \n\nHordes started forming and everything descended more and more into anarchy.",
      "childid": 10
    },
    {
      "id": 10,
      "recap": "take in the truth",
      "type": "Dialogue",
      "dialogues": [
        {
          "precomment": "You sit down on the ground taking in what Theo just told you. $c<<He never talks, but when he does...!>>$C#\n\nYou try to make some sense of his story, and after few minutes of silent meditating, you resolutely say:",
          "actor": "Kriss",
          "line": "I can't believe it.# It would mean I traveled through time!# It's clearly impossible!"
        },
        {
          "actor": "Corolla",
          "line": "We're having an hard time believing you too, so we are kinda even...",
          "comment": "Corolla smiles shrugging her shoulders."
        },
        {
          "actor": "Corolla",
          "precomment": "You still can't wrap your mind around it. \nWhat are you doing there?# Where will you go?# What will be of you?\nYou think about all the people you left home, they must be so worried... \n$c<<You are a missing person>># $CYou say to yourself. \n\nCorolla sees your distress, kneels next to you and says, hand on your shoulder:",
          "line": "Do not worry too much now. We'll find an answer somehow."
        },
        {
          "precomment": "You look at her, still depressed. Why do she and the others seem to care about you?\nLooking at her expression, you manage to produce half a smile and say, actually feeling it:",
          "actor": "Kriss",
          "line": "Thanks...",
          "childid": 2
        }
      ]
    },
    {
      "id": 5,
      "recap": "find Ayonn tech",
      "type": "Dialogue",
      "dialogues": [
        {
          "precomment": "You slowly walk towards what's left of the convoy. You are already having second thoughts,\nsince you have to traverse that field of death alone now. \n\nLuckily, you spot Theo far ahead and Corolla too, among the wreckage. They must have thought the same thing. \n\nIn the daylight, the view is miserable. \nBodies, burnt chariots, debris... \nYou start thinking about the eventuality of searching the bodies... \n\n$Y\"Hey look what I found!\"$C Smiurl calls from behind. \n\nYou and the others walk to him to see. \n\nHe's leaning over a body, close to his dead horse. You don't recognize him. Was he one of the defensors?",
          "actor": "Corolla",
          "line": "What's this stuff?",
          "comment": "Corolla points at some kind of armor the guy wears. Wore. You got it.",
          "replies": [
            {
              "line": "You think it's time to man up. Show her... them... you are not a crybaby.",
              "nextline": "touchArmor"
            },
            {
              "line": "Getting even closer? Touching the dead body? no way!",
              "nextline": "theoTouches"
            }
          ]
        },
        {
          "linename": "touchArmor",
          "precomment": "You kneel down. You try not to look the dead man in his glassy eyes. You focus on the plates on his chest. \nYou touch slighlty the surface of the armor, and suddenly it lights up!\nYou abruptly withdraw your hand, and the armor fades off again, slowly. \nBefore shutting off completely, it lights up with glares like little electrical storms, looking like... holograms?",
          "actor": "Corolla",
          "line": "What the...!",
          "nextline": "itsAyonn"
        },
        {
          "linename": "theoTouches",
          "precomment": "Theo senses your hesitation, and quickly kneels down. \nHe touches slighlty the surface of the armor, and suddenly it lights up!\nHe abruptly withdraws his hand, and the armor fades off again, slowly. \nBefore shutting off completely, it lights up with glares like little electrical storms, looking like... holograms?",
          "actor": "Corolla",
          "line": "What the...!",
          "nextline": "itsAyonn"
        },
        {
          "linename": "itsAyonn",
          "precomment": "Theo grabs several plates, pulling them and detaching them from the rest of the armor. \nYou all go in a well lit place, and away from the body, to better look at that piece of technology. \n\nYou watch as Theo handles the plates, studying them from every angle. \nAfter a short while he points at some kind of bulge with two indicator lights.",
          "actor": "Theo",
          "line": "This is the energy supply..."
        },
        {
          "precomment": "Then, pointing at the whole thing:",
          "actor": "Theo",
          "line": "This can only be a product of Ayonn."
        },
        {
          "precomment": "Smiurl shrieks in fear.",
          "actor": "Corolla",
          "line": "Are you sure of it?",
          "comment": "She asks, suddenly serious."
        },
        {
          "actor": "Theo",
          "line": "Absolutely. No one else has tech like this anymore.",
          "break": true
        },
        {
          "precomment": "After a while, you break the silence:",
          "actor": "Kriss",
          "line": "What this Ayonn would be?"
        },
        {
          "actor": "Smiurl",
          "line": "The legendary city of Ayonn, the impenetrable!",
          "comment": "He declaims, with a fearful voice."
        },
        {
          "actor": "Kriss",
          "line": "Impenetrable?"
        },
        {
          "actor": "Smiurl",
          "line": "Yes! Ayonn, the city of light, protected by its everlasting magic shield!",
          "comment": "He breathes in sharply, then continues:"
        },
        {
          "actor": "Smiurl",
          "line": "You see, Ayonn is the magical city which resist, eternal, since the times of the abandon!\nNobody can get in, not even get close to it. \nIts magic shield is an invincible defense, even from just the $Wthought$Y of attacking it!\n\nInside the city are untold riches and luxuries... \nAnd they say the few dwellers of the city that have ever been seen, they shine their own light!",
          "comment": "\nHe explains in an excited crescendo. \nThen he falls silent at once, as if he fears his own words."
        },
        {
          "actor": "Kriss",
          "line": "Interesting. At least this could explain what we saw last night...",
          "comment": "You say unimpressed."
        },
        {
          "actor": "Theo",
          "line": "And this armor as well",
          "comment": "Theo concludes.",
          "childid": 2
        }
      ]
    },
    {
      "id": 7,
      "recap": "is this my party - towards Ayonn",
      "type": "Story",
      "text": "You walk away from the fire and the others. \nYou start to have a weird feeling. \n\nYou can't be here just randomly. There must be some reason. \n\nAnd if there is a thing you know now, it's you won't have peace until you'll find it. \n\n$c<<And these guys here they seem to believe in me. Like they were... waiting for someone like me?>>\n\n<<What am I thinking!# What should I expect from myself now, to become their leader?>>$C\n\nYou are lost in your thoughts, looking at the horizon. \nYou barely notice the others getting close to behind you. \nYou barely notice your own hand moving, as it has its own will, reaching for the sword. \n\nYou don't know what you feel more, if surprised, or determined, when you find yourself exclaiming,\nwhile you theatrically draw your sword, pointing it to the west:\n\n$c\"To Ayonn!\"",
      "islast": true
    }
  ]
}