{
  "id": 6,
  "title": "BEACONS",
  "nodes": [
    {
      "id": 1,
      "recap": "start ch 6",
      "type": "Dialogue",
      "text": "-------------------------------\n|          CHAPTER 6          |\n-------------------------------\n\n\n",
      "dialogues": [
        {
          "actor": "Smiurl",
          "line": "Hey Kriss... tell me... how did you know this was the direction to take?",
          "comment": "Smiurl asks you,\nwhile he fights with the straps of his backpack, almost double in size compared to him."
        },
        {
          "actor": "Kriss",
          "line": "Huh...?# I don't know...# Instinct?",
          "comment": "You shrug your shoulders, smiling at the little guy."
        },
        {
          "actor": "Theo",
          "precomment": "Corolla is silently looking sideways at you. Theo notices it, then says:",
          "line": "You got guts, kid, that's for sure..."
        },
        {
          "actor": "Kriss",
          "line": "Why would I?# It can't be so terrible... I mean, It's just a city. \nBesides, we go in peace. I don't see why...",
          "comment": "You stop talking, seeing how Theo looks away and sighs,\nsilently staring at the ground in front of his feet. \n\nYou all fall silent for the rest of the morning. \n\nYou wonder if everyone is busy thinking about what's going on, if they should stop indulging you. \nYou still don't understand why they're sticking to you. \n\nIt is with relief, after few hours,\nthat you stop and sit down against a rock, when Theo signals to rest and eat something.",
          "childid": 2
        }
      ]
    },
    {
      "id": 2,
      "type": "Action",
      "recap": "rest in desert",
      "text": "The weight of the sword tied on your backpack had started taking its toll. \nYou insisted in wanting to carry it yourself. You wonder if it actually makes sense,\nbut something prevents you from parting with it. \nYou feel like it's $cyour sword$C. \n\nThe fact that you just took it from the Chief means nothing to you. \nEven if it did not belong to you until today,\neven if you have never seen any sword up close in the first place.",
      "actions": [
        {
          "verbs": [
            "look",
            "examine",
            "observe",
            "watch"
          ],
          "answer": "The reddish landscape stretches wide all around you. You think it looks like Arizona, or Nevada, back on earth. \n\nBack on earth.# Ridiculous. \n\nThe sun hits hard on you; now you thankfully understand why the hat. \n\nHow exactly far this Ayonn city is?# How long will it take to get there?\nYou start to worry: you have only a limited supply of food with you. \nHow will you survive the desert?",
          "objects": [
            {
              "objs": [
                "sword",
                "blade",
                "weapon"
              ],
              "childid": 3
            }
          ]
        },
        {
          "verbs": [
            "ask"
          ],
          "objects": [
            {
              "objs": [
                "food"
              ],
              "answer": "$B\"We have enough for 3 days. Then, we will hunt.\"#$y So naturally. \n\nYou wonder what kind of prey he has in mind. All you saw so far were just few lizards. \n\nWell, you already decided you will need to trust these guys, so no use in worrying at this point."
            },
            {
              "objs": [
                "water"
              ],
              "answer": "$Y\"We have two days worth of water. We need to find some more along the way.\"\n\n$yYou try not to look worried. \n\n$Y\"Don't you worry about that. It's not our first time in the desert!\"#$y He smiles at you reassuringly."
            },
            {
              "objs": [
                "travel",
                "journey",
                "distance"
              ],
              "answer": "$R\"The location of the city of Ayonn is not a mystery. \nAt least, the approximate location, since it's a legendary place we're talking about\"$y# she smirks. \n\n$R\"So... the so-called plain of Ayonn it's ten days of walking west from here. \nAt the end of this desert, we'll have to cross the Mazerock. Then... We'll see.\"\n\n$ySmiurl squeals."
            },
            {
              "objs": [
                "mazerock"
              ],
              "answer": "$Y\"Just another example of Ayonn's defenses!# A tricky place from which no one has ever returned!\nIf the place itself doesn't kill you, an Oxengutter or some other fiend will surely fix it!\"#$y You gulp. \n\n$R\"Stop it Smiurl... we can deal with any kind of natural maze,\nand surely we can deal with some Oxengutter of any sort.\"#$y You marvel at her confidence. \n\nTheo, as per usual, doesn't even seem interested in what they're saying."
            },
            {
              "objs": [
                "oxengutter"
              ],
              "answer": "$B\"Don't pay attention to everything Smiurl says... And trust me, you don't even want to know that.\"\n$yHis words do not reassure you, that's for sure."
            }
          ]
        },
        {
          "verbs": [
            "rest"
          ],
          "effect": {
            "gainitem": "desertrest"
          },
          "answer": "You all sit with your shoulder against a boulder, sheltered from the high sun. \nYou eat some of the food prepared before by Smiurl, and drink some of the water. \n\nYou really needed this. The others do not look tired at all, compared to you."
        },
        {
          "verbs": [
            "walk",
            "leave"
          ],
          "answer": "$R\"Better keep going. It's still a long way.\"$y",
          "childid": 5,
          "condition": {
            "item": "desertrest",
            "refusal": "You need to rest for a while."
          }
        }
      ]
    },
    {
      "id": 3,
      "recap": "in sword",
      "type": "Story",
      "text": "The sword is very long and heavy. It is perfectly balanced. \nThe long grip seems made of some metal, darkened through time. But it's surprising, to the touch. \nIt feels like it adapts perfectly to your hands, as if it is... alive. It is not cold nor rigid. \nIt is extremely hard though, and it resists all of your attempts at scratching it. \n\nYou shrug your shoulders, and you move on to inspect the blade. \n\nThe blade is double-edged, and this looks weird to you because it is also slightly curved. \nIt's four fingers wide at the intersection with the guard,\nthen it spreads outward with an arc on each side reaching about a handbreadth. \nThe width decreases towards the point. And the point looks strange: it is oddly asymmetrical,\nas if the blacksmith wanted to make it look as a broken, splintered blade, that was later re-sharpened as a razor. \n\nYou think it's impossible to fight with a weapon like that. \nNonetheless, when you wield it you feel as your arm is one thing with the sword,\nand it does not looks like you and the sword move in a clumsy or unbalanced way at all. \n\nThe metal of the blade itself looks strange. It reflects the light unevenly,\nand you don't know why but you think it's like its molecular structure is constantly shifting. \nSometimes you can see your own image reflected on the blade as a mirror;\nyet a second after the reflection seems to swim or evaporate in different directions,\nas if it is subject to a sudden and impossible turbulence. \nIf you keep on staring at it, the blade looks like it's subtly moving back and forth,\nlike a living thing, even if it's cold and solid to the touch. \n\nAs if all of that isn't enough, you also feel like you can glimpse an inscription flowing along its entire length. \nBut it's more a feeling than an actual visual input. You can't explain it to yourself.",
      "childid": 4
    },
    {
      "id": 4,
      "recap": "out sword",
      "type": "Dialogue",
      "dialogues": [
        {
          "precomment": "You sigh, ceasing your examination. It doesn't seem there is much else you can discover now. \nYou look up, and see your friends staring at you. You did not notice they fell silent earlier.",
          "actor": "Kriss",
          "line": "What is it?"
        },
        {
          "actor": "Corolla",
          "line": "You spent a lot of time lost in contemplation..."
        },
        {
          "actor": "Smiurl",
          "line": "You looked like you were in a trance.",
          "comment": "Smiurl intervenes."
        },
        {
          "actor": "Corolla",
          "line": "...you actually looked like you were somewhere else, totally alienated. \nAre you sure you are well?",
          "comment": "She continues."
        },
        {
          "actor": "Kriss",
          "line": "Sure, never been better...",
          "comment": "You are not entirely sure about that, still, you don't feel unwell either."
        },
        {
          "actor": "Corolla",
          "line": "Good thing...",
          "comment": "She sighs.",
          "childid": 2
        }
      ]
    },
    {
      "id": 5,
      "recap": "see something",
      "type": "Dialogue",
      "text": "After another couple of hours spent walking, the flat scene in front of you shows the first change. \nA kind of spire of rock, solitary, direction south-west. \nIt appears fading in: you now become aware of the atmospheric haze that limits visibility to maybe 20 kilometers. \n\n",
      "dialogues": [
        {
          "actor": "Kriss",
          "line": "What is that?",
          "comment": "You ask."
        },
        {
          "actor": "Smiurl",
          "line": "A rock like many others. There's nothing else in this desert but sun and rocks.",
          "comment": "Smiurl shrugs."
        },
        {
          "precomment": "You go back peering at the distant shape. You can't stop staring at it. \nOnce again, you perceive something weird, something you can't explain. \n\nYou keep on walking, eyes on the top of the pinnacle. \nIt's a vague feeling, you wonder if it isn't just your sight deceiving you:\nthe rock looks like it's moving, or like it's glowing slightly. \nYou hear or think to hear faint sounds, like many barely perceptible whispers.#",
          "actor": "Smiurl",
          "line": "Hey!",
          "comment": "He suddenly exclaims, breaking that 'spell'."
        },
        {
          "actor": "Kriss",
          "line": "Huh...? What?",
          "comment": "You snap out of your mind focus."
        },
        {
          "actor": "Smiurl",
          "line": "It's like ten minutes now, you've been walking like a ghost, staring into nothing..."
        },
        {
          "actor": "Kriss",
          "line": "Ten minutes...?",
          "comment": "They felt like few seconds to you.",
          "break": true
        },
        {
          "actor": "Corolla",
          "line": "Is something wrong?",
          "comment": "Corolla asks you."
        },
        {
          "actor": "Kriss",
          "line": "Erm... No... I mean, maybe... I can't explain it. I don't even know if it's not just my imagination."
        },
        {
          "precomment": "Everybody falls silent for a while. You keep on watching each other, in turns. \nAfter a while, you feel that kind of impulse, and say abruptly and resolutely:",
          "actor": "Kriss",
          "line": "I want to see this through. Let's go to the spire!"
        },
        {
          "precomment": "Corolla questions Theo with her eyes. He says:",
          "actor": "Theo",
          "line": "Are you sure of this?# We don't have much food and water. A detour like this could cost us a lot. \nIs it really necessary?"
        },
        {
          "precomment": "You stare into those imperturbable sky blue eyes.",
          "actor": "Kriss",
          "line": "I believe it is. But, you don't have to come with me...",
          "comment": "You start saying,\nstill feeling there's no reason why they should baby-sit you."
        },
        {
          "actor": "Corolla",
          "line": "Nonsense!# We won't leave you alone..."
        },
        {
          "actor": "Theo",
          "line": "Then it's settled.",
          "childid": 6
        }
      ]
    },
    {
      "id": 6,
      "type": "Choice",
      "recap": "climb?",
      "text": "You reach the rock wall at sunset. The feeling hasn't left you. On the contrary, it intensified. \n\nThe spire has revealed itself to be bigger than you expected. It's more like a peak, a small, sharp mountain. \nIt also looks higher, now that you are standing at its foot. \n\nA natural tower in the middle of the desert. \n\n$R\"Don't you think we'd better camp here for tonight?\"$C Corolla asks,\nseeing how yearningly you're looking at the vertical rock wall. \n\n$Y\"I'm tired... we walked all day.\"$C Smiurl adds, complaining. \n\nYou are not sure about what to do. Your sensation it's so strong now, you can't think of anything else.",
      "choices": [
        {
          "desc": "You don't know why or how, you just know you have to climb that mountain right now.",
          "childid": 7
        },
        {
          "desc": "Corolla is right. Night is about to fall, and you are all tired.",
          "childid": 8
        }
      ]
    },
    {
      "id": 8,
      "type": "Story",
      "recap": "prepare for the night",
      "text": "You agree with Corolla, slowly turning away from the wall in front of you. \nSmiurl starts to unpack in order to light a fire and eat. \n\n$B\"We'll take turns guarding tonight.\"$C Theo states. \n\nYou eat sitting around the fire. \nNobody talks much, and soon comes the time to sleep. \n\nYou fight to ignore the whispers you are still convinced to be hearing,\nand finally fall in a restless sleep.",
      "childid": 9
    },
    {
      "id": 9,
      "type": "Story",
      "recap": "gameover under the rock",
      "text": "A $Wshout$C awakes you abruptly. \nYou sit up, trying to understand what's happening. Under the starlight, you can only partially guess. \nWhat shocks you is the noise. \n\nA... Growl?# Howl?# Snarl?#\n\nIt's interrupted only by loud thuds followed by Theo's grunts. \n\nYou hear Corolla and Smiurl shouting at each other and at you. \n\nAdrenaline rushes through you; you frantically shoot out of your bedroll trying to reach your sword. \n\nSomething hits you, you're on the ground now, on your back. \nSomething is keeping you pinned. \nThe only thing you can see are two malevolent eyes, glinting menacingly in the darkness. \n\nThe last thing you see,# the fangs of the beast upon you, shining under the faint light of the night.$d##\n\n\n-- GAME OVER --#\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, traveler.",
      "childid": 6
    },
    {
      "id": 7,
      "type": "Story",
      "recap": "start climbing",
      "text": "$c\"I can't wait the whole night under here... I couldn't sleep anyway. \nMy... 'sensation' now is so strong, it wouldn't let me rest. I have to go, now. \nYou can wait for me here...\"$C\nYou don't even wait for their answer: you turn your back and start walking towards the crag. \n\nYou don't understand what compels you like that, you just know you can't help it now. \n\n$R\"Hey!# What are you thinking?\"$C Corolla shouts from behind after a while. \nYou see you upset her. You feel guilty, but comforted too seeing that the three of them are still following you. \nHer, in the front. Smiurl, obediently following her. Theo, impassible, on the rear. \n\nThey reach you. Her look is hard, as she stares you in the eyes. But soon she softens. \nShe rolls her eyes and snorts: $R\"Oh, don't ask me why, I can't be mad at you. Let's climb this thing.\"\n\n$CYou can't help feeling relieved.",
      "childid": 512
    },
    {
      "id": 99,
      "type": "Story",
      "recap": "falling",
      "text": "Your hand slips, losing grip. \nThe stone under your foot crumbles. \n\nYou hear Corolla screaming as you fall off the precipice.$d##\n\n\n-- GAME OVER --#\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, climber traveler.",
      "childid": 7
    },
    {
      "id": 512,
      "type": "Choice",
      "text": "The sun keeps on going down, and light decreases. You keep on climbing. \nIn the back of your mind, you ask yourself how will you be able to continue after sunset. \n\nIt looks like you won't be able to rest, not without plunging into the void.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 520
        },
        {
          "desc": "Move to the right.",
          "childid": 513
        },
        {
          "desc": "Move to the left.",
          "childid": 511
        }
      ]
    },
    {
      "id": 511,
      "type": "Choice",
      "text": "You move safely to the next spot.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 512
        },
        {
          "desc": "Move to the left.",
          "childid": 510
        }
      ]
    },
    {
      "id": 510,
      "type": "Choice",
      "text": "You reach the next foothold.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 530
        },
        {
          "desc": "Move to the right.",
          "childid": 511
        }
      ]
    },
    {
      "id": 513,
      "type": "Choice",
      "text": "It looks like a dead end. You can only go back to where you came from.",
      "choices": [
        {
          "desc": "Move to the left.",
          "childid": 512
        }
      ]
    },
    {
      "id": 520,
      "type": "Choice",
      "text": "You manage to get there. Now you can either:",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 532
        },
        {
          "desc": "Move to the right.",
          "childid": 521
        },
        {
          "desc": "Descend a little.",
          "childid": 512
        }
      ]
    },
    {
      "id": 521,
      "type": "Choice",
      "text": "You slide here. What now?",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 543
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 520
        }
      ]
    },
    {
      "id": 530,
      "type": "Choice",
      "text": "The way is partially obstructed here.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 531
        },
        {
          "desc": "Descend a little.",
          "childid": 510
        }
      ]
    },
    {
      "id": 531,
      "type": "Choice",
      "text": "Where to go now?",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 541
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 530
        }
      ]
    },
    {
      "id": 532,
      "type": "Choice",
      "text": "Two find yourself in a fissure, masses of rock to your right and left.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 542
        },
        {
          "desc": "Descend a little.",
          "childid": 520
        }
      ]
    },
    {
      "id": 540,
      "type": "Choice",
      "text": "You reach the next spot.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 550
        },
        {
          "desc": "Move to the right.",
          "childid": 541
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        }
      ]
    },
    {
      "id": 541,
      "type": "Choice",
      "text": "You stop again. A massive boulder is hanging over your head.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 542
        },
        {
          "desc": "Move to the left.",
          "childid": 540
        },
        {
          "desc": "Descend a little.",
          "childid": 531
        }
      ]
    },
    {
      "id": 542,
      "type": "Choice",
      "text": "You reach a new foothold. What now?",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 99
        },
        {
          "desc": "Move to the right.",
          "childid": 543
        },
        {
          "desc": "Move to the left.",
          "childid": 541
        },
        {
          "desc": "Descend a little.",
          "childid": 532
        }
      ]
    },
    {
      "id": 543,
      "type": "Choice",
      "text": "After a while, choose again.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 552
        },
        {
          "desc": "Move to the right.",
          "childid": 544
        },
        {
          "desc": "Move to the left.",
          "childid": 542
        },
        {
          "desc": "Descend a little.",
          "childid": 521
        }
      ]
    },
    {
      "id": 544,
      "type": "Choice",
      "text": "You can only move horizontally here, smooth rock over and beneath you.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 543
        }
      ]
    },
    {
      "id": 550,
      "type": "Choice",
      "text": "Your reach a higher point. Where to move now?",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 99
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 540
        }
      ]
    },
    {
      "id": 551,
      "type": "Choice",
      "text": "You reach the next spot. Now choose again.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 562
        },
        {
          "desc": "Move to the right.",
          "childid": 552
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        }
      ]
    },
    {
      "id": 552,
      "type": "Choice",
      "text": "You stop again. A huge smooth rock prevents you from going higher.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 553
        },
        {
          "desc": "Move to the left.",
          "childid": 551
        },
        {
          "desc": "Descend a little.",
          "childid": 543
        }
      ]
    },
    {
      "id": 553,
      "type": "Choice",
      "text": "After a while, choose again.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 564
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 552
        }
      ]
    },
    {
      "id": 560,
      "type": "Choice",
      "text": "You move sideways and reach a foothold. Which direction now?",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 561
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        }
      ]
    },
    {
      "id": 561,
      "type": "Choice",
      "text": "There is a solid stone ledge here. You look around for your next move.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 571
        },
        {
          "desc": "Move to the right.",
          "childid": 562
        },
        {
          "desc": "Move to the left.",
          "childid": 560
        }
      ]
    },
    {
      "id": 562,
      "type": "Choice",
      "text": "You thankfully rest on a kind of natural balcony. \n You have still some way to go,\nbut at least you all can catch your breath, while you look at the scenario lying at your feet. \n\nNight has fallen on the desert plains. You look at the moonlight shimmering over the rocky surface. \nNo sign of artificial lights anywhere. \n\nYou better keep moving.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 572
        },
        {
          "desc": "Move to the right.",
          "childid": 563
        },
        {
          "desc": "Move to the left.",
          "childid": 561
        },
        {
          "desc": "Descend a little.",
          "childid": 551
        }
      ]
    },
    {
      "id": 563,
      "type": "Choice",
      "text": "You have only two options here.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 573
        },
        {
          "desc": "Move to the left.",
          "childid": 562
        }
      ]
    },
    {
      "id": 564,
      "type": "Choice",
      "text": "This is a dead end. You need to go back.",
      "choices": [
        {
          "desc": "Descend a little.",
          "childid": 553
        }
      ]
    },
    {
      "id": 570,
      "type": "Choice",
      "text": "You have only two options here.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 99
        },
        {
          "desc": "Move to the right.",
          "childid": 571
        }
      ]
    },
    {
      "id": 571,
      "type": "Choice",
      "text": "You stop again. Choose the next direction.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 581
        },
        {
          "desc": "Move to the right.",
          "childid": 572
        },
        {
          "desc": "Move to the left.",
          "childid": 570
        },
        {
          "desc": "Descend a little.",
          "childid": 561
        }
      ]
    },
    {
      "id": 572,
      "type": "Choice",
      "text": "Movement is blocked on the right side. Choose where to go now.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 582
        },
        {
          "desc": "Move to the left.",
          "childid": 571
        },
        {
          "desc": "Descend a little.",
          "childid": 562
        }
      ]
    },
    {
      "id": 573,
      "type": "Choice",
      "text": "You stop again. Choose where to go now.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 99
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 563
        }
      ]
    },
    {
      "id": 580,
      "type": "Choice",
      "text": "You have only two options here.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 590
        },
        {
          "desc": "Move to the right.",
          "childid": 581
        }
      ]
    },
    {
      "id": 581,
      "type": "Choice",
      "text": "You stop again. Choose where to go now.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 591
        },
        {
          "desc": "Move to the right.",
          "childid": 582
        },
        {
          "desc": "Move to the left.",
          "childid": 580
        },
        {
          "desc": "Descend a little.",
          "childid": 571
        }
      ]
    },
    {
      "id": 582,
      "type": "Choice",
      "text": "You stop again here. Choose where to go next.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 99
        },
        {
          "desc": "Move to the right.",
          "childid": 583
        },
        {
          "desc": "Move to the left.",
          "childid": 581
        },
        {
          "desc": "Descend a little.",
          "childid": 572
        }
      ]
    },
    {
      "id": 583,
      "type": "Choice",
      "text": "You rest briefly on the next foothold.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 592
        },
        {
          "desc": "Move to the left.",
          "childid": 582
        },
        {
          "desc": "Descend a little.",
          "childid": 99
        }
      ]
    },
    {
      "id": 590,
      "type": "Choice",
      "text": "You rest briefly on this foothold.",
      "choices": [
        {
          "desc": "Move to the right.",
          "childid": 591
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 580
        }
      ]
    },
    {
      "id": 591,
      "type": "Choice",
      "text": "You stop again. Choose where to go now.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 5100
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 590
        },
        {
          "desc": "Descend a little.",
          "childid": 581
        }
      ]
    },
    {
      "id": 592,
      "type": "Choice",
      "text": "You stop again here. Choose where to go next.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 5101
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 583
        }
      ]
    },
    {
      "id": 5100,
      "type": "Choice",
      "text": "You rest briefly on this foothold.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 10
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 591
        }
      ]
    },
    {
      "id": 5101,
      "type": "Choice",
      "text": "You stop again. Choose where to go now.",
      "choices": [
        {
          "desc": "Climb a little higher.",
          "childid": 10
        },
        {
          "desc": "Move to the right.",
          "childid": 99
        },
        {
          "desc": "Move to the left.",
          "childid": 99
        },
        {
          "desc": "Descend a little.",
          "childid": 592
        }
      ]
    },
    {
      "id": 10,
      "type": "Dialogue",
      "recap": "arrival",
      "text": "The rock wall ends abruptly, like a neat, manmade step. You fumble with your arm searching for grip,\nthen you manage to hoist yourself up the stone floor. \n\nYou all pant and gasp because of the effort (and the fear) after this night climbing. It was a crazy idea indeed. \n\nYou are still laying on the ground with your face down, when you start laughing. \n\nAt first, very quietly, just chuckling. Then, louder and louder, in a crescendo,\nto the point you bend over with tears in your eyes.# It must be a nervous reaction. \n\nThen you stop, and a very weird echo starts mocking you. \nIt goes on for about 30 seconds. \nHearing those eerie sounds coming from the rocks around you, Smiurl starts wailing, in fear. \n\n",
      "dialogues": [
        {
          "actor": "Smiurl",
          "line": "This place is haunted...! Alas! We are going to die for sure!"
        },
        {
          "actor": "Corolla",
          "line": "Knock it off Smiurl!",
          "comment": "But he does not seem to listen.",
          "break": true
        },
        {
          "precomment": "After few seconds, while Smiurl is still whimpering, odds, faint glares start dancing around you. \nThey clothe that crevice's walls with grotesque figures and dreadful masks of living stone.",
          "actor": "Kriss",
          "line": "What's this sound?",
          "comment": "You ask as you start to hear a rattling, repetitive noise."
        },
        {
          "actor": "Corolla",
          "line": "That's Smiurl's teeth...",
          "comment": "She says with disapproval. Is she actually so calm as she seems?"
        },
        {
          "actor": "Kriss",
          "line": "Smiurl, I am surprised at you..! I thought of you as a valiant warrior!\nYou can engage a beast like Jeorghe, yet you tremble in front of... this?",
          "comment": "\nYou point somewhere around you. You try to calm him down, worried that his terror might spread to you and the others."
        },
        {
          "actor": "Smiurl",
          "precomment": "He answers, trying not to bite his own tongue:",
          "line": "One thing is fighting with men or animals, quite another is to face a phantom!\nAnd this place looks like it's crawling with them!",
          "comment": "He's even more scared now. \nHe spoke in an increasingly shrieking voice, pointing at the lights increasing in intensity around you."
        },
        {
          "actor": "Kriss",
          "precomment": "You look around anxiously, when you finally notice Theo:\nhe's stoic as always, as he was peacefully sitting in his tent.",
          "line": "What do we do?",
          "comment": "You ask him, nervously."
        },
        {
          "actor": "Theo",
          "precomment": "He points somewhere in front of him, on the left side, and says:",
          "line": "Be patient. If I'm right, we should meet Smiurl's phantom in seconds...",
          "childid": 11
        }
      ]
    },
    {
      "id": 11,
      "type": "Story",
      "recap": "Math welcomes",
      "text": "You turn around, trying to distinguish something in that unrelenting dance of lights and shadows. \nIt keeps on increasing in intensity: you can now see clearly the stone balcony you are resting on,\nbordered by the void of the precipice, beyond a thin line of darkness. \n\nTheo's prediction proves to be right: the light does come from that direction. \n\nAnd after few seconds, suddenly, from behind a rock,\na man appears, torch in his hand, startling all of you, excepted Theo of course. \n\nHe's wearing a long white robe. His skin looks dark, his hair is short, curly and black. \n\nHe starts speaking, saying:\n\n$m\"Hello Smiurl, Kriss, Corolla# and Theo, and welcome. \nYou were waited here at Seer's Rock. \nPlease, if you would like to follow me through the passage... \nMy name is Math.\"##$C He concludes with a half bow. \n\nYou all stay there, diversely petrified. \n\nAfter many seconds of the newcomer Math silent, smiling waiting, all you say is:#\n\n$c\"Hi...\"##",
      "islast": true
    }
  ]
}