{
  "lastchapter": {
    "number": "0",
    "iscomplete": false
  },
  "inventory": [

  ],
  "chapters": [

    [
      {
        "id": "test",
        "type": "story",
        "text": "play a @sound",
        "childid": "test"
      },
      {
        "id": "0_01",
        "type": "Story",
        "isvisited": false,
        "recap": "start of chapter one",
        "text": "-------------------------------\n|          CHAPTER 1          |\n-------------------------------\n\n\n###You are walking home after a long day.\n#There's no doubt, this hasn't been a nice day.\n#You missed every possible bus and/or train.\n#And it started raining,# too. #Of course, you do not have an umbrella with you.\n\n#Looking up at the sky, it looks like all the clouds in the world just decided to gather right above your head,#\nswallowing all of light and propagating dark vibes to the atmosphere and to the ground.",
        "childid": "0_02"

      },
      {
        "id": "0_02",
        "type": "Choice",
        "isvisited": false,
        "recap": "rain intensify",
        "text": "A $WLightning$C suddenly strikes, #not too far away!\n\n##You shudder, stunned with its power.\n\n##After few breathless seconds, #you breathe again \nand smell the ozone that was formed by the action of the electricity over the oxygen molecules.\n\n##You realise you have to move fast if you don't want to end up way more soaked than you already are.\n\n\n\n$D[Select with arrow keys and press enter]$C.",
        "choices": [
          {
            "desc": "You start running. Let's minimise the water intake.",
            "childid": "0_03"
          },
          {
            "desc": "The water does not bother you that much. You are already soaked. So why rush?",
            "childid": "0_04"
          }
        ]
      },
      {
        "id": "0_03",
        "type": "Story",
        "isvisited": false,
        "recap": "running home",
        "text": "Speeding through the water, you feel the drops of rain smashing onto your face and body with unexpected strenght.\n#You run even faster, trying to ignore the suffocating feeling of the water splashing down your face.\n#\nThe wind howls between the unstopping, ever increasing noise of water hammering the asphalt.\n#You feel your heart bouncing in your chest and hear your now accelerated breathing.\n#\nYou are almost home, when you hear it.\n#\n$G<<...>>$C\n###\nWas it real? \n##For a split second you thought someone called on your name. It must have been all that noise...\n#\n#$G<<..ris..>>$C\n###\nIt was clearer this time!\n\n\n",
        "childid": "0_05"
      },
      {
        "id": "0_04",
        "type": "Choice",
        "isvisited": false,
        "recap": "walking home",
        "text": "Resigned to your fate, you try to keep your head down,\ntrying to avoid being temporarily blinded by the water in your eyes.\n#\nThe wind howls between the unstopping, ever increasing noise of water hammering the asphalt.\n#\nYou also try to avoid the huge pools of water that are now forming on the road,\npraying that no vehicle will rush over them splattering you with some nice mud.\n#\nYou reach the bottom of the little hill that is in front of your house.\n#You raise your eyes, and right when you are about to turn towards your gate, you see something.\n#\nOn the top of the hill, there is something...# someone...# you can't say for sure.",
        "choices": [
          {
            "desc": "You think you saw it wrong. Why waste time climbing the hill with this weather?",
            "childid": "0_08"
          },
          {
            "desc": "You decide to go and check. Someone could need help.",
            "childid": "0_07"
          }
        ]
      },
      {
        "id": "0_05",
        "type": "Choice",
        "isvisited": false,
        "recap": "who whispered",
        "text": "You turn around, looking for the source of the voice.\n#\nIt's hard to see something in the midst of this unexpected thunderstorm.\n#You squint your eyes, fighting against the trickles of water that run into them.\n#\nAfter few seconds, you think you're seeing something.# On the top of the hill in front of your house.\n#It looks like there is something... #someone...# there.\n##But then you realise it's quite unlikely you could have heard your name called from that distance,\nwith all that noise.",
        "choices": [
          {
            "desc": "You hate to stay more time under the rain... but... you never know?",
            "childid": "0_07"
          },
          {
            "desc": "You must have misheard. And if something's there, it's none of your business.",
            "childid": "0_08"
          }
        ]
      },
      {
        "id": "0_07",
        "type": "Story",
        "isvisited": false,
        "recap": "at the tree",
        "text": "You painstakingly reach the top of the hill, where a lonely big oak tree stands.\n#It looks like nobody is here after all.\n#\nYou are about to go back down, to the comfort of your home at last, when you hear it!\n#\n$G<<Chris!>>$C\n#\nYou heard it right, you can't be wrong. It feels like the wind is calling your name to the rain...\n#You feel a tingling sensation in the back of your neck,# somehow you $Wfeel$C someone's behind you.\n#\n#Then...## it all happens in an instant...##\n\nThe figure at the corner of your eye...\n###The realisation that standing beneath a tree during a storm is not the safest option...\n###The blinding light and the deafening boom suddenly engulfing you.\n###\n###Then...## only darkness.##",
        "childid": "1_01"
      },
      {
        "id": "0_08",
        "type": "Story",
        "isvisited": false,
        "recap": "by the gate",
        "text": "You are about to enter past your gate, to the comfort of your home at last, when you hear it!\n#\n$G<<Chris!>>$C\n#\nIt feels like the wind is calling your name to the rain...\n#It feels like the sound comes from behind your shoulders, but at the same time from afar.\n\n#You feel a tingling sensation in the back of your neck,# somehow you $Wfeel$C someone's behind you.\n#\n#Then...## it all happens in an instant...##\n\nThe figure at the corner of your eye...\n###The blinding light...\n###The deafening boom suddenly engulfing you.\n###\n###Then...## only darkness.",
        "childid": "1_01"
      }
    ],

    [
      {
        "id": "1_01",
        "type": "Story",
        "isvisited": false,
        "recap": "awoke",
        "text": "-------------------------------\n|          CHAPTER 2          |\n-------------------------------\n\n\n$G<<You are alive...>>$C##\n\nWhose is that voice?# Your own?# Have you actually heard it?#\n\nYou slowly open your eyes, as thoughts resume their flow in your mind, trying to re-establish contact with reality.\n#\nIt takes several seconds to clear up your sight. You feel quite wrecked.\n#Just breathing deeply is a pain. You painfully, slowly sit up, and look around.\n#\nYou don't recognise what you see. You try hard to remember, and it finally gets back to you.\nHow can you still be alive after being hit by...# the lightning?\n#By the way,# you are still soaked to the bone.\n",
        "childid": "1_02"
      },
      {
        "id": "1_02",
        "type": "Action",
        "isvisited": false,
        "recap": "look around",
        "text": "$c\"Maybe I am dead,# afer all.\"#$C you say aloud, reconsidering the plausibility of that scenario.\n#\nIn the meanwhile, you look at the small reddish vale that lies downhill.\n#There is smoke ascending from what it looks like several fires or arsons.\n#\nYou carefully stand up, getting dizzy until your sense of balance stabilises.\n#\n\n$D[When you see the prompt \"\\>\", type an action you want to perform. Press TAB if you need help.]$C",
        "actions": [
          {
            "verbs": [ { "term": "look" } ],
            "childid": "1_03"
          },
          {
            "verbs": [
              { "term": "walk" },
              { "term": "go" }
            ],
            "childid": "1_04"
          },
          {
            "verbs": [ { "term": "run" } ],
            "childid": "1_05"
          },
          {
            "verbs": [ { "term": "laugh" } ],
            "childid": "1_06"
          },
          {
            "verbs": [ { "term": "cry" } ],
            "childid": "1_07"
          },
          {
            "verbs": [
              { "term": "shout" },
              { "term": "scream" }
            ],
            "childid": "1_08"
          }
        ]
      },
      {
        "id": "1_03",
        "type": "Story",
        "isvisited": false,
        "recap": "lookresult",
        "text": "$CThe first thing you notice is the sky, streaked with a cloud that looks like a jetstream of a plane.\n#It has a strange, alien color.\n#\nThe sun is setting, shedding its last light painting with odd glares the celestial vault,\nwhich is already welcoming the faint sparkle of several stars.\n#\nA little downhill, you then notice an earth road going down towards the vale.\n#It points in the direction of the fires.\n#Looking more intently, you discern there must be some kind of village there.\n#\nIt looks like there's nowhere else to go, at the moment.",
        "childid": "1_09"
      },
      {
        "id": "1_04",
        "type": "Story",
        "isvisited": false,
        "recap": "go or walk",
        "text": "You find your way downhill, following the earth path.\n\nAs you descend, the path gets narrower, meandering between an increasing number of trees.\n#\nTime passes, and night falls. Light recedes and you find yourself relying on the faint light of the stars.\n\nAs darkness takes hold, $rominous reddish glares$C paint the corners of the scene.\n#You understand it's the light coming from the fires. You are getting closer.\n#\nThe trees thin out and you can see the village entry a little further in front of you.",
        "childid": "1_10"
      },
      {
        "id": "1_05",
        "type": "Story",
        "isvisited": false,
        "recap": "run",
        "text": "You won't waste time. You rush downhill flying over the earth road.\n\nAs you descend, the path gets narrower, meandering between an increasing number of trees.\n#\nThis does not slow you down, nor the fact that running through the vegetation leaves\nmany marks on your skin, especially your arms and face.# You don't even realise it at the moment.\n\nTime passes, and night falls. Light recedes and you find yourself relying on the faint light of the stars.\n\nAs darkness takes hold, $rominous reddish glares$C paint the corners of the scene.\n#You understand it's the light coming from the fires. You are getting closer.\n#\nThe trees thin out and you can see the village entry a little further in front of you.",
        "childid": "1_10"
      },
      {
        "id": "1_06",
        "type": "Story",
        "isvisited": false,
        "recap": "laugh",
        "text": "You can't explain the reason of it to yourself, but for some reason, you start chuckling.\n#Maybe it's the absurdity of the situation, or maybe it's a nervous reaction.\n#\nAnyway, you keep on laughing, louder and louder, until your voice becomes hysterical,\ndistorted, overlapped with its own echo.\n##\nAfter a while, you fell quite, the sound disperses around, and you feel some kind of sense of awkardness.",
        "childid": "1_09"
      },
      {
        "id": "1_07",
        "type": "Story",
        "isvisited": false,
        "recap": "cry",
        "text": "Your mind is rushing.\n#$c<<What is this place?>>\n#<<Am I dead?>>\n#<<Am I in some hell?>>\n#<<How do I get home?>>\n#<<Is there anybody here?>>\n#\n$CAfter few moments, you burst out crying.# You weren't expecting it, but you can't help it.\n#\nAfter few minutes of what you classify as a pathetic scene, you feel better for some reason.",
        "childid": "1_09"
      },
      {
        "id": "1_08",
        "type": "Story",
        "isvisited": false,
        "recap": "shout",
        "text": "This is clearly impossible.# You must be dreaming.# Or maybe it's just some kind of sick prank.\n#\nWhatever it is, it's unacceptable. You feel your rage rising, supercharged by your pain and fear.\nIt soon becomes too much to hold inside, so you let out a mighty shout.\n#\nYou scream at the space around you.\n#To whoever might be listening.\n#To your own fate.\n#\nYou feel liberated.",
        "childid": "1_09"
      },
      {
        "id": "1_09",
        "type": "Action",
        "isvisited": false,
        "recap": "still there",
        "text": "You stand on this hill, like the one that is in front of your house.\n#But the similarities end there. There are no places like this around your place,\nmaybe not even in your whole nation.\n#\nYou are still wondering what happened and how did you end up here.\nYou try to keep calm, thinking about what to do next.\n",
        "actions": [
          {
            "verbs": [ { "term": "look" } ],
            "childid": "1_03"
          },
          {
            "verbs": [
              { "term": "walk" },
              { "term": "go" }
            ],
            "childid": "1_04"
          },
          {
            "verbs": [ { "term": "run" } ],
            "childid": "1_05"
          },
          {
            "verbs": [ { "term": "laugh" } ],
            "childid": "1_06"
          },
          {
            "verbs": [ { "term": "cry" } ],
            "childid": "1_07"
          },
          {
            "verbs": [
              { "term": "shout" },
              { "term": "scream" }
            ],
            "childid": "1_08"
          }
        ]
      },
      {
        "id": "1_10",
        "type": "Story",
        "isvisited": false,
        "recap": "raidedvillage",
        "text": "A small town lies in front of you.\n#Or, to better say, what is left of it.\n#\nThere is one main earth road that divides two main groups of houses, and little else.\nMany buildings are in flames or already burnt to the ground.\nFew others are seemingly intact.\n#\nThere are no vehicles.\n#No living soul is to be found around.\n#\n\nYou keep on walking, and after few seconds you spot the first one.\n##\n$WA man.$C# Lying on his back, eyes wide open, staring into nothingness.\n#An arrow stuck deep in his chest.# $WClearly dead.$C# Few flies buzzing around his mouth already.\n##\nYou retch.",
        "childid": "1_11"
      },
      {
        "id": "1_11",
        "type": "Choice",
        "isvisited": false,
        "recap": "findshelter",
        "text": "$c<<Where the heck am I...?# What is going on?# What am I supposed to do?>>$C you ask yourself when you feel better.\n#\nYou keep on walking and realise the road is scattered with corpses.# Some kind of battle must have taken place...\n#\nYou keep on walking, slowly, appalled.# You lose track of time, while your mind tries to grasp the reality.\n#You cannot find an explanation to any of the things you are experiencing.\n\n\n##After a while, you find yourself leaning on an empty doorframe of a house, which was somehow spared by the fire.\n#\nYou shake up, shuddering. This reminds you that you should find some kind of shelter for the night,\n#get dry,# and possibly not burnt.",
        "choices": [
          {
            "desc": "You had enough for today. Nothing you may find inside the house could be worse than what is outside.",
            "childid": "1_12"
          },
          {
            "desc": "You just can't walk through that door, into the darkness...",
            "childid": "1_13"
          }
        ]
      },
      {
        "id": "1_12",
        "type": "Action",
        "isvisited": false,
        "recap": "enter house",
        "text": "Overcoming fear with need, you enter the silent,# dark,# house.# You don't expect to find anybody in there.\n#It's a very humble abode, earthen floor, small windows, few ornaments.\n#\nA fireplace signals the kitchen. A table, some chairs.# You suddenly realise how hungry you are.\n#The only other room is the bedroom, a simple bed, a closet.\n#All furniture pieces are made of the same wood.\n#It doesn't look like there is running water anywhere. You can't even find a toilet.\n#\n\n$D[Usually, an action (verb) has to match an object (for example: $ddrink $Dthe $dwater$D)]\n\n[You may press TAB again for help about the objects.]$C",
        "actions": [
          {
            "verbs": [
              { "term": "search" },
              { "term": "look" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "food" }
                ],
                "answer": "You find a loaf of bread, some unidentified fruit and some cheese.",
                "effect": {
                  "item": "food",
                  "value": true
                }
              },
              {
                "objs": [
                  { "term": "water" }
                ],
                "answer": "There is a covered jug full of water on the kitchen counter.",
                "effect": {
                  "item": "water",
                  "value": true
                }
              },
              {
                "objs": [
                  { "term": "clothes" }
                ],
                "answer": "You find a pair of trousers, and a woolen shirt. They feel rough and old.",
                "effect": {
                  "item": "clothes",
                  "value": true
                }
              },
              {
                "objs": [
                  { "term": "money" }
                ],
                "answer": "You can't find anything valuable."
              }
            ]
          },
          {
            "verbs": [
              { "term": "sleep" },
              { "term": "rest" },
              { "term": "lay" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "bed" }
                ],
                "condition": {
                  "item": "clothes",
                  "value": true,
                  "refusal": "I don't want to lay down with these dirty clothes on."
                },
                "childid": "1_14"
              }
            ]
          },
          {
            "verbs": [
              { "term": "remove" },
              { "term": "change" },
              { "term": "wear" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "clothes" }
                ],
                "answer": "You remove your soaked clothes wearing what you just found.",
                "condition": {
                  "item": "clothes",
                  "value": true,
                  "refusal": "I need to find something to wear first."
                }
              }
            ]
          },
          {
            "verbs": [
              { "term": "drink" }
            ],
            "condition": {
              "item": "water",
              "value": true,
              "refusal": "I need to find some water."
            },
            "answer": "You avidly drink the water, not caring about its taste."
          },
          {
            "verbs": [
              { "term": "eat" }
            ],
            "condition": {
              "item": "food",
              "value": true,
              "refusal": "I need to find something to eat."
            },
            "answer": "You devour what you just found."
          }
        ]
      },
      {
        "id": "1_13",
        "type": "Story",
        "isvisited": false,
        "recap": "still walking",
        "text": "Driven away by the thought of what you could find inside that dark place, you resume your grim exploration.\n#\nThe fires are almost out. Hostile embers spy on you from the corner of your eye.\n#Not a sound, you feel and hear your own blood pumping in your veins.\n##\nYou reach what looks like the center of that lost little town.\n#There is a stone landmark in the middle of the square.\nYou feel a rush of gratitude when you discover it's a fountain.\n#\nYou drink in a hurry, only now realising how thirsty you were.\n#The water has a funny taste, but you are too overwhelmed to notice orterra calpestata care.\n#You collapse on the ground, the most possible distant from any building,# fire,# or corpse.",
        "childid": "1_15"
      },
      {
        "id": "1_14",
        "type": "Story",
        "isvisited": false,
        "recap": "awake(house)",
        "text": "...##\n\n$G<<Wake up...>>$c##\n\n\"Who's calling...?\"$C you mutter sitting up on the bed, fighting to regain full consciousness.\n#You open your eyes, and you become freshly aware of the current situtation.\n#It feel like a boulder has been thrown down on you,# again.\n#\nYou don't know how long you've been asleep.# The sun must be high up already,\njudging from the light that filters through the thick, dirty window.\n#\nYou don't want to spend another minute in there, so you decide to hit the road.\n#\nOnce outside, you hesitate just a moment, spectating the wasted scenario.\n#Many other corpses you did not notice the night before, scavengers... You quickly turn your eyes away.\n#\nIt looks like the fires are completely extinguished now.\nThe acrid smell of smoke is still all around you.\n#You need to move. You start walking away, in the same direction as yesterday.",
        "childid": "1_16"
      },
      {
        "id": "1_15",
        "type": "Story",
        "isvisited": false,
        "recap": "awake(outside)",
        "text": "...##\n\n$G<<Wake up...>>$c##\n\n\"Who's calling...?\"$C you mutter, fighting to regain full consciousness.\n#You open your eyes, and you become freshly aware of the current situtation.\n#It feel like a boulder has been thrown down on you,# again.\n#\nYou don't know how long you've been asleep.# The sun is already high.\n#You slowly get back on your feet, aching after a night spent in an uncomfortable position.\nYou just hope you didn't get a cold or something worse having slept with your wet clothes out in the open.\n#Luckily, wherever you are, the season is warm.\n##\n$c<<Wherever I am...>>$C You shake your head and start moving.\n#You just resolutely decided you can't remain there for not even just a second.\nThere are many other corpses you did not notice the night before, scavengers... You quickly turn your eyes away.\n#\nIt looks like the fires are completely extinguished now.\nThe acrid smell of smoke is still all around you.\n#You quickly walk away, in the same direction as yesterday.",
        "childid": "1_16"
      },
      {
        "id": "1_16",
        "type": "Story",
        "isvisited": false,
        "recap": "exit village",
        "text": "You are just leaving the last houses of the village behind,\nwhen you notice something further away.#\n\nWhen you are close enough, you see they are freshly dug graves.# A dozen, maybe.\n#\nAll there's to see are just piles of earth. No tombstones. Only now nameless corpses.#\n\nYou look around, thinking about the fact that someone $Whad$C to be there to bury the bodies.\nObviously, they could not have dug those holes up and then taken turns in burying each other...$\n\nYou laugh at this thought.\n#But then a shiver runs down your spine, wondering if that was what had actually happened.\n\nYou manage to get yourself distracted by studying the ground.\nIt looks trodden and loose, as if there was a quite big number of people not so long ago.\nThere are two distinctive, neat marks. They look like...\nThey look like the mark two wheels of a chariot would leave behind..!#\n\nYou follow them with your eyes, disappearing in the distance in front of you,\nin an open, semi-desertic landscape.\n\nYou don't know where else to go, so you start following the trail.\nLuckily, even a child could do that.",
        "childid": "1_17"
      },
      {
        "id": "1_17",
        "type": "Choice",
        "isvisited": false,
        "recap": "reach camp",
        "text": "You walked all day long.# All you saw were little isolated trees, some bushes and some birds.\n#You feel exhausted. It's almost sunset, and you are about to despair.#\nBut then, you see it. A thin plume of smoke rising.\n#\n$c<<Please not another dead town>>$C you say in your mind,# while you start walking faster.##\n\nBy the time you get there, it's completely dark. In front of you, an encampment.\n#Your survival instinct tells you to lay down and crawl among the sparse low bushes and grass.\n\n#There are many tents around a huge bonfire. Some men are roasting massive chunks of meat on it.\n#The smell reaches you nostrils, and you almost faint: you had very little to eat in the last 48 hours.\n#Around the fire, many men are dancing to the rhythm of crude songs with obscure words.\n#Between a song and a piece of meat, they gulp down impressive mugs of what must be beer.\n\n#You look around: no movement at the sides of the encampent. And then you see them.##\n\nSlaves.# Women,# children.#\nThey are crammed inside several big cages on carriages,\nwhich tracks you now realise you've been following the whole day.# Then it dawns on you:\n\n#$c<<These thugs must be the responsibles of what I saw at that village!>>$C##\n\nYou think about the danger you put yourself in by following them,\nbut that feeling gets obscured by the disgust and rage.# You shouldn't, but you $Whave$C to do something.",
        "choices": [
          {
            "desc": "You feel you must do something... But it's too dangerous, you don't want to end up in one of those cages.",
            "childid": "1_29"
          },
          {
            "desc": "You know it's a foolish idea, but you can't just leave them to their fate. You must help them.",
            "childid": "1_18"
          }
        ]
      },
      {
        "id": "1_29",
        "type": "Story",
        "isvisited": false,
        "recap": "exit village",
        "text": "You sneak around, looking for anything you could use in order to survive another day, possibly more.#\nYou need to find supplies, and you want to understand who these people are exactly.#\nYou need to remain undetected.#\n\nLuckily, it looks like there are no guards around. Everybody must be celebrating... # the...# victory?##\nThinking about this, disgust and rage fill you again.#\nYou take a deep breath to calm down.#\n\nYou proceed on resuming your exploration\nwhen the entry of a tent right in front of you shakes as someone is getting out.#",
        "childid": "1_30"
      },
      {
        "id": "1_30",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "meet corolla",
        "text": "",
        "dialogues": [
          {
            "actor": "Corolla",
            "line": "And who would you be...?",
            "comment": "You freeze.#\nAfter few paralyzing istants, you manage to close your mouth, trying to dissimulate your fear.#\n\nThe voice belongs to a young woman; she is studying you intently, head tilted on one side.#\n\nShe is definitely attractive. She has black glinting eyes, long dark brown hair,\nglowing $Rred$C under the light of the torches around.#\nShe's wearing a wide shirt, quite open on her cleavage.#\nAs for the rest, she's squeezed in a pair of black, thick, stitched leather leggings.\n#Your eyes wonder maybe a little too long on the curve of her hips.#\n\nInteresting posture, self confident... with such a delicious narrow waist...#",
            "break": true
          },
          {
            "actor": "Corolla",
            "line": "Hey I asked you a question!",
            "comment": "With these words she snaps you out of your examining trance, smiling mischievously.#\nYou blush, while frantically trying to find something dignifying to say.#\nMeanwhile, you notice how strange her English is. You barely understand it. You don't recognise her accent.",
            "replies": [
              {
                "line": "\"Hey hey...! I don't believe you don't recognise me...! Haha come on let's go get drunk...\"",
                "nextline": "JeorgheStepsIn"
              },
              {
                "line": "\"Sorry ma'am, I didn't mean to be disrespectful. Could I explain? It's not as it seems...\"",
                "nextline": "JeorgheStepsIn"
              }
            ]
          },
          {
            "linename": "JeorgheStepsIn",
            "actor": "Jeorghe",
            "precomment": "The girl is about to answer, when a third rough, hoarse voice steps in.",
            "line": "What the heck is going on here?!",
            "comment": "A huge man appears. His malevolent scowl directed at her as at you."
          },
          {
            "actor": "Corolla",
            "line": "Jeorghe, you're always so dear...",
            "comment": "she answers back with sarcasm."
          },
          {
            "actor": "Jeorghe",
            "line": "You ugly b...!!"
          },
          {
            "actor": "Corolla",
            "line": "Ha! Watch your tongue...# or you may lose it!",
            "comment": "she interrupts him drawing a sharp knife from her belt in an instant.#\nStill, she is pointing it at his crotch, not at his tongue.#\n\nJeorghe growls, very openly suggesting he would try to kill her if he could.#\n\nThen his attention goes back to you."
          },
          {
            "actor": "Jeorghe",
            "line": "Who is this filth??# A prisoner?# No...# There were no men among them...# An intruder! A spy!",
            "comment": "He starts laughing wildly,\nsounding like an outboard motor who doesn't really want to start.#\nHe grabs a log almost big as your leg, in order to crack your head open.",
            "childid": "1_19"
          }
        ]
      },
      {
        "id": "1_18",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "meet corolla",
        "text": "",
        "dialogues": [
          {
            "actor": "Corolla",
            "line": "I wouldn't do it, if I were you.",
            "comment": "A voice behind you.# You freeze.#\nAfter few paralyzing istants, you slowly turn around, trying to dissimulate your fear.#\n\nThe voice belongs to a young woman; she is studying you intently,\nhead tilted on one side, leaning on one of the carriages.#\n\nShe is definitely attractive. She has black glinting eyes, long dark brown hair,\nglowing $Rred$C under the light of the torches around.#\nShe's wearing a wide shirt, quite open on her cleavage.#\nAs for the rest, she's squeezed in a pair of black, thick, stitched leather leggings.\n#Your eyes wonder maybe a little too long on the curve of her left hip protruding outwards,#\nsince she's leaning with her right elbow on one of the wheels.#\n\nInteresting posture, self confident... with such a delicious narrow waist...##"
          },
          {
            "actor": "Corolla",
            "line": "You know? The Chief could express severe disagreement... and heaven knows what he would do to you!\nNot to mention what Jeorghe would do to you too...#",
            "comment": "With these words she snaps you out of your examining trance, smiling mischievously.#\nYou blush, while frantically trying to find something dignifying to say.#\nMeanwhile, you notice how strange her English is. You barely understand it. You don't recognise her accent.",
            "replies": [
              {
                "line": "\"Wai... Wait a second! You won't tell him right? I, erm...!\"",
                "nextline": "JeorgheStepsIn"
              },
              {
                "line": "\"Rrright! Hey I was just looking... Wait, have we met before?\"",
                "nextline": "JeorgheStepsIn"
              }
            ]
          },
          {
            "linename": "JeorgheStepsIn",
            "actor": "Jeorghe",
            "precomment": "The girl is about to answer, when a third rough, hoarse voice steps in.",
            "line": "What the heck is going on here?!",
            "comment": "A huge man appears. His malevolent scowl directed at her as at you."
          },
          {
            "actor": "Corolla",
            "line": "Jeorghe, you're always so dear...",
            "comment": "she answers back with sarcasm."
          },
          {
            "actor": "Jeorghe",
            "line": "You ugly b...!!"
          },
          {
            "actor": "Corolla",
            "line": "Ha! Watch your tongue...# or you may lose it!",
            "comment": "she interrupts him drawing a sharp knife from her belt in an instant.#\nStill, she is pointing it at his crotch, not at his tongue.#\n\nJeorghe growls, very openly suggesting he would try to kill her if he could.#\n\nThen his attention goes back to you."
          },
          {
            "actor": "Jeorghe",
            "line": "Who is this filth??# A prisoner?# No...# There were no men among them...# An intruder! A spy!",
            "comment": "He starts laughing wildly,\nsounding like an outboard motor who doesn't really want to start.#\nHe grabs a log almost big as your leg, in order to crack your head open.",
            "childid": "1_19"
          }
        ]
      },
      {
        "id": "1_19",
        "type": "Choice",
        "isvisited": false,
        "recap": "jeorghe attack",
        "text": "$CJeorghe, a mass of muscles, rises his improvised weapon and lunges for you.#\n\nIn emergency mode, your brain instantly tells you that you need to act quickly.#\nAdrenaline starts pumping through your every vein.#\n\nWhere to go, in the middle of a desert?",
        "choices": [
          {
            "desc": "There's no way you can beat him. Run for your life...!",
            "childid": "1_20"
          },
          {
            "desc": "Fight that thug! Who does he think he is?",
            "childid": "1_21"
          }
        ]
      },
      {
        "id": "1_20",
        "type": "Story",
        "isvisited": false,
        "recap": "jeorghe attack",
        "text": "Panicking, you dart away, looking for any kind of cover.#\nThe brute chases you, smashing everything he ecounters on his path and/or swings.\nYou slide under the carriages,# then run between the nearest tents...##\n\nIt's all useless. He is always one step behind you.#\nFor one split second you get distracted by the noises he makes, and you turn your head a little to watch him.#\nIt soon proves to be a mistake.##\n\nLooking over your shoulder like that, you cannot see another man suddenly appearing in front of you.#\nHe doesn't even try to stop you.# He just stands there with arms crossed letting you stumble and fall to his feet,\nlike a prey trapped for its hunter.##\nYou realise you are surrounded.# There's no way out.#\n\nDuring a few instants, you can observe every detail of his face.#\n\nHis devious grin, anticipating with perverse joy what he's about to do.#\nHis stench, engulfing you as he rushes towards you.#\nTime seems to dilate allowing you to count every hateful, alcoholic capillary of his evil eyes.##\n\nYou raise your arm, as it could protect you from what it's surely going to happen.##\n\n\n",
        "childid": "1_22"
      },
      {
        "id": "1_21",
        "type": "Story",
        "isvisited": false,
        "recap": "game over",
        "text": "You raise your fists ready to engage your aggressor.#\n\nDuring a few instants, you can observe every detail of his face.#\n\nHis devious grin, anticipating with perverse joy what he's about to do.#\nHis stench, engulfing you as he rushes towards you.#\nTime seems to dilate allowing you to count every hateful, alcoholic capillary of his evil eyes.##\n\n\nThen, it's all over in an instant.#\nYou don't even have the time to think about the absurdity of the very thought of challenging such a brute.#\nThe strike, so strong, you don't even feel it.##\n\n\n$dYou should have run.##\n\n\n-- GAME OVER --##\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, traveler.",
        "childid": "1_01"
      },
      {
        "id": "1_22",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "smiurl rescues",
        "dialogues": [
          {
            "precomment": "Suddenly, a hissing sound wounds the air!#\nA flying string appears out of nothing, winding tightly around Jeorghe's chest,#\nwith stones at its ends which hit him hard when they terminate their spiraling rotation.#\n\nLosing balance, the man falls down on one knee, and lets go of the log.#\n\nThen some kind of $Yshriek$C is heard, and something you can't identify hits the man again, knocking him down,\nleaving him growling and wriggling furiously on the ground.##",
            "actor": "Corolla",
            "line": "Make way, you morons...",
            "comment": "you hear the girl from before say as she approached,\nbreaking into the circle of spectators that has formed.#\n\nThen, everybody backs off, as someone new is arriving.#\nYou can't see who it is at first, you can only hear an odd jingling sound getting nearer.#",
            "childid": "1_23"
          }
        ]
      },
      {
        "id": "1_23",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "chief dialogue",
        "dialogues": [
          {
            "precomment": "$CThen,# he steps into the circle.#\n\nYou immediately recognise the Chief:#\nproud posture,# well-kept hair and beard,# intelligent, disdainful expression,# at times malign,# at times ironic.#\nHe's tall, more slender than all the other men around.#\n\nHe wears several jewelry around his neck,#\nand he carries a $cbig sword$C in its sheath and a chain (the source of the jingling) both hanging from his belt.#\n\nHe stops a few steps from you, his hands on his hips, observing the scene with curiosity.#",
            "actor": "Chief",
            "line": "What have you guys been up to? Look at you poor little Jeorghe...!#\nI think I need to choose better guards for myself!",
            "comment": "he mocks his man, kicking him a little to tease him."
          },
          {
            "precomment": "Jeorghe grunts with unspeakeable wrath:",
            "actor": "Jeorghe",
            "line": "Release me! Now!!"
          },
          {
            "precomment": "The Chief nods at his men,\n#and Jeorghe gets untied and escorted, not withouth any difficulties, somewhere else.",
            "actor": "Chief",
            "line": "Who are you? And, please, stand up now...",
            "comment": "he asks now, gesturing carelessly, and turning abruptly towards you."
          },
          {
            "actor": "Kriss",
            "line": "My name is Chris...",
            "comment": "you answer, after hesitating, just for a moment.",
            "childid": "1_24"
          }
        ]
      },
      {
        "id": "1_24",
        "type": "Choice",
        "isvisited": false,
        "recap": "chief question",
        "text": "$M\"How come you happen to be here?\"$C##\n\nYou are not prepared to answer this question.#\nYou had no chance so far to even think about it.",
        "choices": [
          {
            "desc": "Lie blatantly",
            "childid": "1_25"
          },
          {
            "desc": "Tell the truth",
            "childid": "1_26"
          }
        ]
      },
      {
        "id": "1_25",
        "type": "Story",
        "isvisited": false,
        "recap": "improvised story",
        "text": "$c\"I.. erm... am from a nearby village.# To the north.\"# $CYou point with your hand in some random direction.#\n\n$c\"And, you know...# I heard about you guys...# What you're doing...\"# $CYou try hard to dissimulate your nervousness,#\nand to look tough and convincing enough.#\n\n$c\"So i told myself I should leave that rat hole,# and go and reach for you and be of help...# To...# The cause...?\"#",
        "childid": "1_27"
      },
      {
        "id": "1_26",
        "type": "Story",
        "isvisited": false,
        "recap": "honest truth",
        "text": "$c\"To be honest sir...# well, I was on my way home yesterday when...#\nI was struck by lightnining...# Yeah, and then I woke up outside that village...\"\n$CYou point somewhere behind you.\n\n$c\"After that, not knowing where to go, I just followed your tracks.\"\n\n$CSomeone in your public had already started chuckling; now almost everybody bursts out.#\n\nYou stop talking, you don't know what to expect next.#\n\nThe girl is the only one staring seriously at you.",
        "childid": "1_27"
      },
      {
        "id": "1_27",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "Kriss gets his name",
        "dialogues": [
          {
            "actor": "Chief",
            "line": "Enough!",
            "comment": "Thunders the Chief. Immediately silence falls."
          },
          {
            "actor": "Chief",
            "line": "You have to agree with me, that's not a great story...\" $CHe adds giggling. #\n$M\"Who do you think might ever believe it?",
            "comment": "He draws close to you, examining you head to toes.#\nThen he goes back to staring you in the eyes."
          },
          {
            "actor": "Chief",
            "line": "You are no spy. You wouldn't have been so dumb and make all this noise.",
            "comment": "He concludes carelessly.#\nHe looks aside, thoughtful, right hand on his chin, left hand on his right elbow."
          },
          {
            "actor": "Chief",
            "line": "Mmmm... anyway... listen: I am in a good mood today.",
            "comment": "He snaps his fingers, and draws his face close to yours."
          },
          {
            "actor": "Chief",
            "line": "Here is my proposal: join us!",
            "comment": "Immediately a choir of protesting sounds arises.#\nMost of the men were hoping to enjoy an execution.#\nShe remains stoic.",
            "break": true
          },
          {
            "precomment": "You yourself are surprised.# After a while, not having other choices, you say:",
            "actor": "Kriss",
            "line": "I'm in for it!"
          },
          {
            "actor": "Chief",
            "precomment": "##The Chief smiles, then turns away quickly and while walking away adds:",
            "line": "Corolla: find a place for...\"$C he hesitates, as if your name sounds strange to him $M\"...Kriss.\"##\n\n\"In the end, two hands may steal more than a mouth can eat...#",
            "comment": "and he disappears, snickering.#\n\nShe takes you by the arm and leads you away,# under the hateful gazes of the others.",
            "childid": "2_01"
          }
        ]
      }
    ],
    [
      {
        "id": "2_01",
        "type": "Dialogue",
        "recap": "meet the others",
        "text": "-------------------------------\n|          CHAPTER 3          |\n-------------------------------\n\n\n",
        "isvisited": false,
        "dialogues": [
          {
            "actor": "Corolla",
            "precomment": "You walk with Corolla, quick-paced, going somewhere only she knows.#\nYou see her picking up the bolas that hit Jeorghe, hanging them to her hip...# so it was her saving you!#\nSomething else attracts your attention though, a movement, in the darkness.#\nUnintetionally, you wince. She notices that and says:",
            "line": "Don't worry. That is Smiurl..."
          },
          {
            "actor": "Kriss",
            "line": "Smiurl...?",
            "comment": "You don't understand what she's talking about.#\nIn the meantime, you unintentionally draw closer to her."
          },
          {
            "actor": "Corolla",
            "line": "Yep. It was him to knock Jeorghe down, after I tied him up."
          },
          {
            "precomment": "You remember you glimpsed something.# You just weren't thinking that it could be someone.",
            "actor": "Corolla",
            "line": "Smiurl, don't you think it's time to introduce yourself?",
            "comment": "She says after she stopped walking,\napparently talking to the shadows."
          },
          {
            "actor": "Smiurl",
            "line": "I really have to, haven't I?",
            "comment": "you hear a squeaky little voice, not distant.",
            "break": true
          },
          {
            "actor": "Smiurl",
            "line": "Well, I guess I have to...",
            "comment": "He then adds.#\n\nAs if by magic, a little man surfaces out of the shadows. He barely reaches Corolla's waist in height.#\nHe has a shy look in his eyes."
          },
          {
            "actor": "Smiurl",
            "precomment": "He stretches up his little wrinkly hand to you and says:",
            "line": "Hello Kriss, I am Smiurl.",
            "comment": "you reciprocate, a little unbelieving. He cannot be just a dwarf.#\nHe has huge ears, pierced with a plethora of earrings, which jingle faintly with each jolt of his head.#\nThe nose is also quite big, compared to the rest of the face.#\nHe's wearing a shirt and a pair of short discolored leather trousers.#\nHis face looks like it's made to constantly display a lost-puppy-like expression...#"
          },
          {
            "precomment": "Somehow Corolla must know what you are thinking.#",
            "actor": "Corolla",
            "line": "Don't let him deceive you... Smiurl is a true valiant when you need him.",
            "comment": "Hearing that compliment,#\nthe little guy lits up everywhere.##\n$YL$Gi$Wt$Ce$Br$Ma$cl$Yl$Wy.$C## He actually starts emanating a vague, multicoloured luminescence.#"
          },
          {
            "actor": "Kriss",
            "line": "Whoa!",
            "comment": "You exclaim, not believing your eyes."
          },
          {
            "actor": "Corolla",
            "line": "Easy, he's innocuous!",
            "comment": "She laughs heartily.# Her laughter rises up, clear and silvery."
          },
          {
            "actor": "Corolla",
            "line": "Smiurl is a mutant.",
            "comment": "She adds right after."
          },
          {
            "actor": "Kriss",
            "line": "Incredible...!",
            "comment": "You observe him, amazed. In the meantime, he has somehow 'turned off'.",
            "break": true
          },
          {
            "actor": "Smiurl",
            "line": "You aren't angry, are you?",
            "comment": "He asks with trembling voice."
          },
          {
            "actor": "Kriss",
            "line": "Angry?! Why would I be angry?"
          },
          {
            "actor": "Smiurl",
            "line": "Everybody hates me...# It's because...# I'm different.",
            "comment": "He complains, looking down."
          },
          {
            "precomment": "You feel compassion for that little man. You can only imagine how miserable his life must be,#\nliving surrounded by that kind of human filth.# They must make his life a hell every day.#\n\nYou say to him warmly:",
            "actor": "Kriss",
            "line": "I do not hate you! On the contrary: you guys saved my life... and I still haven't thanked you properly!"
          },
          {
            "actor": "Corolla",
            "line": "Our duty.",
            "comment": "She smiles openly.# The white of her teeth uncovers under the light of the stars.#\n\nSmiurl starts glowing again, puffing up all happy.",
            "break": true
          },
          {
            "precomment": "You keep walking with them for a while.# You start wondering how people like them can mingle with those thugs.#\nWhat are they doing here?#\n\nYou reach an area separated from the rest of the encampent by a group of dry trees.#\nYou see a few tents next to each other.",
            "actor": "Corolla",
            "line": "There, you can sleep in the tent with Theo.",
            "comment": "She points at the biggest of the group."
          },
          {
            "actor": "Kriss",
            "line": "Who is...",
            "comment": "You are about to say, but a man is already coming towards you."
          },
          {
            "actor": "Corolla",
            "line": "Precisely. That's him. Theo, let me introduce you to Kriss.#\nWould you kindly provide him a bedroll of yours, at least for tonight?",
            "comment": "\nThe giant, from the top of his impressive figure, simply answers:#\n\n$B\"Of course.\"##$C and then, to you:# $B\"Come.\"$C#"
          },
          {
            "actor": "Corolla",
            "precomment": "You all walk together to his tent.# She keeps it open for you to enter it, Smiurl peeking from behind her legs.#\nShe looks at you and smiling confidently says:",
            "line": "Goodnight. With Theo around, no one will dare getting anywhere near here."
          },
          {
            "actor": "Kriss",
            "line": "Goodnight... And thank you, again!",
            "comment": "You reply as she disappears into the night, without a sound.",
            "childid": "2_02"
          }
        ]
      },
      {
        "id": "2_02",
        "type": "Action",
        "recap": "Theo's tent",
        "isvisited": false,
        "text": "You stand inside the tent.## Theo,# expressionless,# is looking at you.#\nHe looks like he's waiting for you to say something.",
        "actions": [
          {
            "verbs": [
              { "term": "look" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "around" },
                  { "term": "tent" }
                ],
                "answer": "The tent is quite big for your standards. But Theo's massive presence makes it look narrow.#\nThere are few things around. Behind the giant's shoulders you spot a bedroll, a huge backpack, some... weapons?#\nBut the most striking feature to be observed is Theo himself."
              },
              {
                "objs": [
                  { "term": "theo" },
                  { "term": "him" },
                  { "term": "man" },
                  { "term": "guy" }
                ],
                "answer": "There's some light coming from a lantern on the ground, so you can spend few instants looking at the guy's appearance.#\nHe's even taller and massive than Jeorghe, and the similarities end there.#\nHe has ash blonde hair, almost white,# worn in a thick, quite long braid.#\nHe has a well-kept beard,# not long,# and just a little darker than the rest of his hair,#\nwhich frames his sturdy, squared face.#\n\nHis eyes are clear and cold as ice,# still there is something in him softening his gaze...\nAnd his talking,# even if so succint,# wasn't rough, neither veined with hate like those of the other men around there."
              },
              {
                "objs": [
                  { "term": "bed" },
                  { "term": "mat" },
                  { "term": "bedroll" }
                ],
                "answer": "The thing Theo just gave you is very simple and basic. You guess it will just have to do.",
                "condition": {
                  "item": "mat",
                  "value": true,
                  "refusal": "You don't see any."
                }
              }
            ]
          },
          {
            "verbs": [
              { "term": "say" }
            ],
            "answer": "He keeps on staring at me...",
            "objects": [
              {
                "obj": "hello",
                "answer": "$B\"Hello to you.\"#$C He says."
              },
              {
                "obj": "hi",
                "answer": "$B\"Hi to you.\"#$C He says."
              }
            ]
          },
          {
            "verbs": [
              { "term": "hello" }
            ],
            "answer": "$B\"Hello to you.\"#$C He says."
          },
          {
            "verbs": [
              { "term": "hi" }
            ],
            "answer": "$B\"Hi to you.\"#$C He says."
          },
          {
            "verbs": [
              { "term": "sleep" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "bed" },
                  { "term": "mat" },
                  { "term": "bedroll" },
                  { "term": "ground" },
                  { "term": "floor" }
                ],
                "answer": "You put the bedroll on the ground, in the area Theo indicated. You fall asleep, too tired and shocked to dream.",
                "childid": "2_03",
                "condition": {
                  "item": "mat",
                  "value": true,
                  "refusal": "I cannot just lay on the ground."
                }
              }
            ]
          },
          {
            "verbs": [
              { "term": "ask" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "bed" },
                  { "term": "sleep" },
                  { "term": "lay" },
                  { "term": "rest" },
                  { "term": "do" }
                ],
                "answer": "He gives you a bedroll and points you to the freer side of the tent.",
                "effect": {
                  "item": "mat",
                  "value": true
                }
              }
            ]
          }
        ]
      },
      {
        "id": "2_03",
        "recap": "awake in the encampent",
        "type": "Choice",
        "text": "##$G<<Kriss...>>$C##\n\nYou open your eyes.# You hear that 'voice' again.# Are you imagining it?# Are you going crazy?# Who knows.##\n\nSomehow you feel rested enough.# The tent is now empty, Theo must have left earlier.#\n\nThe sun seeps through: it must be quite high already.#\nYou hear noises coming from the camp. It feels like it's rustling with activity.#\nYou lay down a little longer, not sure about how you should feel. All of this is just crazy.#\nYou acted impulsively last night. What are you supposed to do now?##\n\nWell, at least you met Corolla and Smiurl and... Theo...# They seem good persons.#\n\n$c<<The hot girl, the dwarf and the giant. What kind of joke is this??>>$C##\n\nYou just can't wrap yuour mind around all of it.# At least, not yet.",
        "choices": [
          {
            "desc": "You don't know what to do. You need more time to assimilate the rality. You stay in bed to think it through.",
            "childid": "2_05"
          },
          {
            "desc": "No point in helplessly laying down. Better move on and see what's coming next.",
            "childid": "2_04"
          }
        ]
      },
      {
        "id": "2_04",
        "recap": "try sneak",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You get up, stretch your limbs and go outside shielding your eyes from the sun with your hand.#\n\nAll around, the camp is abuzz. Looking at it in the broad daylight, it reveals itself to be bigger than you thought.#\n\nThe majority of the tents has been already packed.#\nIt's full of men and horses going in all directions more or less hastily.#\n\nIn the middle of it all, there is an open jeep. The Chief is standing on its hood, distributing orders here and there.##",
            "actor": "Smiurl",
            "line": "Watch out!",
            "comment": "At that sudden sound,# you wince,# to say the least.#\nSmiurl comes out from behind a pile of straw."
          },
          {
            "actor": "Smiurl",
            "precomment": "Noticing your reaction, he istantly assumes a sorry expression, while he starts explaining:",
            "line": "It's dangerous...## Corolla ordered me to stand guard and give alarm in case of danger.#\nShe thinks someone may want to hurt you...##"
          },
          {
            "actor": "Theo",
            "line": "And she's right.",
            "comment": "You turn around hearing that baritone voice behind you."
          },
          {
            "actor": "Theo",
            "line": "You'd better get ready.# We'll leave soon.# Wear these.",
            "comment": "Theo hands you some clothes.\n#It is clear that what you're wearing is not suitable for the journey that awaits you."
          },
          {
            "actor": "Theo",
            "line": "Above all,# take off those shoes...",
            "comment": "He then adds looking at your popular sneakers.#\nYou have to admit they look alien in that place.## You go back to the tent to get changed.",
            "childid": "2_06"
          }
        ]
      },
      {
        "id": "2_05",
        "recap": "wait thinking",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You are lost in your thoughts...##\nRuminating on what's happening,#\nif this is all inside your head,#\nif you are still alive,\n#and many other good amenities.##\n\nThen a voice abruptly snatches you off your thinking:",
            "actor": "Smiurl",
            "line": "Good morning!",
            "comment": "At that sudden sound,# you wince,# to say the least.#\nSmiurl is poking whit his head into the tent.# He looks at you with a mixture of cheerfulness and agitation."
          },
          {
            "actor": "Smiurl",
            "precomment": "Noticing your reaction, he istantly assumes a sorry expression, while he starts explaining:",
            "line": "Corolla ordered me to stand guard and give alarm in case of danger.#\nShe thinks someone may want to hurt you..."
          },
          {
            "actor": "Theo",
            "line": "And she's right.",
            "comment": "Theo opens wide the tent around Smiurl in order to let himself inside."
          },
          {
            "actor": "Theo",
            "line": "You'd better get ready.# We'll leave soon.# Wear these.",
            "comment": "Theo hands you some clothes.\n#It is clear that what you're wearing is not suitable for the journey that awaits you."
          },
          {
            "actor": "Theo",
            "line": "Above all, take off those shoes...",
            "comment": "He then adds looking at your popular sneakers.#\nYou have to admit they look alien in that place.## They both leave you alone to let you change.",
            "childid": "2_06"
          }
        ]
      },
      {
        "id": "2_06",
        "recap": "time to leave",
        "type": "Story",
        "text": "You inspect the clothes Theo gave you.#\nA big, heavy pair of combat/trekking boots.#\nWide hat which will covers a substantial part of your face.#\nLeather trousers, shirt and a kind of cape, resembling a poncho.##\n\nBut waht surprises you is a very heavy mallet.#\n\n$c<<What am I supposed to do with this?>>##$C\n\nYou wear the clothes, then look more closely at the big hammer.# You can hardly handle it with just one hand.#\nYou don't recognise the metallic material it's made of.#\nThe wider sides are adorned with golden friezes, the shorter fitted with metal spikes.##\n\nFirst, you wonder in what kind of situation you may need to use it.#\nThen you wonder how you could even wield it.##\n\nAfter few instants, you shake your head and put the mallet down with the other weapons there.#\nThat thing is not for you.",
        "childid": "2_07"
      },
      {
        "id": "2_07",
        "recap": "time to leave",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You just finished changing and examining the hammer, when Corolla steps inside.",
            "actor": "Corolla",
            "line": "Hi! I see you are ready: good.# It's time to go."
          },
          {
            "actor": "Kriss",
            "line": "What is this place we are going to...?"
          },
          {
            "actor": "Corolla",
            "line": "The Chief heard about a trade caravan in transit in the valley west from here."
          },
          {
            "actor": "Corolla",
            "precomment": "You stare at her, not understanding what she means.# Maybe you assume an expression a bit stupid.#\n\nCorolla puts her hands onto your shoulders,# transfixing you with her eyes:",
            "line": "We are going to $Wattack$R them,# Kriss.",
            "childid": "3_01"
          }
        ]
      }
    ],
    [
      {
        "id": "3_01",
        "recap": "start of chap 4",
        "type": "Story",
        "text": "-------------------------------\n|          CHAPTER 4          |\n-------------------------------\n\n\nThe horde rides swiftly across the plateau.# In the front, the Chief in his jeep.#\nHorses loaded with weapons and men form clouds of dust,# galloping spurred by their riders.##\n\nYou are in the rearguard,# sharing a horse with Smiurl.# Corolla and Theo are right ahead.#\n\nYou never thought riding could be so frustrating.#\nYou fear that when you'll get back on the ground# (if you will ever do),#\nsomeone will have to very mercifully put all of your pieces back together.#\nYou feel every jolt in your bones;# your ears are full of the shouts coming from that bunch of...##\nYou don't even know $Wwhat$C they are.#\n\nAnd what about Smiurl's own shouts?# Uncomprehensible noise.##\n\n\nAfter what it feels like an eternity to you, that mess starts to wane.#\nThe horses slow down, ending up scattered along the edge of a canyon.#\nIt quite suddenly cuts everybody off.# A long wound scarring the wide, rocky, semi-desert, plain.#",
        "childid": "3_02"
      },
      {
        "id": "3_02",
        "recap": "Chief's last order",
        "type": "Story",
        "text": "You watch from the distance the Chief jumping on the hood of the car.#\nYou couldn't identify the model so far, it must be custom made or heavily customised.#\nHe starts talking loudly:#\n\n$M\"The $Wprey$M will get here shortly after sunset. We'll attack them as fast as lightining,#\nand we'll have them defeated before they can even reach out for a spear!\"#$C\n\nA roar rises from the rabble.#\n\n$c<<What am I doing among these thugs?>>#$C You go back asking yourself.#\nAre you about to witness another slaughter?##\n\n$M\"The vanguard and I will hide in that cove;# the rest of you will be lying in wait here and there, on the other side.\"$C#\nHe points to the other side of the chasm.#\n\n$M\"When you'll see us attack from the front, you'll rush down at break-neck speed,#\npossibly making a heck of a noise, and deprive them of any escape route.\" $CAnd he laughs hard.##\n\n$M\"See ya!\" $CHe salutes with an happy gesture, as if all of you are about to go for a merry trip to the lake.#\nYou watch him rumble down the craggy stone wall rising a big cloud of dust,#\nfollowed by a significant number of the horsemen.",
        "childid": "3_03"
      },
      {
        "id": "3_03",
        "recap": "Corolla explains",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You are still a bit dazed, when Corolla and Theo catch up with you two.",
            "actor": "Corolla",
            "line": "Did you enjoy the show?",
            "comment": "She exclaims with sarcasm."
          },
          {
            "actor": "Theo",
            "line": "We need to find shelter.",
            "comment": "Theo is intently looking around."
          },
          {
            "actor": "Kriss",
            "precomment": "You don't understand what's going on.",
            "line": "What's happening?"
          },
          {
            "actor": "Corolla",
            "line": "It happens that 'a good, healthy battle' is about to start, as the Chief would say.#\nBut this time, there's something he does not know.#\nFor too long he had us all dwell in a snake pit...#\nAnd now, he's gonna reap the betrayal he himself sowed.",
            "comment": "She utters bitterly.",
            "break": true
          },
          {
            "actor": "Corolla",
            "precomment": "You still don't understand.#\nSomehow your face must make that clear, because Corolla starts again, in a milder tone:",
            "line": "Many in the horde are tired of his leadership.# Think about Jeorghe: many others here are just like him."
          },
          {
            "actor": "Smiurl",
            "line": "Each of which would gladly take the three... four of us out!",
            "comment": "Adds Smiurl, who was quiet so far."
          },
          {
            "actor": "Corolla",
            "line": "And not just us; these thugs have an appetite for killing.#\nI cannot stand watching any more villages be burnt to the ground.",
            "comment": "She clenches her fists and her jaw,#\nembers in her eyes.#"
          },
          {
            "actor": "Corolla",
            "line": "Now,# there's no time to explain to you how we ended up with these guys.#\nWe wanted to warn the Chief about the mutiny plans that are being devised,#\nbut Jeorghe and his friends prevented us...# Then you arrived out of nowhere...#\nLong story short:# all we can do now is hide and hope they won't trouble themselves too much looking for us.",
            "childid": "3_04"
          }
        ]
      },
      {
        "id": "3_04",
        "recap": "in the cave",
        "type": "Action",
        "text": "You are still taking in what Corolla explained to you,# when you reach a cave on the side of the ravine.#\nIts access isn't directly visible from where the others are waiting to ambush.#\n\nYou prepare to wait.",
        "actions": [
          {
            "verbs": [
              { "term": "look" },
              { "term": "watch" },
              { "term": "observe" }
            ],
            "answer": "The sun is sinking down,# slowly and relentlessly,# anxious and tremulous,#\nready to be swallowed up into night's unfathomed lair,#\ngiving way to her uncountable shiny emissaries.##\n\nAlien gleams dance on the horizon,# as the strongest rays run the last race,#\ndarkening on the way and turning the reddish wasteland in a huge tapestry,#\nwhere the armed men are nothing more than maybe-dreamed shapes."
          },
          {
            "verbs": [
              { "term": "listen" }
            ],
            "answer": "Not the slightest sound disturbs the absolute calm and silence now reigning in the canyon.#\nAll you can hear is your own blood flowing inside of your ears,#\nas well as your heartbeat.#\n\nFor all you know,# Theo, Corolla and Smiurl could even have stopped breathing."
          },
          {
            "verbs": [
              { "term": "wait" },
              { "term": "waiting" }
            ],
            "answer": "The twilight gleam fades away.# Darkness grows thicker.#\n\nAt once,# a distant sound.# It must be the caravan you are waiting for.##\n\nTime seems to further slow down its pace.# You can feel the seconds trickle through your fingers as mercury,# liquid,#\npainstakingly seeping through and then falling down,# with unbearable slowness,#\nalmost hesitating,# and,# in the end,# dying on the ground with a thud.",
            "childid": "3_05"
          }
        ]
      },
      {
        "id": "3_05",
        "recap": "attack the transports",
        "type": "Story",
        "text": "You start hearing a distant noise.# It must be the convoy.##\n\nAfter few more endless minutes spent listening to that noise increase,#\nyou and the others peek outside.#\nDown there are a dozen of big slow transports.# Some of them are pulled by horses, others by motor vehicles.#\nThey are escorted by many horsemen.##\n\nWithout delay, the attack begins.#\nShouts arise in the canyon, echoing countless times on the stone walls, confounding the enemy.#\nThen the Chief's roaring jeep charges, suddenly appearing out of its hiding place.#\nThe entire convoy halts suddenly, and the defensors spread aroud the first chariots.#\n\nThe stranglehold works, as the rest of the horde attacks them from their back.#\nThe noise now saturates the canyon like water in a bottle.#\n\nIt's all over very soon.# The attackers are taking out the very last men,# when Corolla says alarmed:#\n\n$R\"Wait a second!# What is this noise...??\"##",
        "childid": "3_06"
      },
      {
        "id": "3_06",
        "recap": "attack of the lights",
        "type": "Story",
        "text": "A gloomy vibration is quickly increasing, propagating through the canyon, echoing between the rocks.##\n\nSuddenly,# a high sound blares all around;# all the fighters stop, looking around puzzled.#\n\nAbruptly,# the ringing,# deafening horn-like sound stops,# giving way to silence once more.##\n\nAnd,# quietly,# silently,# the edges of the canyon start getting filled with lights.#\nThey appear gradually, randomly,# in different sizes and colours.#\nThey look like $Ywisps,# $Rignis $Bfatuuses,# $Gslowly $Mwiggling $caround.##\n\n\n$CYou shudder.",
        "childid": "3_07"
      },
      {
        "id": "3_07",
        "recap": "attack of the lights continued",
        "type": "Story",
        "text": "$S$KThe darkness gets bluntly ripped apart by a shaft of light,#\npure white refracting in the whole color spectrum,#\nblinding you completely.#\n\nThere is no use in shutting your eyes,# as the light seems to directly reach into your mind.#\n\nA lot of commotion follows.# When your eyes start to work again you assist to the slaughtering.#\nThe lights attack somehow everybody in the canyon,# the horde as well as the men of the convoy.#\n\n$s$CIt's all very quick.#\nBlinded and panicking, nodoby seems to escape.# After few minutes, it's all over.#\n\nThe lights are rushing and fading away in the distance already, leaving only a dead silence behind...",
        "childid": "3_08"
      },
      {
        "id": "3_08",
        "recap": "inspect",
        "type": "Story",
        "text": "You all stay hidden for a while.# When you are sure it's 'safe',# you cautiously go outside.#\n\nThe chariots lie abandoned, their torches still lit. Their scattered faint light reveals aspects of the scene.#\n\nIt seems there's no survivor;# from this distance it's hard to say.#\n\n$B\"Let's look for survivors.\"#$C Theo says, unsurprisingly.# His voice sounds like he does not believe he'll find any.##\n\nYou follow them, not knowing what to think,# once again.#\n\nAs you descend, you encounter an increasing number of bodies.# You are just thankful it's dark:#\nyou won't have their terrified expressions imprinted in your memory forever.##\n\nYou all go towards a plume of smoke rising from behind a big boulder.#\nBehind there is the Chief's jeep, which upholstery is feeding the flames you saw.#\n\n$Y\"The Chief!\"$C Smiurl shouts out.#\n\nThen you see him.# Sitting on the ground, his back against the front fender.#\nHe must be dying;# he's losing a lot of blood from a conspicuous wound in his chest.#\nNot just you, also Corolla, Theo and Smiurl freeze looking at him, not knowing what to say.#\nThus it surprises you, the fact that after few instants you step forward.#\n\nThe Chief slowly lift his chin looking at you, and,# despite everything,# he manages to grin.",
        "childid": "3_09"
      },
      {
        "id": "3_09",
        "recap": "Chief",
        "type": "Story",
        "text": "$M\"Were you a spy after all...?\" $CHe coughs, blood leaking from the corner of his mouth.#\nThen he seems to notice the others:#\n\n$M\"I should have expected this...\"$C He looks back at you, and after taking one painful breath,#\nhe smirks one more time, then adds:#\n\n$M\"Young man,# what about...# avenging me...\"$C# But his last words die this way along with his last breath.##\n\nYou all stand there still, unable to do anything.#\nAfter all you witnessed since you arrived in this place, you feel like you have just reached the point of no return.#\nYou feel like something in you mind just cracked.# Like you're losing touch with reality.##\n\nThen,# it happens.##\n\n$cYou find yourself walking towards him.# You feel like you're projected outside of your own body,#\nas if $Gsomeone else$c is moving your muscles.#\nYou lean on him and absent-mindedly observe your own hands untying his sword from his side.\n#Next thing you notice,# you are wielding it,# pointed to the sky,# staring at the blade glinting with ominous glares.##\n\n\n$CIn the meantime, Smiurl has retracted in himself, gaining a brownish hue.#\nTheo is back to being impassible as usal.#\nFor some reason,# Corolla seems to approve your actions and retrieves the Chief's chain.",
        "childid": "3_10"
      },
      {
        "id": "3_10",
        "recap": "Sword",
        "type": "Story",
        "text": "You suddenly come back to your senses.# You return to feel the ground beneath your feet,#\nthe air of the night against your skin,# the glances of the other three,#\nthe mighty weight of the sword,# too long and heavy to be wielded with one hand only.#\n\nYou immediately put it down with the tip in the ground,# then you lean with your own weight on it.\n\n$R\"Are you ok...?\"#$C Asks you Corolla, putting a hand on your shoulder.#\n\n$c\"Huh? I think...# I think I am...\"#$C You answer.# But you have no idea what just happened.##\n\n$B\"We camp here, until daybreak.\"#$C Theo deliberates, walking back to the cave. ",
        "childid": "4_01"
      }
    ],
    [
      {
        "id": "4_01",
        "recap": "intro 5",
        "type": "Story",
        "text": "-------------------------------\n|          CHAPTER 5          |\n-------------------------------\n\n\n$cAll around you is thick darkness.#\nYou have no body,# no eyes.#\nJust an adimensional point,# in the void.#\nYou 'hear' hollow sounds around,# like thunders.##\n\nThen, you think you can see sinisters glares.#\nThe Chief's sword gets closer and closer,# its tip menacingly pointed at your eyes.#\nThe shiny edge is ever closer,# closer...##\n\nYou shout.# The darkness reacts,# vibrating in response to such a huge amount of anger and pain.#\nThen,# suddenly,# as answering to the farthest echoes of your unaware call,# light comes to you.#\nA blinding flash hits you,# piercing through every particle in your body.##\n\nYou are one with the light now.#\nYou hear a warm voice whispering,# or maybe thinking of whispering:##\n\n$G<<Have courage!>>##\n\n$c...# Are you not alone?",
        "childid": "4_06"
      },
      {
        "id": "4_06",
        "recap": "prechoice",
        "type": "Story",
        "text": "The light keeps on tormenting you.# You open your eyes, and realise the sun is lighting your face.#\nWas it just a dream?##\n\nYou rub your eyes, stand up and exit the cave.#\nAs you stretch your body,# you look around.# Someone has lit a fire.#\nYou appreciate its warmth,# as you feel the chill early morning air on your skin.##\n\nThe absurdity of what you're experiencing comes back haunting you.##\nWhat is this place?# Who are these people?# Where is home?##\n\nEverything is too surreal to be true.# The Horde...# And what about them three?#\nThe girl has something peculiar, something that makes her different from the others around.#\nThere is a special light in her eyes,# and her poise is always elegant,# self-confident# and seductive.#\nIn her gaze there's something noble, something you sense clearly in the giant as well.#\nOnly the dwarf seems to be completely unrelated to everything and everyone else you've seen so far...#\n\nBut,# somehow,# you don't know why but you feel you can trust them.#\nMaybe they are savages,# but not $Wanimals$C.##\n\n\nInterrupting your thoughts,# Smiurl appears from behind a boulder,# carrying some bundle in his arms.",
        "childid": "4_02"
      },
      {
        "id": "4_02",
        "recap": "talk,eat,investigate",
        "type": "Choice",
        "text": "Standing close to the fire, you think about what to do next.",
        "choices": [
          {
            "desc": "You are starving. Ask Smiurl about breakfast.",
            "childid": "4_03"
          },
          {
            "desc": "You need to know what's going on... Before something else happens.",
            "childid": "4_04"
          },
          {
            "desc": "Better look around the caravan spoils for something useful.",
            "childid": "4_05",
            "unhide": "3",
            "isnotrepeatable": true
          },
          {
            "ishidden": true,
            "desc": "You are done here. Better get moving now.",
            "childid": "4_07"
          }
        ]
      },
      {
        "id": "4_03",
        "recap": "breakfast at Smiurl's",
        "type": "Dialogue",
        "dialogues": [
          {
            "actor": "Smiurl",
            "line": "Oh! Goodmorning Kriss! Slept well? Are you hungry?",
            "comment": "He anticipates you, thoughtfully."
          },
          {
            "actor": "Kriss",
            "line": "Hi Smiurl. I am not entirely certain, but I'm hungry for sure!"
          },
          {
            "actor": "Smiurl",
            "precomment": "He goes next to the fire and starts handling and unpacking the stuff he has carried.",
            "line": "The chariots have been raided... But I managed to find some food.#\nHere it is: a jar of water,# some brandy,# dried meat, some sand-fruit and pears..."
          },
          {
            "actor": "Kriss",
            "line": "Sand-what?"
          },
          {
            "actor": "Smiurl",
            "line": "Sand-fruit!# Don't tell me you don't know what they are!# It's a delicacy.#\nThey should be prepared with Pinzerro sap, shouldn't they?#\nI guess I'll have to work it out with what I have here..."
          },
          {
            "actor": "Kriss",
            "precomment": "You still have no idea what he's talking about.# He hands you one of them to let you see.#\nIt looks a bit like a seashell, as big as a walnut.",
            "line": "What kind of stuff is this?",
            "break": true
          },
          {
            "actor": "Smiurl",
            "line": "I can't believe you're asking it! These are Croeggs larvae."
          },
          {
            "actor": "Kriss",
            "line": "Larvae?...# You mean...# insects??",
            "comment": "You give him back his 'sand-fruit'."
          },
          {
            "actor": "Smiurl",
            "line": "Insects, of course! But not just any insect.# An elder Croegg can weigh as much as you.# I caught one this big once...",
            "comment": "\nAnd he measures the air indicating something over one meter long."
          },
          {
            "actor": "Smiurl",
            "precomment": "You must have made a disgusted expression, as he adds, after looking suprised seeing your face:",
            "line": "Well, I'll have to eat your serving too!",
            "comment": "And he merrily takes the sand-fruit back.",
            "childid": "4_02"
          }
        ]
      },
      {
        "id": "4_04",
        "recap": "revelations",
        "type": "Dialogue",
        "dialogues": [
          {
            "actor": "Kriss",
            "line": "Listen, Smiurl...",
            "comment": "You start, looking at him seriously."
          },
          {
            "actor": "Kriss",
            "line": "Could you tell me something...?# I mean...## Where are we exactly?"
          },
          {
            "actor": "Smiurl",
            "precomment": "#He looks at you, puzzled.",
            "line": "Uh? We're still in the canyon, aren't we? What do you mean..."
          },
          {
            "actor": "Theo",
            "line": "I don't think that's what he's asking.",
            "comment": "You hear Theo and Corolla approaching from behind your back."
          },
          {
            "actor": "Corolla",
            "line": "Yep.",
            "comment": "#\n\nYou turn around. They stop and stand there staring at you.#\nThey seem to expect from you to say something next.",
            "break": true
          },
          {
            "precomment": "$c<<That's it>># $CYou think. #$c<<The 'moment of truth'>>$C Where to start?#\nYou start with the very basics.# You smile nervously, and say in a quiet voice:",
            "actor": "Kriss",
            "line": "First of all,# we are still on Earth,# right?"
          },
          {
            "actor": "Smiurl",
            "precomment": "Corolla startles. Even Theo's face darkens,# in spite of his usual imperturbability.",
            "line": "No.",
            "comment": "The little guy answers simply,# as it was a normal thing for you to say."
          },
          {
            "actor": "Smiurl",
            "line": "This is $WNoi-Hert$Y.",
            "comment": "He looks at you calmly, as he continues preparing breakfast."
          },
          {
            "actor": "Kriss",
            "line": "Huh??# No-what??",
            "comment": "As your disbelief increases."
          },
          {
            "actor": "Corolla",
            "line": "Wait a minute...# Kriss,# could you tell us in which time are we?"
          },
          {
            "precomment": "Afraid of answering at this point, you almost beg:",
            "actor": "Kriss",
            "line": "Please,# tell me this is the 21st century!"
          },
          {
            "precomment": "Corolla bows her head, looking away.# Theo shakes his.",
            "actor": "Theo",
            "line": "You'd better sit down,# young man.",
            "comment": "#\n\nThen,# he starts talking again.",
            "childid": "4_08"
          }
        ]
      },
      {
        "id": "4_08",
        "recap": "Theo tells Noi-Hert's story",
        "type": "Story",
        "text": "$BNoi-Hert was discovered five centuries after the Great Religion War,#\nfew decades after interstellar travel was made possible.#\n\nIt was the first inhabitable planet discovered by the Earthers ships.#\nIt is a little smaller than the Earth, about two-thirds of its volume,#\nbut it has a greater nucleus density, so the gravity is about the same.#\n\nWith just a little moon, it orbits lonely around a G-type star\nthat everybody called sun but had no real name.#\n\nOver time, the Earthers established many colonies on the surface,#\nfor commercial, reasearch and overpopulation reasons.#\n\nThe best and the worst of the Earth arrived here.#\nA lot of brilliant minds, scientists, artists, pursuing new discoveries\nand exploring new horizons, with a whole planet at their disposal.#\nBut, also, a lot of low-lives, jailbirds, the most despicable\nfrom every kind of culture and environment, fleeing from the world\nthat rejected, hunted them down relentlessly.#\n\nA huge penitentiary complex was also built on the other side of this planet,#\nas this side flourished giving way to new, unmatched scientific progress.#\nThere was space for everybody, and every commodity and resource#\nwas shipped by the Earth on its $WTitans$B, the huge orbital ships.#\n\nBut this was one of the reasons of the collapse, too.",
        "childid": "4_09"
      },
      {
        "id": "4_09",
        "recap": "More story",
        "type": "Story",
        "text": "$BOne day, without notice, after some twenty years of frantic development,#\nthe Earthers abandoned the colonies to themselves.##\n\nIn time, legends started spreading.#\nFunny stories about spirits of this planet emerging from the sea and the land to drive out the human invaders,#\nonly sparing those who were born here.# At first, very few believed such myths.#\nThe wisest ones were convinced there had to be a way more concrete explanation behind all of it.#\nA war,# maybe some cataclysm,# on the Earth...##\n\nRegardless of the actual reason, the colonists soon realised there was little they could do,#\nin order to limit the damage deriving from the exile imposed on them.#\nWithout the Titans, global communications broke down, as well the great commercial routes.#\nMachines and Earth technology started to fade as there was no proper supply chain\nto refurbish and repair and improve the existent.#\nWithout access to Earth's knowledge, scientists and researchers had to start over, takin a massive leap backwards.##\n\nThen,# with decades, centuries,# the old generations were replaced,#\ngiving way to a fragmenting society led by the strongest, most violent elements.#\n\nHordes started forming and everything descended more and more into anarchy.",
        "childid": "4_10"
      },
      {
        "id": "4_10",
        "recap": "take in the truth",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You sit down on the ground taking in what Theo just told you.# $c<<He never talks, but when he does...!>>$C##\n\nYou try to make some sense of his story,# and after few minutes of silent meditating, you resolutely say:",
            "actor": "Kriss",
            "line": "I can't believe it.## It would mean I traveled through time!# It's clearly impossible!"
          },
          {
            "actor": "Corolla",
            "line": "We're having an hard time believing you too, so we are kinda even...",
            "comment": "Corolla smiles shrugging her shoulders."
          },
          {
            "actor": "Corolla",
            "precomment": "You still can't wrap your mind around it.##\nWhat are you doing there?# Where will you go?# What will be of you?#\nYou think about all the people you left home, they must be so worried...#\n$c<<You are a missing person>># $CYou say to yourself.##\n\nCorolla sees your distress,# kneels next to you and says, hand on your shoulder:#",
            "line": "Do not worry too much now.# We'll find an answer somehow."
          },
          {
            "precomment": "You look at her, still depressed.# Why do she and the others seem to care about you?#\nLooking at her expression, you manage to produce half a smile and say, actually feeling it:",
            "actor": "Kriss",
            "line": "Thanks...",
            "childid": "4_02"
          }
        ]
      },
      {
        "id": "4_05",
        "recap": "find Ayonn tech",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You slowly walk towards what's left of the convoy.# You are already having second thoughts,#\nsince you have to traverse that field of death alone now.#\n\nLuckily, you spot Theo far ahead and Corolla too,# among the wreckage.# They must have thought the same thing.##\n\nIn the daylight, the view is miserable.#\nBodies,# burnt chariots,# debris...##\nYou start thinking about the eventuality of searching the bodies...##\n\n$Y\"Hey look what I found!\"$C Smiurl calls from behind.#\n\nYou and the others walk to him to see.#\n\nHe's leaning over a body, close to his dead horse.# You don't recognise him.# Was he one of the defensors?",
            "actor": "Corolla",
            "line": "What's this stuff?",
            "comment": "Corolla points at some kind of armor the guy wears.# Wore.# You got it.",
            "replies": [
              {
                "line": "You think it's time to man up. Show her... them... you are not a crybaby.",
                "nextline": "touchArmor"
              },
              {
                "line": "Getting even closer? Touching the dead body? no way!",
                "nextline": "theoTouches"
              }
            ]
          },
          {
            "linename": "touchArmor",
            "precomment": "You kneel down.# You try not to look the dead man in his glassy eyes.# You focus on the plates on his chest.##\nYou touch slighlty the surface of the armor, and suddenly it lights up!#\nYou abruptly withdraw your hand, and the armor fades off again, slowly.#\nBefore shutting off completely, it lights up with glares like little electrical storms, looking like...# holograms?",
            "actor": "Corolla",
            "line": "What the...!",
            "nextline": "itsAyonnbaby"
          },
          {
            "linename": "theoTouches",
            "precomment": "Theo senses your hesitation, and quickly kneels down.#\nHe touches slighlty the surface of the armor, and suddenly it lights up!#\nHe abruptly withdraws his hand, and the armor fades off again, slowly.#\nBefore shutting off completely, it lights up with glares like little electrical storms, looking like...# holograms?",
            "actor": "Corolla",
            "line": "What the...!",
            "nextline": "itsAyonnbaby"
          },
          {
            "linename": "itsAyonnbaby",
            "precomment": "Theo grabs several plates, pulling them and detaching them from the rest of the armor.#\nYou all go in a well lit place, and away from the body, to better look at that piece of technology.#\n\nYou watch as Theo handles the plates, studying them from every angle.#\nAfter a short while he points at some kind of bulge with two indicator lights.",
            "actor": "Theo",
            "line": "This is the energy supply..."
          },
          {
            "precomment": "Then, pointing at the whole thing:",
            "actor": "Theo",
            "line": "This can only be a product of Ayonn."
          },
          {
            "precomment": "Smiurl shrieks in fear.",
            "actor": "Corolla",
            "line": "Are you sure of it?",
            "comment": "She asks, suddenly serious."
          },
          {
            "actor": "Theo",
            "line": "Absolutely. No one else has tech like this anymore.",
            "break": true
          },
          {
            "precomment": "After a while, you break the silence:",
            "actor": "Kriss",
            "line": "What this Ayonn would be?"
          },
          {
            "actor": "Smiurl",
            "line": "The legendary city of Ayonn, the impenetrable!",
            "comment": "He declaims, with a fearful voice."
          },
          {
            "actor": "Kriss",
            "line": "Impenetrable?"
          },
          {
            "actor": "Smiurl",
            "line": "Yes! Ayonn, the city of light, protected by its everlasting magic shield!",
            "comment": "He breathes in sharply, then continues:"
          },
          {
            "actor": "Smiurl",
            "line": "You see, Ayonn is the magical city which resist, eternal, since the times of the abandon!#\nNobody can get in, not even get close to it.#\nIts magic shield is an invincible defense, even from just the $Wthought$Y of attacking it!#\n\nInside the city are untold riches and luxuries...#\nAnd they say the few dwellers of the city that have ever been seen,# they shine their own light!",
            "comment": "\nHe explains in an excited crescendo.#\nThen he falls silent at once, as if he fears his own words."
          },
          {
            "actor": "Kriss",
            "line": "Interesting.# At least this could explain what we saw last night...",
            "comment": "You say unimpressed."
          },
          {
            "actor": "Theo",
            "line": "And this armor as well",
            "comment": "Theo concludes.",
            "childid": "4_02"
          }
        ]
      },
      {
        "id": "4_07",
        "recap": "is this my party - towards Ayonn",
        "type": "Story",
        "text": "You walk away from the fire and the others.#\nYou start to have a weird feeling.#\n\nYou can't be here just randomly.# There must be some reason.#\n\nAnd if there is a thing you know now,# it's you won't have peace until you'll find it.##\n\n$c<<And these guys here they seem to believe in me.# Like they were...# waiting for someone like me?>>#\n\n<<What am I thinking!# What should I expect from myself now,# to become their leader?>>$C#\n\nYou are lost in your thoughts, looking at the horizon.#\nYou barely notice the others getting close to behind you.#\nYou barely notice your own hand moving,# as it has its own will,# reaching for the sword.##\n\nYou don't know what you feel more,# if surprised,# or determined,# when you find yourself exclaiming,#\nwhile you theatrically draw your sword,# pointing it to the west:##\n\n$c\"To Ayonn!\"",
        "childid": "5_01"
      }
    ],
    [
      {
        "id": "5_01",
        "recap": "start ch 6",
        "type": "Dialogue",
        "text": "-------------------------------\n|          CHAPTER 6          |\n-------------------------------\n\n\n#",
        "dialogues": [
          {
            "actor": "Smiurl",
            "line": "Hey Kriss...# tell me...# how did you know this was the direction to take?",
            "comment": "Smiurl asks you,#\nwhile he fights with the straps of his backpack, almost double in size compared to him."
          },
          {
            "actor": "Kriss",
            "line": "Huh...?# I don't know...## Instinct?",
            "comment": "You shrug your shoulders, smiling at the little guy."
          },
          {
            "actor": "Theo",
            "precomment": "Corolla is silently looking sideways at you.# Theo notices it,# then says:",
            "line": "You got guts, kid,# that's for sure..."
          },
          {
            "actor": "Kriss",
            "line": "Why would I?# It can't be so terrible...# I mean,# It's just a city.#\nBesides,# we go in peace.# I don't see why...",
            "comment": "You stop talking,# seeing how Theo looks away and sighs,#\nsilently staring at the ground in front of his feet.##\n\nYou all fall silent for the rest of the morning.#\n\nYou wonder if everyone is busy thinking about what's going on,# if they should stop indulging you.#\nYou still don't understand why they're sticking to you.#\n\nIt is with relief, after few hours,#\nthat you stop and sit down against a rock,# when Theo signals to rest and eat something.",
            "childid": "5_02"
          }
        ]
      },
      {
        "id": "5_02",
        "type": "Action",
        "recap": "rest in desert",
        "text": "The weight of the sword tied on your backpack had started taking its toll.#\nYou insisted in wanting to carry it yourself.# You wonder if it actually makes sense,#\nbut something prevents you from parting with it.#\nYou feel like it's $cyour sword$C.##\n\nThe fact that you just took it from the Chief means nothing to you.#\nEven if it did not belong to you until today,#\neven if you have never seen any sword up close in the first place.",
        "actions": [
          {
            "verbs": [
              { "term": "look" },
              { "term": "examine" },
              { "term": "observe" }
            ],
            "answer": "The reddish landscape stretches wide all around you.# You think it looks like Arizona, or Nevada, back on earth.#\n\nBack on earth.## Ridiculous.##\n\nThe sun hits hard on you;# now you thankfully understand why the hat.\n\nHow exactly far this Ayonn city is?# How long will it take to get there?#\nYou start to worry:# you have only a limited supply of food with you.#\nHow will you survive the desert?",
            "objects": [
              {
                "objs": [
                  { "term": "sword" },
                  { "term": "blade" },
                  { "term": "weapon" }
                ],
                "childid": "5_03"
              }
            ]
          },
          {
            "verbs": [
              { "term": "ask" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "food" }
                ],
                "answer": "$B\"We have enough for 3 days. Then, we will hunt.\"#$y So naturally.\n\n#You wonder what kind of prey he has in mind.# All you saw so far were just few lizards.#\n\nWell,# you already decided you will need to trust these guys,# so no use in worrying at this point."
              },
              {
                "objs": [
                  { "term": "water" }
                ],
                "answer": "$Y\"We have two days worth of water. We need to find some more along the way.\"#\n\n$yYou try not to look worried.#\n\n$Y\"Don't you worry about that.# It's not our first time in the desert!\"#$y He smiles at you reassuringly."
              },
              {
                "objs": [
                  { "term": "travel" },
                  { "term": "journey" },
                  { "term": "distance" }
                ],
                "answer": "$R\"The location of the city of Ayonn is not a mistery.#\nAt least, the approximate location, since it's a legendary place we're talking about\"$y# she smirks.#\n\n$R\"So...# the so-called plain of Ayonn it's ten days of walking west from here.#\nAt the end of this desert, we'll have to cross the Mazerock.# Then...# We'll see.\"#\n\n$ySmiurl squeals."
              },
              {
                "objs": [
                  { "term": "mazerock" }
                ],
                "answer": "$Y\"Just another example of Ayonn's defenses!# A tricky place from which no one has ever returned!#\nIf the place itself doesn't kill you,# an Oxengutter or some other fiend will surely fix it!\"#$y You gulp.#\n\n$R\"Stop it Smiurl... we can deal with any kind of natural maze,#\nand surely we can deal with some Oxengutter of any sort.\"#$y You marvel at her confidence.#\n\nTheo, as per usual, doesn't even seem interested in what they're saying."
              },
              {
                "objs": [
                  { "term": "oxengutter" }
                ],
                "answer": "$B\"Don't pay attention to everything Smiurl says...# And trust me,# you don't even want to know that.\"#\n$yHis words do not reassure you,# that's for sure."
              }
            ]
          },
          {
            "verbs": [
              { "term": "rest" }
            ],
            "effect": {
              "item": "desertrest",
              "value": true
            },
            "answer": "You all sit with your shoulder against a boulder, sheltered from the high sun.#\nYou eat some of the food prepared before by Smiurl, and drink some of the water.#\n\nYou really needed this.# The others do not look tired at all,# compared to you."
          },
          {
            "verbs": [
              { "term": "walk" },
              { "term": "leave" }
            ],
            "answer": "$R\"Better keep going.# It's still a long way.\"$y",
            "childid": "5_05",
            "condition": {
              "item": "desertrest",
              "value": true,
              "refusal": "You need to rest for a while."
            }
          }
        ]
      },
      {
        "id": "5_03",
        "recap": "in sword",
        "type": "Story",
        "text": "The sword is very long and heavy.# It is perfectly balanced.#\nThe long grip seems made of some metal, darkened through time.# But it's surprising, to the touch.#\nIt feels like it adapts perfectly to your hands,# as if it is...# alive.# It is not cold nor rigid.#\nIt is extremely hard though, and it resists all of your attempts at sctratching it.#\n\nYou shrug your shoulders,# and you move on to inspect the blade.#\n\nThe blade is double-edged,# and this looks weird to you because it is also slightly curved.#\nIt's four fingers wide at the intersection with the guard,#\nthen it spreads outward with an arc on each side reaching about a handbreadth.#\nThe width decreases towards the point.# And the point looks strange: it is oddly asymmetrical,#\nas if the blacksmith wanted to make it look as a broken, splintered blade,# that was later resharped as a razor.#\n\nYou think it's impossible to fight with a weapon like that.#\nNonetheless, when you wield it you feel as your arm is one thing with the sword,#\nand it does not looks like you and the sword move in a clumsy or unbalanced way at all.##\n\nThe metal of the blade itself looks strange.# It reflects the light unevenly,#\nand you don't know why but you think it's like its molecular structure is constantly shifting.#\nSometimes you can see your own image reflected on the blade as a mirror;#\nyet a second after the reflection seems to swim or evaporate in different directions,#\nas if it is subject to a sudden and impossible turbulence.#\nIf you keep on staring at it, the blade looks like it's subtly moving back and forth,#\nlike a living thing,# even if it's cold and solid to the touch.#\n\nAs if all of that isn't enough,# you also feel like you can glimpse an inscription flowing along its entire lenght.#\nBut it's more a feeling than an actual visual input.# You can't explain it to yourself.",
        "childid": "5_04"
      },
      {
        "id": "5_04",
        "recap": "out sword",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You sigh,# ceasing your examination.# It doesn't seem there is much else you can discover now.#\nYou look up,# and see your friends staring at you.# You did not notice they fell silent earlier.",
            "actor": "Kriss",
            "line": "What is it?"
          },
          {
            "actor": "Corolla",
            "line": "You spent a lot of time lost in contemplation..."
          },
          {
            "actor": "Smiurl",
            "line": "You looked like you were in a trance.",
            "comment": "Smiurl intervenes."
          },
          {
            "actor": "Corolla",
            "line": "...you actually looked like you were somewhere else, totally alienated.#\nAre you sure you are well?",
            "comment": "She continues."
          },
          {
            "actor": "Kriss",
            "line": "Sure, never been better...",
            "comment": "You are not entirely sure about that,# still,# you don't feel unwell either."
          },
          {
            "actor": "Corolla",
            "line": "Good thing...",
            "comment": "She sighs.",
            "childid": "5_02"
          }
        ]
      },
      {
        "id": "5_05",
        "recap": "see something",
        "type": "Dialogue",
        "text": "After another couple of hours spent walking,# the flat scene in front of you shows the first change.#\nA kind of spire of rock,# solitary,# direction south-west.#\nIt appears fading in:# you now become aware of the atmoshperic haze that limits visibility to maybe 20 kilometers.#\n\n",
        "dialogues": [
          {
            "actor": "Kriss",
            "line": "What is that?",
            "comment": "You ask."
          },
          {
            "actor": "Smiurl",
            "line": "A rock like many others.# There's nothing else in this desert but sun and rocks.",
            "comment": "Smiurl shrugs."
          },
          {
            "precomment": "You go back peering at the distant shape.# You can't stop staring at it.#\nOnce again,# you perceive something weird, something you can't explain.#\n\nYou keep on walking, eyes on the top of the pinnacle.#\nIt's a vague feeling,# you wonder if it isn't just your sight deceiving you:#\nthe rock looks like it's moving, or like it's glowing slightly.#\nYou hear or think to hear faint sounds, like many barely perceptible whispers.##",
            "actor": "Smiurl",
            "line": "Hey!",
            "comment": "He suddenly exclaims, breaking that 'spell'."
          },
          {
            "actor": "Kriss",
            "line": "Huh...? What?",
            "comment": "You snap out of your mind focus."
          },
          {
            "actor": "Smiurl",
            "line": "It's like ten minutes now, you've been walking like a ghost, staring into nothing..."
          },
          {
            "actor": "Kriss",
            "line": "Ten minutes...?",
            "comment": "They felt like few seconds to you.",
            "break": true
          },
          {
            "actor": "Corolla",
            "line": "Is something wrong?",
            "comment": "Corolla asks you."
          },
          {
            "actor": "Kriss",
            "line": "Erm...# No...# I mean, maybe...# I can't explain it.# I don't even know if it's not just my imagination."
          },
          {
            "precomment": "Everybody falls silent for a while.# You keep on watching each other,# in turns.#\nAfter a while,# you feel that kind of impulse,# and say abruptly and resolutely:",
            "actor": "Kriss",
            "line": "I want to see this through.# Let's go to the spire!"
          },
          {
            "precomment": "Corolla questions Theo with her eyes.# He says:",
            "actor": "Theo",
            "line": "Are you sure of this?# We don't have much food and water.# A detour like this could cost us a lot.#\nIs it really necessary?"
          },
          {
            "precomment": "You stare into those imperturbable sky blue eyes.",
            "actor": "Kriss",
            "line": "I believe it is.# But,# you don't have to come with me...",
            "comment": "You start saying,#\nstill feeling there's no reason why they should baby-sit you."
          },
          {
            "actor": "Corolla",
            "line": "Nonsense!# We won't leave you alone..."
          },
          {
            "actor": "Theo",
            "line": "Then it's settled.",
            "childid": "5_06"
          }
        ]
      },
      {
        "id": "5_06",
        "type": "Choice",
        "recap": "climb?",
        "text": "You reach the rock wall at sunset.# The feeling hasn't left you.# On the contrary, it intensified.#\n\nThe spire has revealed itself to be bigger than you expected.# It's more like a peak,# a small, sharp mountain.#\nIt also looks higher, now that you are standing at its foot.##\n\nA natural tower in the middle of the desert.##\n\n$R\"Don't you think we'd better camp here for tonight?\"$C Corolla asks,#\nseeing how yearningly you're looking at the vertical rock wall.#\n\n$Y\"I'm tired... we walked all day.\"$C Smiurl adds, complaining.#\n\nYou are not sure about what to do.# Your sensation it's so strong now, you can't think of anything else.",
        "choices": [
          {
            "desc": "You don't know why or how, you just know you have to climb that mountain right now.",
            "childid": "5_07"
          },
          {
            "desc": "Corolla is right. Night is about to fall, and you are all tired.",
            "childid": "5_08"
          }
        ]
      },
      {
        "id": "5_08",
        "type": "Story",
        "recap": "prepare for the night",
        "text": "You agree with Corolla, slowly turning away from the wall in front of you.#\nSmiurl starts to unpack in order to light a fire and eat.#\n\n$B\"We'll take turns guarding tonight.\"$C Theo states.##\n\nYou eat sitting around the fire.#\nNobody talks much,# and soon comes the time to sleep.#\n\nYou fight to ignore the whispers you are still convinced to be hearing,#\nand finally fall in a restless sleep.",
        "childid": "5_09"
      },
      {
        "id": "5_09",
        "type": "Story",
        "recap": "gameover under the rock",
        "text": "A $Wshout$C awakes you abruptly.##\nYou sit up, trying to understand what's happening.# Under the starlight, you can only partially guess.#\nWhat shocks you is the noise.##\n\nA... Growl?# Howl?# Snarl?##\n\nIt's interrupted only by loud thuds followed by Theo's grunts.#\n\nYou hear Corolla and Smiurl shouting at each other and at you.#\n\nAdrenaline rushes through you;# you frantically shoot out of your bedroll trying to reach your sword.##\n\nSomething hits you,# you're on the ground now, on your back.##\nSomething is keeping you pinned.#\nThe only thing you can see are two malevolent eyes,# glinting menacingly in the darkness.#\n\nThe last thing you see,## the fangs of the beast upon you,# shining under the faint light of the night.$d###\n\n\n-- GAME OVER --##\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, traveler.",
        "childid": "5_06"
      },
      {
        "id": "5_07",
        "type": "Story",
        "recap": "start climbing",
        "text": "$c\"I can't wait the whole night under here...# I couldn't sleep anyway.#\nMy...# 'sensation' now is so strong, it wouldn't let me rest.# I have to go,# now.#\nYou can wait for me here...\"$C#\nYou don't even wait for their answer: you turn your back and start walking towards the crag.#\n\nYou don't understand what compels you like that, you just know you can't help it now.#\n\n$R\"Hey!# What are you thinking?\"$C Corolla shouts from behind after a while.#\nYou see you upset her.# You feel guilty,# but comforted too seeing that the three of them are still following you.#\nHer, in the front.# Smiurl, obediently following her.# Theo, impassible, on the rear.#\n\nThey reach you.# Her look is hard, as she stares you in the eyes.# But soon she softens.#\nShe rolls her eyes and snorts: $R\"Oh, don't ask me why, I can't be mad at you.# Let's climb this thing.\"#\n\n$CYou can't help feeling relieved.",
        "childid": "5_512"
      },
      {
        "id": "5_99",
        "type": "Story",
        "recap": "falling",
        "text": "Your hand slips, losing grip.##\nThe stone under your foot crumbles.#\n\nYou hear Corolla screaming as you fall off the precipice.$d###\n\n\n-- GAME OVER --##\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, climber traveler.",
        "childid": "5_512"
      },
      {
        "id": "5_98",
        "type": "Story",
        "recap": "falling2",
        "text": "Your hand slips, losing grip.##\nThe stone under your foot crumbles.#\n\nYou hear Corolla screaming as you fall off the precipice.$d###\n\n\n-- GAME OVER --##\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, climber traveler.",
        "childid": "5_512"
      },
      {
        "id": "5_512",
        "type": "Choice",
        "text": "The sun keeps on going down, and light decreases.# You keep on climbing.#\nIn the back of your mind,# you ask yourself how will you be able to continue after sunset.#\n\nIt looks like you won't be able to rest,# not without plunging into the void.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_520"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_513"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_511"
          }
        ]
      },
      {
        "id": "5_511",
        "type": "Choice",
        "text": "You move safely to the next spot.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_512"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_510"
          }
        ]
      },
      {
        "id": "5_510",
        "type": "Choice",
        "text": "You reach the next foothold.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_530"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_511"
          }
        ]
      },
      {
        "id": "5_513",
        "type": "Choice",
        "text": "It looks like a dead end. You can only go back to where you came from.",
        "choices": [
          {
            "desc": "Move to the left.",
            "childid": "5_512"
          }
        ]
      },
      {
        "id": "5_520",
        "type": "Choice",
        "text": "You manage to get there. Now you can either:",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_532"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_521"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_512"
          }
        ]
      },
      {
        "id": "5_521",
        "type": "Choice",
        "text": "You slide here. What now?",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_543"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_520"
          }
        ]
      },
      {
        "id": "5_530",
        "type": "Choice",
        "text": "The way is partially obstructed here.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_531"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_510"
          }
        ]
      },
      {
        "id": "5_531",
        "type": "Choice",
        "text": "Where to go now?",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_541"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_530"
          }
        ]
      },
      {
        "id": "5_532",
        "type": "Choice",
        "text": "Two find yourself in a fissure, masses of rock to your right and left.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_542"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_520"
          }
        ]
      },
      {
        "id": "5_540",
        "type": "Choice",
        "text": "You reach the next spot.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_550"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_541"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_99"
          }
        ]
      },
      {
        "id": "5_541",
        "type": "You stop again. A massive boulder is hanging over your head.",
        "text": "desc.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_542"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_540"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_531"
          }
        ]
      },
      {
        "id": "5_542",
        "type": "Choice",
        "text": "You reach a new foothold. What now?",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_543"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_541"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_532"
          }
        ]
      },
      {
        "id": "5_543",
        "type": "Choice",
        "text": "After a while, choose again.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_552"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_544"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_542"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_521"
          }
        ]
      },
      {
        "id": "5_544",
        "type": "Choice",
        "text": "You can only move horizontally here, smooth rock over and beneath you.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_543"
          }
        ]
      },
      {
        "id": "5_550",
        "type": "Choice",
        "text": "Your reach a higher point. Where to move now?",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_99"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_540"
          }
        ]
      },
      {
        "id": "5_551",
        "type": "Choice",
        "text": "You reach the next spot. Now choose again.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_562"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_552"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_99"
          }
        ]
      },
      {
        "id": "5_552",
        "type": "Choice",
        "text": "You stop again. A huge smooth rock prevents you from going higher.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_553"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_551"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_543"
          }
        ]
      },
      {
        "id": "5_553",
        "type": "Choice",
        "text": "After a while, choose again.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_564"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_99"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_552"
          }
        ]
      },
      {
        "id": "5_560",
        "type": "Choice",
        "text": "You move sideways and reach a foothold. Which direction now?",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_561"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_99"
          }
        ]
      },
      {
        "id": "5_561",
        "type": "Choice",
        "text": "There is a solid stone ledge here. You look around for your next move.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_571"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_562"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_560"
          }
        ]
      },
      {
        "id": "5_562",
        "type": "Choice",
        "text": "You thankfully rest on a kind of natural balcony.#\n You have still some way to go,#\nbut at least you all can catch your breath,# while you look at the scenario lying at your feet.#\n\nNight has fallen on the desert plains.# You look at the moonlight shimmering over the rocky surface.#\nNo sign of artificial lights anywhere.##\n\nYou better keep moving.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_572"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_563"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_561"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_551"
          }
        ]
      },
      {
        "id": "5_563",
        "type": "Choice",
        "text": "You have only two options here.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_573"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_562"
          }
        ]
      },
      {
        "id": "5_564",
        "type": "Choice",
        "text": "This is a dead end. You need to go back.",
        "choices": [
          {
            "desc": "Descend a little.",
            "childid": "5_553"
          }
        ]
      },
      {
        "id": "5_570",
        "type": "Choice",
        "text": "You have only two options here.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_571"
          }
        ]
      },
      {
        "id": "5_571",
        "type": "Choice",
        "text": "You stop again. Choose the next direction.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_581"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_572"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_570"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_561"
          }
        ]
      },
      {
        "id": "5_572",
        "type": "Choice",
        "text": "Movement is blocked on the right side. Choose where to go now.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_582"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_571"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_562"
          }
        ]
      },
      {
        "id": "5_573",
        "type": "Choice",
        "text": "You stop again. Choose where to go now.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_98"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_563"
          }
        ]
      },
      {
        "id": "5_580",
        "type": "Choice",
        "text": "You have only two options here.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_590"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_581"
          }
        ]
      },
      {
        "id": "5_581",
        "type": "Choice",
        "text": "You stop again. Choose where to go now.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_591"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_582"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_580"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_571"
          }
        ]
      },
      {
        "id": "5_582",
        "type": "Choice",
        "text": "You stop again here. Choose where to go next.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_583"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_581"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_572"
          }
        ]
      },
      {
        "id": "5_583",
        "type": "Choice",
        "text": "You rest briefly on the next foothold.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_592"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_582"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_98"
          }
        ]
      },
      {
        "id": "5_590",
        "type": "Choice",
        "text": "You rest briefly on this foothold.",
        "choices": [
          {
            "desc": "Move to the right.",
            "childid": "5_591"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_98"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_580"
          }
        ]
      },
      {
        "id": "5_591",
        "type": "Choice",
        "text": "You stop again. Choose where to go now.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_5100"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_590"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_581"
          }
        ]
      },
      {
        "id": "5_592",
        "type": "Choice",
        "text": "You stop again here. Choose where to go next.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_5101"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_98"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_583"
          }
        ]
      },
      {
        "id": "5_5100",
        "type": "Choice",
        "text": "You rest briefly on this foothold.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_10"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_98"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_591"
          }
        ]
      },
      {
        "id": "5_5101",
        "type": "Choice",
        "text": "You stop again. Choose where to go now.",
        "choices": [
          {
            "desc": "Climb a little higher.",
            "childid": "5_10"
          },
          {
            "desc": "Move to the right.",
            "childid": "5_98"
          },
          {
            "desc": "Move to the left.",
            "childid": "5_98"
          },
          {
            "desc": "Descend a little.",
            "childid": "5_592"
          }
        ]
      },
      {
        "id": "5_10",
        "type": "Dialogue",
        "recap": "arrival",
        "text": "The rock wall ends abruptly,# like a neat, manmade step.# You fumble with your arm searching for grip,#\nthen you manage to hoist yourself up the stone floor.##\n\nYou all pant and gasp because of the effort (and the fear) after this night climbing.# It was a crazy idea indeed.##\n\nYou are still laying on the ground with your face down, when you start laughing.##\n\nAt first,# very quietly,# just chuckling.# Then,# louder and louder,# in a crescendo,#\nto the point you bend over with tears in your eyes.## It must be a nervous reaction.##\n\nThen you stop,# and a very weird echo starts mocking you.#\nIt goes on for about 30 seconds.##\nHearing those eerie sounds coming from the rocks around you,# Smiurl starts wailing,# in fear.#\n\n",
        "dialogues": [
          {
            "actor": "Smiurl",
            "line": "This place is haunted...! Alas! We are going to die for sure!"
          },
          {
            "actor": "Corolla",
            "line": "Knock it off Smiurl!",
            "comment": "But he does not seem to listen.",
            "break": true
          },
          {
            "precomment": "After few seconds,# while Smiurl is still whimpering,# odds, faint glares start dancing around you.#\nThey clothe that crevice's walls with grotesque figures and dreadful masks of living stone.",
            "actor": "Kriss",
            "line": "What's this sound?",
            "comment": "You ask as you start to hear a rattling, repetitive noise."
          },
          {
            "actor": "Corolla",
            "line": "That's Smiurl's teeth...",
            "comment": "She says with disapproval.# Is she actually so calm as she seems?"
          },
          {
            "actor": "Kriss",
            "line": "Smiurl, I am surprised at you..! I thought of you as a valiant warrior!#\nYou can engage a beast like Jeorghe,# yet you tremble in front of...# this?",
            "comment": "\nYou point somewhere around you.# You try to calm him down,# worried that his terror might spread to you and the others."
          },
          {
            "actor": "Smiurl",
            "precomment": "He answers, trying not to bite his own tongue:",
            "line": "One thing is fighting with men or animals, quite another is to face a phantom!#\nAnd this place looks like it's crawling with them!",
            "comment": "He's even more scared now.#\nHe spoke in an increasingly shrieking voice,# pointing at the lights increasing in intensity around you."
          },
          {
            "actor": "Kriss",
            "precomment": "You look around anxiously,# when you finally notice Theo:#\nhe's stoic as always,# as he was peacefully sitting in his tent.",
            "line": "What do we do?",
            "comment": "You ask him, nervously."
          },
          {
            "actor": "Theo",
            "precomment": "He points somewhere in front of him, on the left side, and says:",
            "line": "Be patient.# If I'm right, we should meet Smiurl's phantom in seconds...",
            "childid": "5_11"
          }
        ]
      },
      {
        "id": "5_11",
        "type": "Story",
        "recap": "Math welcomes",
        "text": "You turn around,# trying to distinguish something in that unrelentless dance of lights and shadows.#\nIt keeps on increasing in intensity:# you can now see clearly the stone balcony you are resting on,#\nbordered by the void of the precipice,# beyond a thin line of darkness.#\n\nTheo's prediction proves to be right:# the light does come from that direction.##\n\nAnd after few seconds,# suddenly,# from behind a rock,##\na man appears,# torch in his hand,# startling all of you, excepted Theo of course.#\n\nHe's wearing a long white robe.# His skin looks dark, his hair is short, curly and black.#\n\nHe starts speaking, saying:#\n\n$m\"Hello Smiurl,# Kriss,# Corolla# and Theo,# and welcome.#\nYou were waited here at Seer's Rock.#\nPlease,# if you would like to follow me through the passage...#\nMy name is Math.\"##$C He concludes with a half bow.##\n\nYou all stay there,# diversely petrified.#\n\nAfter many seconds of the newcomner Math silent,# smiling waiting,# all you say is:###\n\n$c\"Hi...\"##",
        "childid": "6_01"
      }
    ],
    [
      {
        "id": "6_01",
        "type": "Story",
        "recap": "Into the rock",
        "text": "-------------------------------\n|          CHAPTER 7          |\n-------------------------------\n\n\n#You are walking behind Math in a single line.# He is leading you somewhere only he knows,#\nthrough a narrow, twisting trail carved into the rock.#\nQuite often it becomes a tunnel and sometimes you have to lower your head.#\nIt steadily goes uphill,# and after a half hour,# you are wheezing again.##\n\n$R\"Seer's Rock...\"#$C Corolla mumbles.# $R\"Do you know something about it?\"$C#\nTheo shakes his head.##\n\n$c\"Why don't we ask him...?\"#$C you propose.##\n\n$Y\"I don't trust him!# This place is cursed!# We won't get out of here alive!\"#$C Smiurl starts whining again.##\n\nSeemingly deaf to your conversation, Math keeps on leading you forward.#\n\n$m\"Please, this way.\"#$C He says at every junction.##\n\nAfter an hour or so,# climbing into the rock,# the trail suddenly ends,#\nrevealing a surprising scene.",
        "childid": "6_02"
      },
      {
        "id": "6_02",
        "type": "Action",
        "recap": "the village in the rock",
        "text": "You just entered a wide cavity that must lie at the top of the spire.#\nIt looks a bit like the mouth of a volcano,# with you standing at its base.#\n\nThere are plenty of houses,# and streets and pathways and suspended walkways.#\n\nCountless little openings dot the rocky walls, leading who knows where.",
        "actions": [
          {
            "verbs": [
              { "term": "look" },
              { "term": "watch" },
              { "term": "observe" }
            ],
            "answer": "Gentle lights illuminate the main roads.# Many other lights peeks out the windows of the dwellings.#\nThose houses have a similar shape:# round earthen walls covered by an hemispheric dome made of something like straw.##\n\nYou feel odd,# as if somebody is watching you."
          },
          {
            "verbs": [
              { "term": "listen" }
            ],
            "answer": "You follow Math silently.# Your steps resonate on the stone.##\n\nAll is quiet,# but the air seems to be permeated with a subtle...# $csinging?##$y\nAt the very edge of your hearing threshold,# you think of hearing a melodic whispering,#\nmany voices yet no voice at all,# coming and going like they were carried around by the shifting movement of the air. "
          },
          {
            "verbs": [
              { "term": "walk" },
              { "term": "follow" }
            ],
            "answer": "The lights along the main road are huge torches,# emanating a noticeable warmth along with light.#\nSparkles ascend,# carried by the warm air,# dancing around and then extinguishing in the dark.#\n\nYou start to notice some dwellers showing themselves,#\nsome along the streets,# others looking out the windows.#\nAll of them are observing you with the same moderate interest.##\n\nAfter a while,# you stop at the base of a little hill,# or mound.",
            "childid": "6_03"
          }
        ]
      },
      {
        "id": "6_03",
        "type": "Choice",
        "recap": "Elder's hut",
        "text": "$m\"This is the Elder's house, the wise Long.# He is expecting you.\"$C#\n\nAll of you look at Math repeatedly.#\nAfter few instants you realise he is inviting you to enter.#\n\nSo this must be the one in command of this place,# or something like that,# you think.",
        "choices": [
          {
            "desc": "You followed Math so far. Now, get inside that house? Why not?",
            "childid": "6_06"
          },
          {
            "desc": "Are you supposed to just comply? Let's go exploring this place instead.",
            "childid": "6_04"
          }
        ]
      },
      {
        "id": "6_04",
        "type": "Story",
        "recap": "walking in circle",
        "text": "Without further notice,# you turn your back to Math,# nodding briefly to Corolla,# and start walking.#\n\nThe others hesitate just a little,# then start to following you.#\nMath does not seem to care.#\n\n$R\"Hey where are you going now?\"#$C Corolla whispers to you from behind your back.#\nYou don't know why, but you feel compelled to whisper as well when you answer:#\n\n$c\"I just want to take a look around...\"#$C You have the impression she wants to answer something,#\nbut she just sighs as you all keep walking.##\n\nThe scenery is pretty boring after a while.#\nThe apparently chaotic network of little streets, passageways,#\nbuildings ranging from little huts to big houses like the Elder's one,#\nafter few minutes everything seems to just repeat itself.#\nYou don't meet anyone, and with the passing of time you start to feel a bit...# stupid?#\n\nAnyway, all of a sudden, after a bend you see Math again.# Has he come in search of you?##\n\nSoon you realise he's still standing in the very same spot,# smiling at you guys.#\n\nSomehow you walked in a circle, returning right where you started.",
        "childid": "6_05"
      },
      {
        "id": "6_05",
        "type": "Choice",
        "recap": "walking in circle",
        "text": "Math looks at you as if nothing happened,#\nlike it's perfectly natural to stand still there and keep on staring at you.#\n\nFunnily, you don't know if you should feel more angry or more embarrassed.",
        "choices": [
          {
            "desc": "No point in wasting more time... Let's see who this geezer is and what he has to say.",
            "childid": "6_06"
          },
          {
            "desc": "No way! You'll show them... Just keep moving!",
            "childid": "6_08"
          }
        ]
      },
      {
        "id": "6_08",
        "type": "Story",
        "recap": "still walking in circle",
        "text": "You keep your stride and move towards what looks like a new direction.#\nYou can hear the others murmuring,# yet they keep on following you.#\n\nYou soon discover that the scenery goes back to repeating itself.#\nAnd right when you think you're about to turn into an unexplored alley,# you find him still there waiting for you.#\n\nMath is still there, looking at you as if nothing happened.#\n\nAnd,# again,# you don't know if you should feel more angry or more embarrassed.##\n\nSome kind of trick has to be involved in this...#\n\nIt looks like you'll just have to do as you're told.",
        "childid": "6_06"
      },
      {
        "id": "6_06",
        "type": "Story",
        "recap": "at Elder's",
        "text": "$c\"Whoever this 'Elder' is,# at least he will be able to tell us how to get back down safely...\"$C#\nYou conciliatory say,# almost talking to yourself.#\n\n$c\"...maybe he will be able to tell us about the reason we climbed up here in the first place...\"#$C You add, half aloud.##\n\n$R\"I have to say, it's not that much of a house...# It looks like they don't care about hierarchy.\"#\n\n$CA feeble,# flickering light comes from inside the house,# like the light of candles.#\n\nSuddenly, you all hear a warm and firm voice inviting you:#\n\n$M<<Please, get inside>>##\n\n$CIt sounded like it came just from the midst of you.# You exchange some puzzled looks.#\nSmiurl is crouching on the ground,# shoulders to the door.##\n\nIn the end, Theo decides for everybody and steps inside,# opening with ease the light, creaky door.",
        "childid": "6_07"
      },
      {
        "id": "6_07",
        "type": "Story",
        "recap": "entering",
        "text": "You find yourself in a narrow corridor,# its walls made of something resembling bamboo wood.#\nBetween the shadows,# you get glimpses of small pieces of furniture,# with many little objects on them.##\n\nThe light appears to be coming from the end of the passage.#\nIt does not look like it's coming from a candle anymore.#\nIt's bluish one moment,# greenish the next one...##\n\nYou all walk behind Theo.# You feel like you can hear Smiurl trembling behind you.#\n\nYou feel a weird sense of unreality.#\nYou catch yourself convulsively squeezing the hilt oh your sword.##\n\n$c<<It's an instinctive reaction.>># $C You think.#\n\n$c<<I don't even know how to use it.>># $C You think.##\n\nSuddenly,# the corridor ends around Theo's silhouette,#\nand the light suddenly lowers, going back to a more natural candlelight.#\n\nYou see an old man sitting on an armchair,# his back turned on you.#\nYou can understand he's old because of the silver mane flowing down on his shoulders.#\n\nHe slowly turns around, and,# in the same voice you heard outside, he says:#\n\n$M\"Have a seat please.# I've just finished brewing some tea\"",
        "childid": "6_09"
      },
      {
        "id": "6_09",
        "type": "Dialogue",
        "recap": "talk with Long",
        "dialogues": [
          {
            "precomment": "You are the first one to comply.# You feel you can trust that old man.#\nReading your thoughts,# the Elder looks at you and says:",
            "actor": "Elder",
            "istelepathy": true,
            "line": "Be careful, young man.# Never give your complete trust so easily...#\nJust because I'm old,# it doesn't necessarily mean you have nothing to fear.",
            "comment": "\nYou hear his voice,# yet he hasn't opened his mouth to speak.# He just stared at you.#\nHis words spring up directly in your mind.# You can't believe it.#\nYou remain silent,# staring at him,# sitting in your little wicker armchair,# mouth half-open."
          },
          {
            "precomment": "Smiurl notices it, and shakes out of silence:",
            "actor": "Smiurl",
            "line": "He's ipnotising him!# Help!# Help!",
            "comment": "He tries to run away.#\nThe Elder glances at Theo,# whom extends his arm,# grabbing the little guy by his collar,#\nthen lifting him from the ground,# all without taking his eyes off the old man stare."
          },
          {
            "precomment": "Then the Elder look at Smiurl,# and adds smiling warmly:",
            "actor": "Elder",
            "line": "Be quiet,# little Smiurl.# No harm will come to you.",
            "comment": "Surprisingly enough,# Smiurl seems to accept that reassurance.#\nApparently,# he doesn't even notice he has been called by name without anybody introducing him first."
          },
          {
            "precomment": "Corolla sits next to you,# dragging along Smiurl as well.#\nTheo remains standing.",
            "replies": [
              {
                "line": "You all want to know what place is this.",
                "childId": "6_10"
              },
              {
                "line": "What is the real reason you are here?",
                "childId": "6_11"
              }
            ]
          }
        ]
      },
      {
        "id": "6_10",
        "type": "Dialogue",
        "recap": "what is this rock",
        "dialogues": [
          {
            "actor": "Corolla",
            "line": "Dear Elder,# where are we?"
          },
          {
            "actor": "Elder",
            "precomment": "He observes with a gently amused expression the glare in her eyes.#\nThen,# chuckling,# getting comfortable in his seat,# he answers:",
            "line": "Said and done: welcome to Seer's Rock."
          },
          {
            "actor": "Theo",
            "precomment": "Theo sighs.# Then he says:",
            "line": "This we know... Math.",
            "comment": "He nods to the outside."
          },
          {
            "actor": "Elder",
            "line": "Well,# actually,# there's no need to add anything else.",
            "comment": "He says with his mouth shut.",
            "isTelepathy": true
          },
          {
            "actor": "Kriss",
            "precomment": "You are getting used to this.# You answer aloud right away:",
            "line": "But...# What does that mean?"
          },
          {
            "actor": "Elder",
            "line": "Oh,# I beg your pardon!# I think aloud all the time!",
            "comment": "He exclaims."
          },
          {
            "actor": "Elder",
            "line": "Yes, yes,# I see you do not know the history of this place.# Let me tell it for you.",
            "comment": "\n\nAfter this,# he takes a breath,# then starts talking.",
            "childid": "6_12"
          }
        ]
      },
      {
        "id": "6_11",
        "type": "Dialogue",
        "recap": "why are we here",
        "dialogues": [
          {
            "actor": "Elder",
            "line": "I had you brought here,# because you know,# we were expecting you.",
            "comment": "The Elder says."
          },
          {
            "actor": "Kriss",
            "line": "Can you see who traverses the desert from up here?"
          },
          {
            "actor": "Elder",
            "line": "Of course..!",
            "comment": "And he looks somewhere in the distance in front of him, for a few moments.#\n\nThen he changes expression abruptly:"
          },
          {
            "actor": "Elder",
            "line": "But no, no!# You fool,# we have been waiting for centuries!# I mean...",
            "comment": "He adjusts his position,#\nsettling more comfortably on his armchair,# as he proceeds to clarify:"
          },
          {
            "actor": "Elder",
            "line": "Few years ago,# right after I was elected Elder,# I was studying the memories of The Master himself.#\nThis happened only lately because the Underground Library is only accessible to the Elders.#\nAnyway,# I came across the description of a weird dream or vision.#\nThe details are not clear,# but few things are unmistakable:#\na wonderful, gold-haired girl,# in a halo of light,# gave a message to The Master.#\nHe then arranged for it to be passed down in time from Elder to Elder.#\nI read in those memories about the very day and place where a group of visitors would have appeared.#\nAnd the group would have consisted of a $cyoung man$M,# a $Ydwarf$M,# a $Btall man$M,# and a $Rwoman$M\".##\n\n\"To be honest,# it reminds me of an Earthers' legend...",
            "comment": "His voice fades and he starts to space out again.#\nThen he comes back to here and now and says:"
          },
          {
            "actor": "Elder",
            "line": "Well,# now it's clear the message is about you,# today,# and here.#\nThe Master commanded to give you hospitality and to assist you,#\nand you can be sure we will carry out our duty!",
            "childid": "6_13"
          }
        ]
      },
      {
        "id": "6_12",
        "type": "Story",
        "recap": "the story of the rock",
        "text": "He tells you that this place owes its name to its founder,# a man called 'The Seer',# or 'The Master'.#\nHe was the last of the psychic scholars living on Noi-Hert.#\n\nA few decades after the Earthers' abandonment,# being on the run,# he sought refuge from the unrest here.#\nAnd he found shelter indeed,# at the top of this narrow yet superb spike of stone,#\nwhich stands lonely in the middle of the Great Desert.#\n\nSafe from the hordes' attacks,# he set up a community which in time continued to teach the psychic arts to its members.#\nUp to this day,# they live simple lives:#\nthey use to farm a few exemplars of an animal species with a thick skin which uses to roam the desert in small herds.\nThey also grow a herb or cereal that can grow anywhere it finds a handful of soil,#\nfrom which they obtain a weird,# fine flour.#\n\nThe water need is met by a well at the bottom of a pit in the middle of the spire,#\nwhich goes down several kilometers and reaches deep underground# (at least this is what the Elder claims).#\n\nThe eldest and most skilled telepath between them is appointed as 'Elder Telepath',# or just 'Elder'.#\nThat title rewpresents the authority in the village.#\nAnyway# (as the Elder claims)# the election of an Elder is a sporadic event,#\nsince they have an average life span of 200 years.##\n\nThen the old man falls silent,# and goes back to sip his tea.",
        "childid": "6_13"
      },
      {
        "id": "6_13",
        "type": "Choice",
        "recap": "asking the elder",
        "text": "The Elder falls silent,# going back to sipping his tea,# with evident satisfaction.#\n\nYou look at him as he smiles,#\nand as he apparently absent-mindedly casts his eyes as looking at a distant,# far away landscape only he can see.#\n\nIt looks like he does not notice you anymore,#\nor like he does not care anymore you are still there.",
        "choices": [
          {
            "desc": "You all want to know what place is this.",
            "childid": "6_12"
          },
          {
            "desc": "What is the real reason you are here?",
            "unhide": "2",
            "childId": "6_11"
          },
          {
            "desc": "A prophecy? A golden-haired... 'fairy'? Come on... What would we be supposed to do?",
            "condition": {
              "type": "isNodeVisited",
              "item": "6_11",
              "value": true
            },
            "childId": "6_14"
          }
        ]
      },
      {
        "id": "6_14",
        "type": "Story",
        "recap": "end of questions",
        "text": "The Elder prevents all of you from making any other question with a simple gesture of his hand.#\nHe then stands up,# and says:#\n\n$M\"You sure are tired.# Math,# please take them to their designed accommodation.\"#\n\n$CMath appears,# seemingly out of thin air,# emerging from the shadows of the corridor.#\n\nYou follow him outside,# then you all walk quietly to one of the many houses in the surroundings.#\nHe tells you that a certain young woman named Efeliah left it free for you.#\n\nAs you enter the house,# suddenly exhaustion hits you hard as stone.#\nYou collapse on one of the beds,# unable to notice anything around you.#\nThe only thing you are vaguely aware of is the thankfulness you feel for this girl who owns this place...##\n\nYour consciousness slips away in a rush,#\nas you fall deeply asleep on what feels like the most comfortable bed you've ever layed on.",
        "childid": "6_15"
      },
      {
        "id": "6_15",
        "type": "Dialogue",
        "recap": "wake up at Efeliah's",
        "text": "###You get waken up by the noise of activity in the village.#\nYou feel rested,# but still a bit groggy.#\n\nLight comes through the windows,# you have no idea what time it is or how long you've been asleep.#\nSmiurl seems to be awake,# sitting on a tidy bed,# fully dressed.#\n\n",
        "dialogues": [
          {
            "actor": "Kriss",
            "line": "What time is it..?",
            "comment": "You mumble slurring."
          },
          {
            "actor": "Smiurl",
            "line": "The sun is quite high... I think it's past midday.",
            "comment": "He shrugs his shoulders."
          },
          {
            "precomment": "He must be thinking you need the toilet:# he points to one of the doors and clarifies:",
            "actor": "Smiurl",
            "line": "Theo is in the bathroom."
          },
          {
            "precomment": "At that sound,# the mound of blankets on a bed on the other side of the room comes to life.",
            "actor": "Corolla",
            "line": "My turn first!",
            "comment": "You hear Corolla's muffled voice from underneath the pile of bedsheets.# She immediately adds:"
          },
          {
            "actor": "Corolla",
            "line": "...I'm starving...!",
            "comment": "You can't help chuckling,# hearing her tone.#\n\nBut then you become suddenly aware of your own stomach.#\nAt that,# you also start noticing the smell of food (roasted meet) in the air.#\n\nYou start salivating vigorously.",
            "childid": "6_16"
          }
        ]
      },
      {
        "id": "6_16",
        "type": "Dialogue",
        "recap": "wake up at Efeliah's 2",
        "text": "Someone knocks at the door.#\nMath does not wait for your answer,# and just utters from behind the door:#\n\n",
        "dialogues": [
          {
            "actor": "Math",
            "line": "Goodmorning friends!# Feel free to come outside whenever you are ready."
          },
          {
            "precomment": "In the meantime,# Theo comes out the bathroom,# he has been showering or something.#\nHis wet hair is untied,# and he's wearing only a pair of shorts;#\nyou can observe and possibly envy the impressive muscles on his chest.",
            "actor": "Theo",
            "line": "Meal is almost ready",
            "comment": "He announces,# as he rubs his face with the towel hanging from his neck."
          },
          {
            "actor": "Corolla",
            "line": "Let's not leave our hosts waiting for us...",
            "comment": "Corolla crawls out of bed,# and enters the bathroom.#\nShe's wearing just her shirt.# Her legs are quite muscular and good-looking,# and you notice several scars on them.##\n\nThen the door slams.##\n\nAll you can do now is waiting your turn.",
            "childid": "6_17"
          }
        ]
      },
      {
        "id": "6_17",
        "type": "Dialogue",
        "recap": "before the party",
        "text": "The room you slept in is very simple,# and constitutes the majority of the humble house.#\nIt looks like they brought in extra beds in order to provide you with that improvised common room.##\n\nWhen all of you are ready,# you go outside to meet Math.# A young woman is standing next to him.#\n\n",
        "dialogues": [
          {
            "actor": "Math",
            "line": "Goodmorning.# I hope you rested well."
          },
          {
            "precomment": "Corolla smiles and answers,# bowing slightly:",
            "actor": "Corolla",
            "line": "Naturally.# Your hospitality is delightful."
          },
          {
            "actor": "Math",
            "line": "Let me introduce to you Efeliah.# She offered her house for you.",
            "comment": "He adds after reciprocating the courtesy."
          },
          {
            "precomment": "She steps forward.# She's slightly taller than Corolla.# You start noticing how in the village everybody is quite tall.#\nShe has wavy, platinum blonde hair,# flowing down to her shoulder blades.#\nHer eyes are $ggreen$C,# a very light, pale green.# And very beautiful too.#\nLike everybody else around them,# she's wearing a simple, plain tunic,# made with a light-coloured fabric.",
            "actor": "Efeliah",
            "line": "It is my pleasure to welcome you,# on behalf of the whole village.",
            "comment": "Another bow."
          },
          {
            "actor": "Efeliah",
            "line": "Now,# if you don't mind following me,# the banquet is waiting for you,# not to mention how hungry you must be...",
            "comment": "\nShe pauses,# intently looking at each one of you,# squinting her eyes.## Then she continues:"
          },
          {
            "actor": "Efeliah",
            "line": "...I see the last time you ate was yesterday morning...# Please come this way.",
            "comment": "She concludes,#\ninviting you to follow her once more with a gesture of her hand.# You happily comply.",
            "childid": "6_18"
          }
        ]
      },
      {
        "id": "6_18",
        "type": "Dialogue",
        "recap": "going to the party",
        "text": "Efeliah takes you under her arm.# Her hand is warm,# and you can smell her natural scent.#\n\n",
        "dialogues": [
          {
            "actor": "Efeliah",
            "line": "Tonight the Elder is going to give a speech.",
            "comment": "She says."
          },
          {
            "actor": "Kriss",
            "line": "What about?",
            "comment": "You muster to ask back."
          },
          {
            "actor": "Math",
            "line": "I believe he wants to surprise you.",
            "comment": "You aren't sure of it,# but you feel like Math is trying to suppress a smile.#\nOn top of that,# over his words you can distinctly hear his voice saying,# or rather thinking:"
          },
          {
            "actor": "Math",
            "line": "...about you/us...",
            "comment": "You instinctively turn around,# looking puzzled at your friends.",
            "istelepathy": true
          },
          {
            "actor": "Corolla",
            "line": "Everything okay?"
          },
          {
            "actor": "Kriss",
            "line": "Erm... Yeah,# I suppose so...",
            "comment": "You smile,# slightly embarrassed.#\nYou look away,# and you notice the Elder's house.# He's watching out the window.#\nYou feel like he's looking right at you."
          },
          {
            "actor": "Elder",
            "line": "Indeed.",
            "comment": "He answers your thoughts with his usal 'voice'.# You wonder if you could ever get used to it.",
            "istelepathy": true
          },
          {
            "actor": "Kriss",
            "line": "Why do I worry?# Not that I dislike these guys...# But sooner or later we'll leave this place...",
            "istelepathy": true
          },
          {
            "actor": "Elder",
            "line": "I wouldn't be so sure of many things...",
            "istelepathy": true,
            "comment": "He answers into your mind once again.#\nYou quickly glance at his place,# resentfully.# It looks like he's retracted inside the house.#\n\nYou continue walking,# Efeliah still at your arm.",
            "childid": "6_19"
          }
        ]
      },
      {
        "id": "6_19",
        "recap": "party and the party",
        "type": "Action",
        "text": "You reach the central square of the village.# As you walk,# every single person you see either greets you all,#\nor smiles,# or bows slightly,# or a combination of the three.# You start to feel embarrassed.#\n\nFinally, you reach the square.# It is modest,# but quite spacious for the local standards.#\nTorches have been lit and placed all around.# In the middle,# a huge brazier with a massive grill on it.#\nAnd some even more massive pieces of meat are placed on it,# roasting invitingly,#\nthe fat dripping and crackling when it touches the flames.#\n\nOn the right side,# a long table with many chairs has been prepared.#\nOn the left,# a kiosk has been set up,# with many drinks and some people to serve them.#\n\nOn the opposite side in front of you,# you see a kind of wooden podium.#\n\nThere are so many things you want to ask.",
        "altText": "You are still in the square with the others.# As time passes,# more people are joining you.#\nAfter all the care received,# Smiurl seems calmer.# He's even starting conversations with some of your hosts.#\n\nThe Elder still hasn't shown up.#\nIt seems you have some more time to enjoy the party.",
        "actions": [
          {
            "verbs": [
              { "term": "ask" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "food" },
                  { "term": "meat" },
                  { "term": "table" }
                ],
                "answer": "$m\"The cooks are giving the best of themselves tonight.# Special courses are being prepared for you guys.\"$y"
              },
              {
                "objs": [
                  { "term": "drinks" },
                  { "term": "drink" },
                  { "term": "kiosk" }
                ],
                "answer": "$g\"Please, have a drink before anything else.# I'm sure you'll be surpised!\"$y"
              },
              {
                "objs": [
                  { "term": "podium" }
                ],
                "answer": "That must be where official announcements are made.# It looks small and modest like everything else.#\nThe Elder will surely climb those wooden steps soon."
              },
              {
                "objs": [
                  { "term": "mind" },
                  { "term": "powers" },
                  { "term": "psychic" },
                  { "term": "telepathy" },
                  { "term": "read" },
                  { "term": "thinking" },
                  { "term": "thoughts" },
                  { "term": "explanations" },
                  { "term": "explanation" }
                ],
                "childid": "6_20"
              }
            ],
            "answer": "You all stand there quietly.# It looks like there is still time before the meal.# You should take advantage now to ask some questions.# These guys TALK WITH THEIR MINDS.# How's that possible??"
          },
          {
            "verbs": [
              { "term": "eat" }
            ],
            "objects": [
              {
                "objs": [
                  { "term": "food" },
                  { "term": "meat" },
                  { "term": "table" }
                ],
                "condition": {
                  "item": "partyDrank",
                  "value": true,
                  "refusal": "Food is not yet being served.# Maybe I could have something to drink in the meantime."
                },
                "effect": {
                  "item": "partyFed",
                  "value": true
                },
                "childid": "6_22"
              }
            ]
          },
          {
            "verbs": [
              { "term": "drink" },
              { "term": "drinks" }
            ],
            "effect": {
              "item": "partyDrank",
              "value": true
            },
            "childid": "6_21"
          },
          {
            "verbs": [
              { "term": "wait" }
            ],
            "condition": {
              "item": "partyFed",
              "value": true,
              "refusal": "I should honor our hosts enjoying what has been prepared for us."
            },
            "childid": "6_22"
          }
        ]
      },
      {
        "id": "6_20",
        "recap": "telepathy explained",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "Smiurl must have had the same idea,# as you hear him asking:",
            "actor": "Smiurl",
            "line": "How can you guys make thoughts speak?# What spells do you use?"
          },
          {
            "precomment": "Math chuckles heartily.# He starts explaining with a smile:",
            "actor": "Math",
            "line": "It's not magic..!# As the Master teaches:# 'telepathy is an innate faculty of human minds',# dormant at birth.#\nAnd like any other skill,# it requires excercise,# effort,# and study."
          },
          {
            "precomment": "He has taken on a more solemn expression.# Smiurl is definitely incredulous.",
            "actor": "Math",
            "line": "You see,# when you think of something,# when you speak,# anytime you do something,# even when you sleep,#\ninside your brain millions of chemical reaction take place.# Each of them has a certain 'energy signature'.#\nA trained mind is able to catch and discern the meaning of these emissions,# that's all..."
          },
          {
            "actor": "Math",
            "line": "These signals exists especially in specific dimensions of this universe;#\ninside 'classic' spacetime,# they are very weak and get overshadowed by natural radiation.",
            "comment": "##\n\nYou are fascinated by his explanation.# He sounds exactly like one of the characters in the sci-fi books you use to read.#\nBack home,# on Earth.##\n\nAs you experience that painful thought,# Math and Efeliah turn suddenly towards you,#\nas if they heard a loud noise.##\n\nYou smile.# Maybe you do can get used to this.",
            "childid": "6_19"
          }
        ]
      },
      {
        "id": "6_21",
        "recap": "let's drink like on earth",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "You go to the drinks kiosk.# A smiling guy welcomes you:",
            "actor": "Person",
            "line": "What would you like to try?"
          },
          {
            "actor": "Corolla",
            "line": "Not sure... What do you suggest?",
            "comment": "Corolla answers first."
          },
          {
            "actor": "Person",
            "line": "I promise, everything you see is delicious.#\nAnyway,# what I like the most are these cocktails with Pinzerro flavoured Martee'nee."
          },
          {
            "actor": "Kriss",
            "line": "What did you just said??# 'Martini'?",
            "comment": "You exclaim surprised."
          },
          {
            "actor": "Person",
            "line": "Yes,# it's an old recipe,# but..."
          },
          {
            "actor": "Kriss",
            "line": "Incredible...",
            "comment": "The first link with your world and this,# is booze.# Corolla looks at you puzzled."
          },
          {
            "actor": "Kriss",
            "istelepathy": true,
            "line": "I wonder how do they obtain it...",
            "comment": "You think to yourself."
          },
          {
            "actor": "Corolla",
            "line": "We'll take two of those then, please!",
            "comment": "She then looks back at you.# You smile reassuringly,# coming back to present.#\n\nThe drink is actually extremely good.# You can't pinpoint the exact taste of it,#\nbut it could totally be one in the infinite number of cocktails from Earth.#\n\nYour spirits are a little higher now...",
            "childid": "6_19"
          }
        ]
      },
      {
        "id": "6_22",
        "recap": "let's eat like on earth",
        "type": "Dialogue",
        "dialogues": [
          {
            "precomment": "As you approach the long table,# you are invited to take a seat around the head of the table,#\nwhere in the meantime the Elder went to sit.#\n\nAs soon as you are all ready,# a waiter arrives with the first course.",
            "actor": "Person",
            "line": "This is for Mr. Smiurl."
          },
          {
            "precomment": "He put down a silvery plate on the table in front of the dwarf.#\nThen he uncovers it for him,# and Smiurl literally burst out with a flash of delight.#\nHe can't even wait and instantly put a finger into the reddish sauce to get a taste:",
            "actor": "Smiurl",
            "line": "Sand-fruit with scrambled Croeggs!# Mmmmm...# So delightful!# And this is true Ghermina Sauce!"
          },
          {
            "precomment": "You stare at him, marveled.# As Smiurl keeps eating,# he keeps on lighting up like a firefly,#\ngoing from $Yyellow$C to $Bblue$C, $Yinter$Bmitten$Ytly$C.##\n\nThen comes your turn.# Another plate is put in front of you.# For a second,# you try peek at its contents,#\nbut soon it gets uncovered by the waiter, as he announces:",
            "actor": "Person",
            "line": "For Mr. Kriss, 'Earthers' Steaks'",
            "comment": "From his tone,# you understand they must be proud of their creation.#\nAnd,# you have to admnit,# it does look familiar.#\nIt could be something you use to eat with your family and friends around your barbecue.#\n\nSuddenly,# you are struck by melancholy again.# You haven't even had the time to think about or miss home.#\nThe place you left only about three days ago.",
            "break": true
          },
          {
            "precomment": "Math notices your thoughts,# not just your expression,# and brings you back by asking:",
            "actor": "Math",
            "line": "Something's wrong?# You can't eat this food?"
          },
          {
            "actor": "Kriss",
            "line": "No,# not at all...# I am sure it's excellent..."
          },
          {
            "precomment": "Then you grab what must be the local version of a fork,# and stab a huge,# juicy piece of meat.#\nYou stuff it in your mouth,# chewing energetically.##\nAfter few seconds,# you look at Math and the waiter again,#\ndoing your best in an attempt to smile with your mouth still full,# then venturing to say:",
            "actor": "Kriss",
            "line": "...HAB-FO-LUTELY..!",
            "comment": "#And,# at that,# everybody bursts out laughing,# including Theo and the Elder.###\n\nThe rest of the dinner goes smoothly,# sharing jokes and tales with each other.#\n\nAfter a while,# you all stand up again,# while conversations continue.#\n\nThen the Elder climbs up the little podium,# so everybody falls quiet,# waiting for his speech.",
            "childid": "6_23"
          }
        ]
      },
      {
        "id": "6_23",
        "recap": "more friends",
        "type": "Dialogue",
        "dialogues": [
          {
            "actor": "Elder",
            "line": "Hello you all again,# friends and guests.",
            "comment": "The Elder starts abruptly.# He's talking normally,# in a quiet voice,#\nand he's irradiating his verbal thoughts at the same time.# A weird 'stereo' broadcasting.#\nThere's people in the distance following his speech from the windows of their houses, after all.#"
          },
          {
            "actor": "Elder",
            "precomment": "He then tells everybody the same story you already heard,# only with many more details.#\nThe secret mission the Master left for them,# long time ago...##\n\nYou get a bit distracted hearing all of that once more.# Your eyes wonder and you watch the sky.#\nYou see the moon,# well,# 'A' moon.# You realise it's the first time you see it:#\na thin scythe,# a different shade from the Earth's moon,# and a little bigger.#\nYou didn't notice it was already dark;# you were distracted before,#\nhence you could not see the night smuggling off the sun,# again.##\n\nYou go back to listening to the Elder,# and what he says now surprises you,# to say the least:",
            "line": "...to better fulfill our obligation,# and to ensure the success and safety of our guests,#\ntwo of us volounteered to escort them...# In order to meet their fate.",
            "comment": "He waves his hand briefly at you all.#\n\nAs he falls silent for a little,# you look at Math and Efeliah.# They are smiling.##\n\nTheo grunts a little,# expressing something that must lie more or less halfway between approval and doubt.##\n\nSmiurl lights up,# maybe with excitement,# maybe in fear. ",
            "break": true
          },
          {
            "actor": "Elder",
            "line": "I thereby officially entrust this mission to Math Fraimann and Efeliah Amas.#\nThey will go with Kriss, Corolla, Theo and Smiurl,# wherever our guests will want,# or need."
          },
          {
            "actor": "Corolla",
            "precomment": "The Elder bows,# signaling the end of his speech.# A murmur of voices and thoughts rises.#\nEfeliah and Math turn towards you guys smiling.# Corolla smiles back and says:",
            "line": "We are truly honored.# First the hospitality,# then this...",
            "comment": "She waves her hand referring to what just happened."
          },
          {
            "actor": "Corolla",
            "line": "Are you sure you want to do this?",
            "comment": "From her thoughts seeps out:#\n\n$R<<If I were in your shoes, I would think it twice...!>>$C"
          },
          {
            "actor": "Efeliah",
            "line": "No need to worry about that Corolla,# I can assure you we did think it through."
          },
          {
            "precomment": "Hearing that,# Corolla gets more serious,# and adds, bowing slightly in the manner of your hosts:",
            "actor": "Corolla",
            "line": "Then we are pleased to welcome you.",
            "childid": "7_01"
          }
        ]
      }
    ],
    [
      {
        "id": "7_01",
        "type": "Dialogue",
        "recap": "il sentiero...",
        "dialogues": [
          {
            "precomment": "-------------------------------\n|          CHAPTER 8          |\n-------------------------------\n\n#",
            "actor": "Kriss",
            "line": "Hey...# Not bad this hidden path huh?",
            "comment": "You try not to yawn.# They awoke you at dawn to leave the Seer's Rock.#\nHearing your words,# Theo grunts in agreement."
          },
          {
            "actor": "Corolla",
            "line": "Knowing this way before,# we wouldn't have risked our necks climbing that freaking wall..."
          },
          {
            "actor": "Math",
            "precomment": "You are climbing down treading safely another rock-enclosed path.",
            "line": "Of course...# You showed a lot of guts.# I would never dare doing such a thing."
          },
          {
            "actor": "Corolla",
            "line": "You can believe me:# neither would we.# It was because of him...",
            "comment": "She points at you."
          },
          {
            "actor": "Kriss",
            "line": "Heh!",
            "comment": "You smile embarrassed,# hand on the back of your neck."
          },
          {
            "actor": "Corolla",
            "line": "He was the one who wanted to climb,# by all means.# As for us,# we could not let him go alone,# could we?"
          },
          {
            "actor": "Efeliah",
            "line": "By all means..?",
            "comment": "Efeliah repeats,# questioning you with her eyes.",
            "replies": [
              {
                "line": "Be honest: You tell you hear voices.",
                "nextline": "shortAnswer"
              },
              {
                "line": "Be vague: you can't exactly explain why, you just needed to discover what it was.",
                "nextline": "longAnswer"
              }
            ]
          },
          {
            "linename": "shortAnswer",
            "actor": "Kriss",
            "line": "Honestly?# I could hear a voice calling me.# I've been hearing voices all the time actually.#\nI felt I needed to follow it...# or them...",
            "nextline": "toEf"
          },
          {
            "linename": "longAnswer",
            "actor": "Kriss",
            "line": "Well,# I can't exactly explain how I was feeling...#\nI only know that the more I was getting closer,# the more the need to found out what it was...# hiding.",
            "nextline": "toMath"
          },
          {
            "linename": "toEf",
            "actor": "Corolla",
            "line": "Seriously?# And you say it only now?",
            "comment": "Corolla looks at you upset."
          },
          {
            "actor": "Efeliah",
            "line": "Voices you say...# Interesting...",
            "comment": "She looks away,# thoughtfully,# hand on her chin."
          },
          {
            "linename": "toMath",
            "actor": "Math",
            "line": "And doing so you fulfilled the prophecy.",
            "comment": "Math says joining his hands as he is praying."
          },
          {
            "precomment": "In the meantime,# you have reached the end of the pathway.#\nYou emerge one by one from a pit hidden between the rocks,# at the feet of the spire.#\nTheo indicates somewhere to the west:",
            "actor": "Theo",
            "line": "Ayonn is that way.",
            "comment": "And without further ado he starts walking.#\nHe's carrying a huge backpack no one of you could ever lift,# as if it's nothing.#\nThe telepaths just informed you the city is closer than you thought.# You all promptly start following him."
          },
          {
            "actor": "Math",
            "line": "Ayonn,# the legendary city...# Can you explain in this case why you feel you need to go there?"
          },
          {
            "actor": "Smiurl",
            "line": "The mythic city of light!# You've heard about it too, right?## It's a fearful place!# Where spirits,# not men,# dwell!"
          },
          {
            "precomment": "Smiurl has interrupted Math with his usual excitement.# Efeliah then says reassuringly:",
            "actor": "Efeliah",
            "line": "I don't think the 'spirits' will be that fearful...",
            "comment": "She then waits for your answer.",
            "break": true
          },
          {
            "actor": "Kriss",
            "line": "I have a more rational reason this time.# So far,# excluding your little village,#\nI have seen no trace of proper civilisation,# and no technology whatsoever.##\nIf Ayonn is even remotely what they say it is,# well...# In that case I am confident I will find some answers there."
          },
          {
            "precomment": "Math and Efeliah look at you with an indecipherable expression.# After few seconds,# you ask:",
            "actor": "Kriss",
            "line": "...what?"
          },
          {
            "precomment": "Math shakes his head:",
            "actor": "Math",
            "line": "You won't find the civilisation you seek there...## About the answers,# only time will decide on giving them to you."
          },
          {
            "precomment": "Then he moves his attention to Corolla.",
            "actor": "Math",
            "line": "What about you instead, Corolla?# What drove you to stick to Kriss here and comply with his 'sensations'?"
          },
          {
            "precomment": "For an instant,# she looks like she has been hit by something.# But she quickly regain her composure:",
            "actor": "Corolla",
            "line": "We had already decided to leave those guys.# A Horde is no place for people like us."
          },
          {
            "precomment": "She looks with pride and affection to Theo and Smiurl.# Then she adds:",
            "actor": "Corolla",
            "line": "I guess Kriss' arrival was the signal we were waiting for.# And...#\nI also have some kind of hunch about him.",
            "comment": "She slyly smiles at you as usual."
          },
          {
            "actor": "Math",
            "line": "I see.",
            "break": true
          },
          {
            "actor": "Smiurl",
            "line": "In the city of light there is only terror!# And spirits!",
            "comment": "Smiurl repeats protesting.#\nHe must have felt like the conversation was going off-topic."
          },
          {
            "actor": "Corolla",
            "line": "Please Smiurl, get it over with it...!"
          },
          {
            "actor": "Efeliah",
            "line": "Be reassured Smiurl:# we won't have much to fear from these 'spirits'...# as long as we are with you,# at least."
          },
          {
            "actor": "Math",
            "line": "There are other more tangible dangers from which we need to defend ourselves now."
          },
          {
            "actor": "Theo",
            "line": "Precisely.# Do you have any weapon with you?",
            "comment": "Theo intervenes."
          },
          {
            "actor": "Math",
            "line": "No Theo.# We telepaths follow the Master's teachings,# which include never using any wepon..."
          },
          {
            "actor": "Efeliah",
            "line": "...and never hurt anyone,# for whatever reason.##\n'Do all you can to avoid conflict;# if it proves to be inevitable,# lavishly endeavour to contain the damage'."
          },
          {
            "actor": "Math",
            "line": "So reads the principle no. 372, from 'Memories of the Master'.",
            "break": true
          },
          {
            "precomment": "After this display of academic knowledge,# Theo grunts in answer.# Then, after sighing,# he states:",
            "actor": "Theo",
            "line": "I understand your personal defense is entrusted to us..."
          },
          {
            "actor": "White",
            "line": "Maybe",
            "comment": "Math and Efeliah answer simultaneously."
          },
          {
            "actor": "Theo",
            "line": "What do you mean?"
          },
          {
            "actor": "Efeliah",
            "line": "Time will answer to you as well, Theo.",
            "comment": "Efeliah concludes."
          },
          {
            "precomment": "Theo then adds, too low to be heard by the two of them:",
            "actor": "Theo",
            "line": "Whatever...# If I were a Horde member,# I couldn't care less about their code..."
          },
          {
            "actor": "Math",
            "line": "You are way too clever to be one of them.",
            "comment": "Math says smiling.# Theo rolls his eyes."
          },
          {
            "actor": "Kriss",
            "line": "You'd better get used to it Theo, like me...# Be careful what you 'think'!",
            "comment": "You playfully whisper next to him.",
            "childid": "7_02"
          }
        ]
      },
      {
        "id": "7_02",
        "type": "Dialogue",
        "recap": "glimpse of telepathy",
        "text": "You walked all day long.# The sun is about to set,# and in front of you,# in the distance,#\nyou can see the first rocky ridges rising from the desert plain.#\n\n",
        "dialogues": [
          {
            "actor": "Theo",
            "line": "Those,# are part the Mazerock.",
            "comment": "Theo comments."
          },
          {
            "precomment": "You don't like how that name sounds.# Maze...# Labyrinth...# Your mind can't help but thinking about the Labyrinth of Knossos.#\nYou hope that some kind of 'Minotaur' won't be there waiting for you all to be his next meal.##\nAfter few instants,# you smile at that image:",
            "actor": "Kriss",
            "line": "He'll need a steel stomach to digest Theo!",
            "istelepathy": true,
            "comment": "You think to yourself."
          },
          {
            "actor": "Efeliah",
            "line": "Don't you think we should tell him about it...?",
            "istelepathy": true,
            "comment": "You 'hear' Efeliah whispering."
          },
          {
            "actor": "Math",
            "line": "I don't know...# We aren't sure of it after all...",
            "istelepathy": true,
            "comment": "Math whispers back.#\n\nThey are walking in front of you.# You shouldn't be able to hear them whispering like that.#\nMoreover,# Smiurl is walking with them,# and he seems completely unaware of their conversation.#\nIf he could hear them,# knowing him,# you're sure he would not be indifferent like that.",
            "replies": [
              {
                "line": "Keep on walking pretending you can't hear them.",
                "childid": "7_03"
              },
              {
                "line": "Get closer to better listen what they're saying.",
                "childid": "7_04"
              }
            ]
          }
        ]
      },
      {
        "id": "7_03",
        "type": "Story",
        "recap": "dissimulate telepathy"
      },
      {
        "id": "7_04",
        "type": "Story",
        "recap": "the eavesdropper"
      },
      {
        "id": "7_05",
        "type": "Minigame01",
        "recap": "guess what I'm thinking"
      }
    ]
  ]
}