{
  "lastchapter": {
    "number": "0",
    "iscomplete": false
  },
  "inventory": [

  ],
  "chapters": [

    [
      {
        "id": "0_01",
        "type": "Story",
        "isvisited": false,
        "recap": "start of chapter one",
        "text": "-------------------------------\n|          CHAPTER 1          |\n-------------------------------\n\n\n###You are walking home after a long day.\n#There's no doubt, this hasn't been a nice day.\n#You missed every possible bus and/or train.\n#And it started raining,# too. #Of course, you do not have an umbrella with you.\n\n#Looking up at the sky, it looks like all the clouds in the world just decided to gather right above your head,#\nswallowing all of light and propagating dark vibes to the atmosphere and to the ground.",
        "childid": "0_02"
        
      },
      {
        "id": "0_02",
        "type": "Choice",
        "isvisited": false,
        "recap": "rain intensify",
        "text": "A $WLightning$C suddenly strikes, #not too far away!\n\n##You shudder, stunned with its power.\n\n##After few breathless seconds, #you breathe again \nand smell the ozone that was formed by the action of the electricity over the oxygen molecules.\n\n##You realise you have to move fast if you don't want to end up way more soaked than you already are.\n\n\n\n$D[Select with arrow keys and press enter]$C.\n\n",
        "choices": [
          {
            "desc": "You start running. Let's minimise the water intake.",
            "childid": "0_03"
          },
          {
            "desc": "The water does not bother you that much. You are already soaked. So why rush?",
            "childid": "0_04"
          }
        ]
      },
      {
        "id": "0_03",
        "type": "Story",
        "isvisited": false,
        "recap": "running home",
        "text": "Speeding through the water, you feel the drops of rain smashing onto your face and body with unexpected strenght.\n#You run even faster, trying to ignore the suffocating feeling of the water splashing down your face.\n#\nThe wind howls between the unstopping, ever increasing noise of water hammering the asphalt.\n#You feel your heart bouncing in your chest and hear your now accelerated breathing.\n#\nYou are almost home, when you hear it.\n#\n$G<<...>>$C\n###\nWas it real? \n##For a split second you thought someone called on your name. It must have been all that noise...\n#\n#$G<<..ris..>>$C\n###\nIt was clearer this time!\n\n\n",
        "childid": "0_05"
      },
      {
        "id": "0_04",
        "type": "Choice",
        "isvisited": false,
        "recap": "walking home",
        "text": "Resigned to your fate, you try to keep your head down,\ntrying to avoid being temporarily blinded by the water in your eyes.\n#\nThe wind howls between the unstopping, ever increasing noise of water hammering the asphalt.\n#\nYou also try to avoid the huge pools of water that are now forming on the road,\npraying that no vehicle will rush over them splattering you with some nice mud.\n#\nYou reach the bottom of the little hill that is in front of your house.\n#You raise your eyes, and right when you are about to turn towards your gate, you see something.\n#\nOn the top of the hill, there is something...# someone...# you can't say for sure.\n##\n\n",
        "choices": [
          {
            "desc": "You think you saw it wrong. Why waste time climbing the hill with this weather?",
            "childid": "0_08"
          },
          {
            "desc": "You decide to go and check. Someone could need help.",
            "childid": "0_07"
          }
        ]
      },
      {
        "id": "0_05",
        "type": "Choice",
        "isvisited": false,
        "recap": "who whispered",
        "text": "You turn around, looking for the source of the voice.\n#\nIt's hard to see something in the midst of this unexpected thunderstorm.\n#You squint your eyes, fighting against the trickles of water that run into them.\n#\nAfter few seconds, you think you're seeing something.# On the top of the hill in front of your house.\n#It looks like there is something... #someone...# there.\n##But then you realise it's quite unlikely you could have heard your name called from that distance,\nwith all that noise.##\n\n\n",
        "choices": [
          {
            "desc": "You hate to stay more time under the rain... but... you never know?",
            "childid": "0_07"
          },
          {
            "desc": "You must have misheard. And if something's there, it's none of your business.",
            "childid": "0_08"
          }
        ]
      },
      {
        "id": "0_07",
        "type": "Story",
        "isvisited": false,
        "recap": "at the tree",
        "text": "You painstakingly reach the top of the hill, where a lonely big oak tree stands.\n#It looks like nobody is here after all.\n#\nYou are about to go back down, to the comfort of your home at last, when you hear it!\n#\n$G<<Chris!>>$C\n#\nYou heard it right, you can't be wrong. It feels like the wind is calling your name to the rain...\n#You feel a tingling sensation in the back of your neck,# somehow you $Wfeel$C someone's behind you.\n#\n#Then...## it all happen in an instant...##\n\nThe figure at the corner of your eye...\n###The realisation that standing beneath a tree during a storm is not the safest option...\n###The blinding light and the deafening boom suddenly engulfing you.\n###\n###Then...## only darkness.##",
        "childid": "1_01"
      },
      {
        "id": "0_08",
        "type": "Story",
        "isvisited": false,
        "recap": "by the gate",
        "text": "You are about to enter past your gate, to the comfort of your home at last, when you hear it!\n#\n$G<<Chris!>>$C\n#\nIt feels like the wind is calling your name to the rain...\n#It feels like the sound comes from behind your shoulders, but at the same time from afar.\n\n#You feel a tingling sensation in the back of your neck,# somehow you $Wfeel$C someone's behind you.\n#\n#Then...## it all happen in an instant...##\n\nThe figure at the corner of your eye...\n###The blinding light...\n###The deafening boom suddenly engulfing you.\n###\n###Then...## only darkness.",
        "childid": "1_01"
      }
    ],

    [
      {
        "id": "1_01",
        "type": "Story",
        "isvisited": false,
        "recap": "awoke",
        "text": "-------------------------------\n|          CHAPTER 2          |\n-------------------------------\n\n\n$G<<You are alive...>>$C##\n\nWhose is that voice?# Your own?# Have you actually heard it?#\n\nYou slowly open your eyes, as thoughts resume their flow in your mind, trying to re-establish contact with reality.\n#\nIt takes several second to clear up your sight. You feel quite wrecked.\n#Just breathing deeply is a pain. You painfully, slowly sit up, and look around.\n#\nYou don't recognise what you see. You try hard to remember, and it finally gets back to you.\nHow can you still be alive after being hit by...# the lightning?\n#By the way,# you are still soaked to the bone.\n",
        "childid": "1_02"
      },
      {
        "id": "1_02",
        "type": "Action",
        "isvisited": false,
        "recap": "look around",
        "text": "$c\"Maybe I am dead,# afer all.\"$C you say aloud, reconsidering the plausibility of that scenario.\n#\nIn the meanwhile, you look at the small reddish vale that lies downhill.\n#There is smoke ascending from what it looks like several fires or arsons.\n#\nYou carefully stand up, getting dizzy until your sense of balance stabilises.\n#\n\n$D[When you see the prompt \"\\>\", type an action you want to perform. Press TAB if you need help.]$C",
        "actions": [
          {
            "verb": "look",
            "childid": "1_03"
          },
          {
            "verb": "walk",
            "childid": "1_04"
          },
          {
            "verb": "go",
            "childid": "1_04"
          },
          {
            "verb": "run",
            "childid": "1_05"
          },
          {
            "verb": "laugh",
            "childid": "1_06"
          },
          {
            "verb": "cry",
            "childid": "1_07"
          },
          {
            "verb": "shout",
            "childid": "1_08"
          },
          {
            "verb": "scream",
            "childid": "1_08"
          }
        ]
      },
      {
        "id": "1_03",
        "type": "Story",
        "isvisited": false,
        "recap": "lookresult",
        "text": "$CThe first thing you notice is the sky, streaked with a cloud that looks like a jetstream of a plane.\n#It has a strange, alien color.\n#\nThe sun is setting, shedding its last light painting with odd glares the celestial vault,\nwhich is already welcoming the faint sparkle of several stars.\n#\nA little downhill, you then notice an earth road going down towards the vale.\n#It points in the direction of the fires.\n#Looking more intently, you discern there must be some kind of village there.\n#\nIt looks like there's nowhere else to go, at the moment.",
        "childid": "1_09"
      },
      {
        "id": "1_04",
        "type": "Story",
        "isvisited": false,
        "recap": "go or walk",
        "text": "You find your way downhill, following the earth path.\n\nAs you descend, the path gets narrower, meandering between an increasing number of trees.\n#\nTime passes, and night falls. Light recedes and you find yourself relying on the faint light of the stars.\n\nAs darkness takes hold, $rominous reddish glares$C paint the corners of the scene.\n#You understand it's the light coming from the fires. You are getting closer.\n#\nThe trees thin out and you can see the village entry a little further in front of you.",
        "childid": "1_10"
      },
      {
        "id": "1_05",
        "type": "Story",
        "isvisited": false,
        "recap": "run",
        "text": "You won't waste time. You rush downhill flying over the earth road.\n\nAs you descend, the path gets narrower, meandering between an increasing number of trees.\n#\nThis does not slow you down, nor the fact that running through the vegetation leaves\nmany marks on your skin, especially your arms and face.# You don't even realise it at the moment.\n\nTime passes, and night falls. Light recedes and you find yourself relying on the faint light of the stars.\n\nAs darkness takes hold, $rominous reddish glares$C paint the corners of the scene.\n#You understand it's the light coming from the fires. You are getting closer.\n#\nThe trees thin out and you can see the village entry a little further in front of you.",
        "childid": "1_10"
      },
      {
        "id": "1_06",
        "type": "Story",
        "isvisited": false,
        "recap": "laugh",
        "text": "You can't explain the reason of it to yourself, but for some reason, you start chuckling.\n#Maybe it's the absurdity of the situation, or maybe it's a nervous reaction.\n#\nAnyway, you keep on laughing, louder and louder, until your voice becomes hysterical,\ndistorted, overlapped with its own echo.\n##\nAfter a while, you fell quite, the sound disperses around, and you feel some kind of sense of awkardness.",
        "childid": "1_09"
      },
      {
        "id": "1_07",
        "type": "Story",
        "isvisited": false,
        "recap": "cry",
        "text": "Your mind is rushing.\n#$c<<What is this place?>>\n#<<Am I dead?>>\n#<<Am I in some hell?>>\n#<<How do I get home?>>\n#<<Is there anybody here?>>\n#\n$CAfter few moments, you burst out crying.# You weren't expecting it, but you can't help it.\n#\nAfter few minutes of what you classify as a pathetic scene, you feel better for some reason.",
        "childid": "1_09"
      },
      {
        "id": "1_08",
        "type": "Story",
        "isvisited": false,
        "recap": "shout",
        "text": "This is clearly impossible.# You must be dreaming.# Or maybe it's just some kind of sick prank.\n#\nWhatever it is, it's unacceptable. You feel your rage rising, supercharged by your pain and fear.\nIt soon becomes too much to hold inside, so you let out a mighty shout.\n#\nYou scream at the space around you.\n#To whoever might be listening.\n#To your own fate.\n#\nYou feel liberated.",
        "childid": "1_09"
      },
      {
        "id": "1_09",
        "type": "Action",
        "isvisited": false,
        "recap": "still there",
        "text": "You stand on this hill, like the one that is in front of your house.\n#But the similarities end there. There are no places like this around your place,\nmaybe not even in your whole nation.\n#\nYou are still wondering what happened and how did you end up here.\nYou try to keep calm, thinking about what to do next.\n",
        "actions": [
          {
            "verb": "look",
            "childid": "1_03"
          },
          {
            "verb": "walk",
            "childid": "1_04"
          },
          {
            "verb": "go",
            "childid": "1_04"
          },
          {
            "verb": "run",
            "childid": "1_05"
          },
          {
            "verb": "laugh",
            "childid": "1_06"
          },
          {
            "verb": "cry",
            "childid": "1_07"
          },
          {
            "verb": "shout",
            "childid": "1_08"
          },
          {
            "verb": "scream",
            "childid": "1_08"
          }
        ]
      },
      {
        "id": "1_10",
        "type": "Story",
        "isvisited": false,
        "recap": "raidedvillage",
        "text": "A small town lies in front of you.\n#Or, to better say, what is left of it.\n#\nThere is one main earth road that divides two main groups of houses, and little else.\nMany buildings are in flames or already burnt to the ground.\nFew others are seemingly intact.\n#\nThere are no vehicles.\n#No living soul is to be found around.\n#\n\nYou keep on walking, and after few seconds you spot the first one.\n##\n$WA man.$C# Lying on his back, eyes wide open, staring into nothingness.\n#An arrow stuck deep in his chest.# $WClearly dead.$C# Few flies buzzing around his mouth already.\n##\nYou retch.",
        "childid": "1_11"
      },
      {
        "id": "1_11",
        "type": "Choice",
        "isvisited": false,
        "recap": "findshelter",
        "text": "$c<<Where the heck am I...?# What is going on?# What am I supposed to do?>>$C you ask yourself when you feel better.\n#\nYou keep on walking and realise the road is scattered with corpses.# Some kind of battle must have taken place...\n#\nYou keep on walking, slowly, appalled.# You lose track of time, while your mind tries to grasp the reality.\n#You cannot find an explanation to any of the things you are experiencing.\n\n\n##After a while, you find yourself leaning on an empty doorframe of a house, which was somehow spared by the fire.\n#\nYou shake up, shuddering. This reminds you that you should find some kind of shelter for the night,\n#get dry,# and possibly not burnt.\n\n\n\n",
        "choices": [
          {
            "desc": "You had enough for today. Nothing you may find inside the house could be worse than what is outside.",
            "childid": "1_12"
          },
          {
            "desc": "You just can't walk through that door, into the darkness...",
            "childid": "1_13"
          }
        ]
      },
      {
        "id": "1_12",
        "type": "Action",
        "isvisited": false,
        "recap": "enter house",
        "text": "Overcoming fear with need, you enter the silent,# dark,# house.# You don't expect to find anybody in there.\n#It's a very humble abode, earthen floor, small windows, few ornaments.\n#\nA fireplace signals the kitchen. A table, some chairs.# You suddenly realise how hungry you are.\n#The only other room is the bedroom, a simple bed, a closet.\n#All furniture pieces are made of the same wood.\n#It doesn't look like there is running water anywhere. You can't even find a toilet.\n#\n\n$D[Usually, an action (verb) has to match an object (for example: $ddrink $Dthe $dwater$D)]$C",
        "actions": [
          {
            "verb": "search",
            "objects": [
              {
                "obj": "food",
                "answer": "You find a loaf of bread, some unidentified fruit and some cheese.",
                "effect": {
                  "item": "food",
                  "value": true
                }
              },
              {
                "obj": "water",
                "answer": "There is covered jug full of water on the kitchen counter.",
                "effect": {
                  "item": "water",
                  "value": true
                }
              },
              {
                "obj": "clothes",
                "answer": "You find a pair of trousers, and a woolen shirt. They feel rough and old.",
                "effect": {
                  "item": "clothes",
                  "value": true
                }
              },
              {
                "obj": "money",
                "answer": "You can't find anything valuable."
              }
            ]
          },
          {
            "verb": "sleep",
            "condition": {
              "item": "clothes",
              "value": true,
              "refusal": "I don't want to lay down with these dirty clothes on."
            },
            "objects": [
              {
                "obj": "bed",
                "childid": "1_14"
              }
            ]
          },
          {
            "verb": "remove",
            "objects": [
              {
                "obj": "clothes",
                "answer": "You remove your soaked clothes wearing what you just found."
              }
            ],
            "condition": {
              "item": "clothes",
              "value": true,
              "refusal": "I need to find something to wear first."
            }
          },
          {
            "verb": "wear",
            "objects": [
              {
                "obj": "clothes",
                "answer": "You remove your soaked clothes wearing what you just found."
              }
            ],
            "condition": {
              "item": "clothes",
              "value": true,
              "refusal": "I need to find something to wear."
            }
          },
          {
            "verb": "rest",
            "condition": {
              "item": "clothes",
              "value": true,
              "refusal": "I don't want to lay down with these dirty clothes on."
            },
            "objects": [
              {
                "obj": "bed",
                "childid": "1_14"
              }
            ]
          },
          {
            "verb": "drink",
            "condition": {
              "item": "water",
              "value": true,
              "refusal": "I need to find some water."
            },
            "objects": [
              {
                "obj": "water",
                "answer": "You avidly drink the water, not caring about its taste."
              }
            ]
          },
          {
            "verb": "eat",
            "condition": {
              "item": "food",
              "value": true,
              "refusal": "I need to find something to eat."
            },
            "objects": [
              {
                "obj": "food",
                "answer": "You devour what you have found."
              }
            ]
          }
        ]
      },
      {
        "id": "1_13",
        "type": "Story",
        "isvisited": false,
        "recap": "still walking",
        "text": "Driven away by the thought of what you could find inside that dark place, you resume your grim exploration.\n#\nThe fires are almost out. Hostile embers spy on you from the corner of your eye.\n#Not a sound, you feel and hear your own blood pumping in your veins.\n##\nYou reach what looks like the center of that lost little town.\n#There is a stone landmark in the middle of the square.\nYou feel a rush of gratitude when you discover it's a fountain.\n#\nYou drink in a hurry, only now realising how thirsty you were.\n#The water has a funny taste, but you are too overwhelmed to notice orterra calpestata care.\n#You collapse on the ground, the most possible distant from any building,# fire,# or corpse.",
        "childid": "1_15"
      },
      {
        "id": "1_14",
        "type": "Story",
        "isvisited": false,
        "recap": "awake(house)",
        "text": "...##\n\n$G<<Wake up...>>$c##\n\n\"Who's calling...?\"$C you mutter sitting up on the bed, fighting to regain full consciousness.\n#You open your eyes, and you become freshly aware of the current situtation.\n#It feel like a boulder has been thrown down on you,# again.\n#\nYou don't know how long you've been asleep.# The sun must be high up already,\njudging from the light that filters through the thick, dirty window.\n#\nYou don't want to spend another minute in there, so you decide to hit the road.\n#\nOnce outside, you hesitate just a moment, spectating the wasted scenario.\n#Many other corpses you did not notice the night before, scavengers... You quickly turn your eyes away.\n#\nIt looks like the fires are completely extinguished now.\nThe acrid smell of smoke is still all around you.\n#You need to move. You start walking away, in the same direction as yesterday.",
        "childid": "1_16"
      },
      {
        "id": "1_15",
        "type": "Story",
        "isvisited": false,
        "recap": "awake(outside)",
        "text": "...##\n\n$G<<Wake up...>>$c##\n\n\"Who's calling...?\"$C you mutter, fighting to regain full consciousness.\n#You open your eyes, and you become freshly aware of the current situtation.\n#It feel like a boulder has been thrown down on you,# again.\n#\nYou don't know how long you've been asleep.# The sun is already high.\n#You slowly get back on your feet, aching after a night spent in an uncomfortable position.\nYou just hope you didn't get a cold or something worse having slept with your wet clothes out in the open.\n#Luckily, wherever you are, the season is warm.\n##\n$c<<Wherever I am...>>$C You shake your head and start moving.\n#You just resolutely decided you can't remain there for not even just a second.\nThere are many other corpses you did not notice the night before, scavengers... You quickly turn your eyes away.\n#\nIt looks like the fires are completely extinguished now.\nThe acrid smell of smoke is still all around you.\n#You quickly walk away, in the same direction as yesterday.",
        "childid": "1_16"
      },
      {
        "id": "1_16",
        "type": "Story",
        "isvisited": false,
        "recap": "exit village",
        "text": "You are just leaving the last houses of the village behind,\nwhen you notice something further away.#\n\nWhen you are close enough, you see they are freshly dug graves.# A dozen, maybe.\n#\nAll there's to see are just piles of earth. No tombstones. Only now nameless corpses.#\n\nYou look around, thinking about the fact that someone $Whad$C to be there to bury the bodies.\nObviously, they could not have dug those holes up and then taken turns in burying each other...$\n\nYou laugh at this thought.\n#But then a shiver runs down your spine, wondering if that was what had actually happened.\n\nYou manage to get yourself distracted by studying the ground.\nIt looks trodden and loose, as if there was a quite big number of people not so long ago.\nThere are two distinctive, neat marks. They look like...\nThey look like the mark two wheels of a chariot would leave behind..!#\n\nYou follow them with your eyes, disappearing in the distance in front of you,\nin an open, semi-desertic landscape.\n\nYou don't know where else to go, so you start following the trail.\nLuckily, even a child could do that.",
        "childid": "1_17"
      },
      {
        "id": "1_17",
        "type": "Choice",
        "isvisited": false,
        "recap": "reach camp",
        "text": "You walked all day long.# All you saw were little isolated trees, some bushes and some birds.\n#You feel exhausted. It's almost sunset, and you are about to despair.#\nBut then, you see it. A thin plume of smoke rising.\n#\n$c<<Please not another dead town>>$C you say in your mind,# while you start walking faster.##\n\nBy the time you get there, it's completely dark. In front of you, an encampment.\n#Your survival instinct tells you to lay down and crawl among the sparse low bushes and grass.\n\n#There are many tents around a huge bonfire. Some men are roasting massive chunks of meat on it.\n#The smell reaches you nostrils, and you almost faint: you had very little to eat in the last 48 hours.\n#Around the fire, many men are dancing to the rhythm of crude songs with obscure words.\n#Between a song and a piece of meat, they gulp down impressive mugs of what must be beer.\n\n#You look around: no movement at the sides of the encampent. And then you see them.##\n\nSlaves.# Women,# children.#\nThey are crammed inside several big cages on carriages,\nwhich tracks you now realise you've been following the whole day.# Then it dawns on you:\n\n#$c<<These thugs must be the responsibles of what I saw at that village!>>$C##\n\nYou think about the danger you put yourself in by following them,\nbut that feeling gets obscured by the disgust and rage.# You shouldn't, but you $Whave$C to do something.\n\n\n",
        "choices": [
          {
            "desc": "You feel you must do something... But it's too dangerous, you don't want to end up in one of those cages.",
            "childid": "1_29"
          },
          {
            "desc": "You know it's a foolish idea, but you can't just leave them to their fate. You must help them.",
            "childid": "1_18"
          }
        ]
      },
      {
        "id": "1_29",
        "type": "Story",
        "isvisited": false,
        "recap": "exit village",
        "text": "You sneak around, looking for anything you could use in order to survive another day, possibly more.#\nYou need to find supplies, and you want to understand who these people are exactly.#\nYou need to remain undetected.#\n\nLuckily, it looks like there are no guards around. Everybody must be celebrating... # the...# victory?##\nThinking about this, disgust and rage fill you again.#\nYou take a deep breath to calm down.#\n\nYou proceed on resuming your exploration\nwhen the entry of a tent right in front of you shakes as someone is getting out.#",
        "childid": "1_30"
      },
      {
        "id": "1_30",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "meet corolla",
        "text": "",
        "dialogues": [
              {
                "actor": "Corolla",
                "line": "And who would you be...?",
                "comment": "You freeze.#\nAfter few paralyzing istants, you manage to close your mouth, trying to dissimulate your fear.#\n\nThe voice belongs to a young woman; she is studying you intently, head tilted on one side.#\n\nShe is definitely attractive. She has black glinting eyes, long dark brown hair,\nglowing $Rred$C under the light of the torches around.#\nShe's wearing a wide shirt, quite open on her cleavage.#\nAs for the rest, she's squeezed in a pair of black, thick, stitched leather leggings.\n#Your eyes wonder maybe a little too long on the curve of her hips.#\n\nInteresting posture, self confident... with such a delicious narrow waist...#",
                "isbreakneeded": true
              },
              {
                "actor": "Corolla",
                "line": "Hey I asked you a question!",
                "comment": "With these words she snaps you out of your examining trance, smiling mischievously.#\nYou blush, while frantically trying to find something dignifying to say.#\nMeanwhile, you notice how strange her English is. You barely understand it. You don't recognise her accent.",
                "replies": [
                  {
                    "line": "Hey hey...! I don't believe you don't recognise me...! Haha come on let's go get drunk...",
                    "nextline": "JeorgheStepsIn"
                  },
                  {
                    "line": "Sorry ma'am, I didn't mean to be disrespectful. Could I explain? It's not as it seems...",
                    "nextline": "JeorgheStepsIn"
                  }
                ]
              },
              {
                "linename": "JeorgheStepsIn",
                "actor": "Jeorghe",
                "precomment": "The girl is about to answer, when a third rough, hoarse voice steps in.",
                "line": "What the heck is going on here?!",
                "comment": "A huge man appears. His malevolent scowl directed at her as at you."
              },
              {
                "actor": "Corolla",
                "line": "Jeorghe, you're always so dear...",
                "comment": "she answers back with sarcasm."
              },
              {
                "actor": "Jeorghe",
                "line": "You ugly b...!!"
              },
              {
                "actor": "Corolla",
                "line": "Ha! Watch your tongue...# or you may lose it!",
                "comment": "she interrupts him drawing a sharp knife from her belt in an instant.#\nStill, she is pointing it at his crotch, not at his tongue.#\n\nJeorghe growls, very openly suggesting he would try to kill her if he could.#\n\nThen his attention goes back to you."
              },
              {
                "actor": "Jeorghe",
                "line": "Who is this filth??# A prisoner?# No...# There were no men among them...# An intruder! A spy!",
                "comment": "He starts laughing wildly,\nsounding like an outboard motor who doesn't really want to start.#\nHe grabs a log amost big as your leg, in order to crack your head open.",
                "childid": "1_19"
              }
            ]
      },
      {
        "id": "1_18",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "meet corolla",
        "text": "",
        "dialogues": [
          {
            "actor": "Corolla",
            "line": "I wouldn't do it, if I were you.",
            "comment": "A voice behind you.# You freeze.#\nAfter few paralyzing istants, you slowly turn around, trying to dissimulate your fear.#\n\nThe voice belongs to a young woman; she is studying you intently,\nhead tilted on one side, leaning on one of the carriages.#\n\nShe is definitely attractive. She has black glinting eyes, long dark brown hair,\nglowing $Rred$C under the light of the torches around.#\nShe's wearing a wide shirt, quite open on her cleavage.#\nAs for the rest, she's squeezed in a pair of black, thick, stitched leather leggings.\n#Your eyes wonder maybe a little too long on the curve of her left hip protruding outwards,#\nsince she's leaning with her right elbow on one of the wheels.#\n\nInteresting posture, self confident... with such a delicious narrow waist...##"
          },
          {
            "actor": "Corolla",
            "line": "You know? The Chief could express severe disagreement... and heaven knows what he would do to you!\nNot to mention what Jeorghe would do to you too...#",
            "comment": "With these words she snaps you out of your examining trance, smiling mischievously.#\nYou blush, while frantically trying to find something dignifying to say.#\nMeanwhile, you notice how strange her English is. You barely understand it. You don't recognise her accent.",
            "replies": [
              {
                "line": "Wai... Wait a second! You won't tell him right? I, erm...!",
                "nextline": "JeorgheStepsIn"
              },
              {
                "line": "Rrright! Hey I was just looking... Wait, have we met before?",
                "nextline": "JeorgheStepsIn"
              }
            ]
          },
          {
            "linename": "JeorgheStepsIn",
            "actor": "Jeorghe",
            "precomment": "The girl is about to answer, when a third rough, hoarse voice steps in.",
            "line": "What the heck is going on here?!",
            "comment": "A huge man appears. His malevolent scowl directed at her as at you."
          },
          {
            "actor": "Corolla",
            "line": "Jeorghe, you're always so dear...",
            "comment": "she answers back with sarcasm."
          },
          {
            "actor": "Jeorghe",
            "line": "You ugly b...!!"
          },
          {
            "actor": "Corolla",
            "line": "Ha! Watch your tongue...# or you may lose it!",
            "comment": "she interrupts him drawing a sharp knife from her belt in an instant.#\nStill, she is pointing it at his crotch, not at his tongue.#\n\nJeorghe growls, very openly suggesting he would try to kill her if he could.#\n\nThen his attention goes back to you."
          },
          {
            "actor": "Jeorghe",
            "line": "Who is this filth??# A prisoner?# No...# There were no men among them...# An intruder! A spy!",
            "comment": "He starts laughing wildly,\nsounding like an outboard motor who doesn't really want to start.#\nHe grabs a log amost big as your leg, in order to crack your head open.",
            "childid": "1_19"
          }
        ]
      },
      {
        "id": "1_19",
        "type": "Choice",
        "isvisited": false,
        "recap": "jeorghe attack",
        "text": "$CJeorghe, a mass of muscles, rises his improvised weapon and lunges for you.#\n\nIn emergency mode, your brain instantly tells you that you need to act quickly.#\nAdrenaline starts pumping through your every vein.#\n\nWhere to go, in the middle of a desert?\n\n\n",
        "choices": [
          {
            "desc": "There's no way you can beat him. Run for your life...!",
            "childid": "1_20"
          },
          {
            "desc": "Fight that thug! Who does he think he is?",
            "childid": "1_21"
          }
        ]
      },
      {
        "id": "1_20",
        "type": "Story",
        "isvisited": false,
        "recap": "jeorghe attack",
        "text": "Panicking, you dart away, looking for any kind of cover.#\nThe brute chases you, smashing everything he ecounters on his path and/or swings.\nYou slide under the carriages,# then run between the nearest tents...##\n\nIt's all useless. He is always one step behind you.#\nFor one split second you get distracted by the noises he makes, and you turn your head a little to watch him.#\nIt soon proves to be a mistake.##\n\nLooking over your shoulder like that, you cannot see another man suddenly appearing in front of you.#\nHe doesn't even try to stop you.# He just stands there with arms crossed letting you stumble and fall to his feet,\nlike a prey trapped for its hunter.##\nYou realise you are surrounded.# There's no way out.#\n\nDuring a few instants, you can observe every detail of his face.#\n\nHis devious grin, anticipating with perverse joy what he's about to do.#\nHis stench, engulfing you as he rushes towards you.#\nTime seems to dilate allowing you to count every hateful, alcoholic capillary of his evil eyes.##\n\nYou raise your arm, as it could protect you from what it's surely going to happen.##\n\n\n",
        "childid": "1_22"
      },
      {
        "id": "1_21",
        "type": "Story",
        "isvisited": false,
        "recap": "game over",
        "text": "You raise your fists ready to engage your aggressor.#\n\nDuring a few instants, you can observe every detail of his face.#\n\nHis devious grin, anticipating with perverse joy what he's about to do.#\nHis stench, engulfing you as he rushes towards you.#\nTime seems to dilate allowing you to count every hateful, alcoholic capillary of his evil eyes.##\n\n\nThen, it's all over in an instant.#\nYou don't even have the time to think about the absurdity of the very thought of challenging such a brute.#\nThe strike, so strong, you don't even feel it.##\n\n\n$dYou should have run.##\n\n\n-- GAME OVER --##\n\n\n$DYou just died. You will start again from the last checkpoint. Make wiser choices, traveler.",
        "childid": "1_01"
      },
      {
        "id": "1_22",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "smiurl rescues",
        "dialogues": [
          {
            "precomment": "Suddenly, a hissing sound wounds the air!#\nA flying string appears out of nothing, winding tightly around Jeorghe's chest,#\nwith stones at its ends which hit him hard when they terminate their spiraling rotation.#\n\nLosing balance, the man falls down on one knee, and lets go of the log.#\n\nThen some kind of $Yshriek$C is heard, and something you can't identify hits the man again, knocking him down,\nleaving him growling and wriggling furiously on the ground.##",
            "actor": "Corolla",
            "line": "Make way, you morons...",
            "comment": "you hear the girl from before say as she approached,\nbreaking into the circle of spectators that has formed.#\n\nThen, everybody backs off, as someone new is arriving.#\nYou can't see who it is at first, you can only hear an odd jingling sound getting nearer.#",
            "childid": "1_23"
          }
        ]
      },
      {
        "id": "1_23",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "chief dialogue",
        "dialogues": [
          {
            "precomment": "$CThen,# he steps into the circle.#\n\nYou immediately recognise the Chief:#\nproud posture,# well-kept hair and beard,# intelligent, disdainful expression,# at times malign,# at times ironic.#\nHe's tall, more slender than all the other men around.#\n\nHe wears several jewelry around his neck,#\nand he carries a $cbig sword$C in its sheath and a chain (the source of the jingling) both hanging from his belt.#\n\nHe stops a few steps from you, his hands on his hips, observing the scene with curiosity.#",
            "actor": "Chief",
            "line": "What have you guys been up to? Look at you poor little Jeorghe...!#\nI think I need to choose better guards for myself!",
            "comment": "he mocks his man, kicking him a little to tease him."
          },
          {
            "precomment": "Jeorghe grunts with unspeakeable wrath:",
            "actor": "Jeorghe",
            "line": "Release me! Now!!"
          },
          {
            "precomment": "The Chief nods at his men,\n#and Jeorghe gets untied and escorted, not withouth any difficulties, somewhere else.",
            "actor": "Chief",
            "line": "Who are you? And, please, stand up now...",
            "comment": "he asks now, gesturing carelessly, and turning abruptly towards you."
          },
          {
            "actor": "Kriss",
            "line": "My name is Chris...",
            "comment": "you answer, after hesitating, just for a moment.",
            "childid": "1_24"
          }
        ]
      },
      {
        "id": "1_24",
        "type": "Choice",
        "isvisited": false,
        "recap": "chief question",
        "text": "$M\"How come you happen to be here?\"$C##\n\nYou are not prepared to answer this question.#\nYou had no chance so far to even think about it.#\n\n\n",
        "choices": [
          {
            "desc": "Lie blatantly",
            "childid": "1_25"
          },
          {
            "desc": "Tell the truth",
            "childid": "1_26"
          }
        ]
      },
      {
        "id": "1_25",
        "type": "Story",
        "isvisited": false,
        "recap": "improvised story",
        "text": "$c\"I.. erm... am from a nearby village.# To the north.\"# $CYou point with your hand in some random direction.#\n\n$c\"And, you know...# I heard about you guys...# What you're doing...\"# $CYou try hard to dissimulate your nervousness,#\nand to look tough and convincing enough.#\n\n$c\"So i told myself I should leave that rat hole,# and go and reach for you and be of help...# To...# The cause...?\"#",
        "childid": "1_27"
      },
      {
        "id": "1_26",
        "type": "Story",
        "isvisited": false,
        "recap": "honest truth",
        "text": "$c\"To be honest sir...# well, I was on my way home yesterday when...#\nI was struck by lightnining...# Yeah, and then I woke up outside that village...\"\n$CYou point somewhere behind you.\n\n$c\"After that, not knowing where to go, I just followed your tracks.\"\n\n$CSomeone in your public had already started chuckling; now almost everybody bursts out.#\n\nYou stop talking, you don't know what to expect next.#\n\nThe girl is the only one staring seriously at you.",
        "childid": "1_27"
      },
      {
        "id": "1_27",
        "type": "Dialogue",
        "isvisited": false,
        "recap": "Kriss gets his name",
        "dialogues": [
          {
            "actor": "Chief",
            "line": "Enough!",
            "comment": "Thunders the Chief. Immediately silence falls."
          },
          {
            "actor": "Chief",
            "line": "You have to agree with me, that's not a great story...\" $CHe adds giggling. #\n$M\"Who do you think might ever believe it?",
            "comment": "He draws close to you, examining you head to toes.#\nThen he goes back to staring you in the eyes."
          },
          {
            "actor": "Chief",
            "line": "You are no spy. You wouldn't have been so dumb and make all this noise.",
            "comment": "He concludes carelessly.#\nHe looks aside, thoughtful, right hand on his chin, left hand on his right elbow."
          },
          {
            "actor": "Chief",
            "line": "Mmmm... anyway... listen: I am in a good mood today.",
            "comment": "He snaps his fingers, and draws his face close to yours."
          },
          {
            "actor": "Chief",
            "line": "Here is my proposal: join us!",
            "comment": "Immediately a choir of protesting sounds arises.#\nMost of the men were hoping to enjoy an execution.#\nShe remains stoic."
          },
          {
            "precomment": "You yourself are surprised.# After a while, not having other choices, you say:",
            "actor": "Kriss",
            "line": "I'm in for it!"
          },
          {
            "actor": "Chief",
            "precomment": "The Chief smiles, then turns away quickly and while walking away adds:",
            "line": "Corolla: find a place for...\"$C he hesitates, as if your name sounds strange to him $M\"...Kriss.\"#\n\"In the end, two hands may steal more than a mouth can eat...#",
            "comment": "and he disappears, snickering.#\n\nShe takes you by the arm and leads you away,# under the hateful gazes of the others.",
            "childid": "1_28"
          }
        ]
      },
      {
        "id": "1_28",
        "type": "Story",
        "isvisited": false,
        "recap": "end of chap2",
        "text": "$D------- END OF CHAPTER 2 -------"
      }
    ]

  ]
}